{
  "url": "https://support.grammarly.com/hc/en-us/articles/115001417232-Grammarly-doesn-t-recognize-my-paid-account",
  "scraped_at": "2025-08-11T20:41:38.516701+00:00",
  "title": "Grammarly doesn’t recognize my paid account",
  "content": "If you previously purchased a Grammarly subscription or were invited to your organization’s subscription but only have access to Grammarly Free, you might have unintentionally created several Grammarly accounts and signed in to your free account.\nTo access advanced features included in your subscription, please identify which of your email addresses is associated with your paid account, sign out of your free account, and sign in to the paid one.\nTo identify the email address associated with your paid account, follow these steps:\nSearch every email account you use for the subscription confirmation email from Grammarly with one of the following subjects:\n“Nice Upgrade! Here’s Your Receipt & Renewal Information\n,”\n“\nYour Grammarly Account Is Now Activated!\n,”\n“\nWelcome to AI-powered writing assistance,\n”\nor\n“Activate Your Grammarly for Business Account.”\nIf you see such an email in your inbox, it means your paid account is associated with that email address.\nIf you purchased a subscription yourself, fill out the following form to find your paid account:\nLook up a Grammarly purchase\nAfterward, sign in to your paid account in the Grammarly applications you use.\nGrammarly for Windows\nFirst, log out of all Grammarly accounts by going to\nhttps://app.grammarly.com\nand clicking\nSign out\nin the lower-left corner of the page.\nThen, right-click on the Grammarly icon in the system tray and select\nSettings\n. In the window that opens next, go to\nAccount\nand click\nSign Out\n:\nRight-click on the Grammarly icon in the system tray, go to\nSettings\n→\nAccount\n, and click\nSign in\n.\nEnter your login credentials for the paid account in the next window.\nGrammarly for Mac\nFirst, log out of all Grammarly accounts by going to\nhttps://app.grammarly.com\nand clicking\nSign out\nin the lower-left corner of the page.\nThen, click the Grammarly icon in the menu bar and select\nSettings\n. Go to\nAccount\nand click\nSign Out:\nRight-click on the Grammarly icon in the menu bar, go to\nSettings\n→\nAccount\n, and click\nSign in\n.\nEnter your login credentials for the paid account in the next window.\nGrammarly browser extension or the Grammarly Editor\nFirst, log out of all Grammarly accounts by going to\nhttps://app.grammarly.com\nand clicking\nSign out\nin the lower-left corner of the page.\nGo to\nhttps://www.grammarly.com/signin\nand enter your login credentials for the paid account.\nGrammarly for iPhone or iPad\nOpen the Grammarly app on your device, go to\nAccount\n, tap on your name, and then tap\nLog out\n.\nTo log back in, open the Grammarly app, tap\nAlready have an account? Sign in\n, and enter your login credentials for the paid account on the next page.\nGrammarly for Android\nOpen the Grammarly app on your device, go to\nAccount\n, tap on your name, and then tap\nLog out\n.\nTo log back in, open the Grammarly app and enter your login credentials for the paid account.\nGrammarly for Microsoft Office\nFirst, log out of all Grammarly accounts by going to\nhttps://app.grammarly.com\nand clicking\nSign out\nin the lower-left corner of the page.\nOpen the Grammarly tab in Microsoft Word or Outlook and click\nLog out\n:\nGo back to the Grammarly tab in Microsoft Word or Outlook and click\nLog in\n.\nEnter your login credentials for the paid account.\nGrammarly for Microsoft Word on Mac\nFirst, log out of all Grammarly accounts by going to\nhttps://app.grammarly.com\nand clicking\nSign out\nin the lower-left corner of the page.\nClick the gear icon in the lower-right corner of the Grammarly sidebar and choose\nLog out:\nGo back to Microsoft Word, click\nLog in\nin the Grammarly sidebar, and enter your login credentials for the paid account.\nIf you purchased a subscription from the App Store or Google Play Store, check out this article:\nI can't access the paid features after paying via the App Store or Google Play Store\nNote:\nIf your account is associated with an organizational subscription and your organization uses an identity provider such as Okta, Microsoft Entra ID, or others to manage access to third-party applications and services, please sign in to Grammarly through your identity provider at the appropriate point in the above instructions.",
  "category": "Sign-in Help",
  "tags": []
}