{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090611-Error-Connecting-to-the-Grammarly-server",
  "scraped_at": "2025-08-11T20:41:50.760359+00:00",
  "title": "Error: Connecting to the Grammarly server…",
  "content": "The “Connecting to the Grammarly server…” message can indicate a problem with your local network, internet service provider, or computer settings. There could be a problem with your network configuration:\nTo resolve the issue, reboot your computer and sign in to your Grammarly account once again. To do that, open Microsoft Word or Outlook, click\nGrammarly\n, select\nLog In\nin the Grammarly tab, and log in using your Grammarly credentials:\nIf the issue persists, here are a few suggestions that may help:\nYour network or system administrator must ensure that your antivirus and/or firewall software allows access to the following internet addresses by adding exceptions to your firewall and/or antivirus software:\ncapi.grammarly.com (ports 80 and 443)\ndata.grammarly.com (ports 80 and 443)\nauth.grammarly.com (ports 80 and 443)\nIf you use a proxy, please verify that it supports the WebSocket protocol. You may need to check with your network administrator or internet service provider about this. Your system administrator can read more on Websocket support in\nthis article\n.\nCheck your type of internet connection—public, cellular, or satellite.\nIf you are on a public WiFi at work, school, in a hotel, or at a hospital, check with your network administrator to make sure online services such as Grammarly are supported and not intentionally blocked. Keep in mind that many public networks have limited bandwidth.\nIf you’re using a cellular data network or satellite internet, try a different network if possible. Cellular data and satellite internet connections commonly have slower connection speeds than cable internet or DSL.\nIf Grammarly for Microsoft Office doesn’t work after trying these steps, and you’re using Windows 10 or newer, we suggest switching to\nGrammarly for Windows\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.\nAlternatively, you can give\nthe Grammarly Editor\na try. For more information about the Grammarly Editor, visit\nthis page\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}