{
  "url": "https://support.grammarly.com/hc/en-us/articles/360009187612-How-does-the-Grammarly-Keyboard-work-on-iPhones",
  "scraped_at": "2025-08-11T20:44:35.764460+00:00",
  "title": "How does the Grammarly Keyboard work on iPhones?",
  "content": "Grammarly for iPhone is several apps in one—by installing it once, you’ll have access to the Grammarly Keyboard, the Grammarly iPhone Editor, and the Grammarly browser extension for Safari on your iOS device.\nNote:\nThis article covers the ins and outs of the Grammarly Keyboard. If you’d like to find out more about checking your documents on your iPhone, check out\nthis guide\n. For more information about Grammarly for Safari on iPhone, visit\nthis page\n. If you use Grammarly on your iPad, please review\nthis article\n.\nBefore you\ndownload and install\nthis app, make sure Grammarly is compatible with your mobile device. We support all iOS devices running iOS 14 or newer.\nIf you use iOS 15 or newer, you’ll also have the option to enable the Grammarly browser extension for Safari on your mobile device. For more information, check out\nthis article\n.\nThis article covers the following topics:\nGrammarly’s companion app\nChecking text\nDeactivating certain suggestion types\nManaging your keyboard settings\nGrammarly’s companion app\nThis is where you can set up and customize the Grammarly Keyboard for iOS. Here you can:\nPersonalize the Grammarly Keyboard\nManage your language preference and personal dictionary\nProvide feedback and contact support\nReview our Privacy Policy and Terms of Service\nChecking text\nOnce the Grammarly Keyboard for iOS is installed on your iPhone, open any app and tap on any text field to pull up the keyboard. You can then start typing, and the Grammarly Keyboard will automatically provide suggestions or correct typos.\nTip:\nTo view different variations of each keyboard character, tap and hold any of the keys.\nNote:\nIf you don’t see a green Grammarly logo in the upper-left corner of your keyboard after installation, tap on the globe icon in the lower-left corner of your keyboard.\nIf the Grammarly icon is gray, it indicates that you are typing in a sensitive field. Sensitive fields are typically associated with confidential information and may include password fields, email fields, web browser search fields, or similar.\nIf you see a gray Wi-Fi symbol on the Grammarly icon, it may indicate that there are problems with your internet connection.\nWhile you type, the Grammarly icon pulses to indicate that it's checking your text. You can keep typing as Grammarly checks for writing suggestions.\nIf there is a common mistake or a typo in the text, Grammarly will automatically correct the text and notify you about the change in the completions bar.\nAlternatively, Grammarly will provide a suggestion that you can accept or dismiss. You’ll see the number of Grammarly’s suggestions next to the Grammarly icon.\nTo accept a suggestion, tap on it in the suggestions bar. Grammarly will automatically apply the change to your text.\nFor a detailed explanation of the suggestion, tap the Grammarly icon in the upper-left corner of the keyboard. If there are several suggestions for your text, swipe left to read additional information about the next suggestion.\nIf you’d like to dismiss a suggestion, tap the Grammarly icon and press the\nDismiss\nbutton (the trash bin icon) in the lower-right corner of the keyboard.\nNote:\nThe Grammarly Keyboard for iOS fully supports all native keyboard features, including emoji, emoji search, and swipe functionality.\nYou can also check the tone of your message when using Grammarly for iOS. To learn more about this feature, check\nthis article\n.\nDeactivating certain suggestion types\nNote:\nThis feature is available only with Grammarly Premium, Grammarly for Business, and Grammarly for Education.\nCertain types of suggestions, such as adding the Oxford comma and passive voice suggestions, can be turned off. You can view and manage suggestions in your account settings by following\nthis link\n.\nKeep in mind that if you deactivate a certain type of suggestion, it will be deactivated in all of your Grammarly product offerings.\nManaging your keyboard settings\nYou can personalize the Grammarly Keyboard for iOS by opening the Grammarly companion app and tapping\nKeyboard\n.\nYou can adjust several aspects of your experience with the Grammarly Keyboard for iOS, such as changing your language preference and managing your personal dictionary.\nTo learn more about customization options in Grammarly for iPhone, please check\nthis article\n.",
  "category": "Grammarly for iPhone",
  "tags": []
}