{
  "url": "https://support.grammarly.com/hc/en-us/articles/360036559831-Error-We-weren-t-able-to-find-a-supported-Microsoft-Office-product-on-your-computer",
  "scraped_at": "2025-08-11T20:34:05.605805+00:00",
  "title": "Error: We weren't able to find a supported Microsoft Office product on your computer",
  "content": "If you see this error message when trying to install Grammarly for Microsoft Office, please make sure that a\nsupported version\nof Microsoft Office is installed on your machine:\nIf the issue persists, please follow these steps:\nStep 1\nDownload Grammarly for Microsoft Office at\nhttps://www.grammarly.com/office-addin/downloading\nand continue the installation, even if you see that error message.\nThen, open Microsoft Word or Outlook as an administrator. To do that, please right-click the MS Word or MS Outlook icon, and select\nRun as administrator\nfrom the dropdown menu.\nGo to\nFile\n>\nOptions\n>\nAdd-ins\n. In the\nManage\nsection, click\nGo...\nIn the\nCOM Add-ins\nmenu, click\nAdd\n.\nPaste\n%LocalAppData%\\Grammarly\\Grammarly for Microsoft Office Suite\nto the address bar, and open the folder with the latest version. The title of the folder will look similar to 6.8.261.\nIn the folder, please look for a folder with a title similar to 5496693E32 and open it. Then, select the GrammarlyShim32.dll file, and click\nOK\n.\nNote:\nIf you see an error message afterward, please try adding the GrammarlyShim64.dll file instead.\nSee if Grammarly appears in MS Word or MS Outlook.\nStep 2\nIf the previous step didn't help, please do the following:\nTemporarily turn off your antivirus software to follow the steps listed below.\nRight-click on the GrammarlyAddInSetup.exe file downloaded from\nhttps://www.grammarly.com/office-addin/downloading\nand select\nRun as administrator\n. If you don't have this option, please log in to Windows using the administrator account and try again.\nIf that doesn't help, double-click the GrammarlyAddInSetup.exe file and, when you see the\n“Welcome to Grammarly”\nwindow, press and hold\nShift\nand\nCtrl\nkeys on your keyboard, then click\nGet Started\n.\nCheck the\nInstall for all users\noption and click\nNext\n:\nNote:\nIf you don't see the option to install for all users, please download and run\nthis file\n.\nIf the issue persists, please repair MS Office as described here\nhttps://gram.ly/HSLv\nand try installing the add-in again.\nIf none of the above helped, reinstall Microsoft Office.\nIf Grammarly for Microsoft Office doesn’t work after trying these steps, and you’re using Windows 10 or newer, we suggest switching to\nGrammarly for Windows\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.\nAlternatively, you can give\nthe Grammarly Editor\na try. For more information about the Grammarly Editor, visit\nthis page\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}