{
  "url": "https://support.grammarly.com/hc/en-us/articles/21849156621837-App-actions-data-sharing",
  "scraped_at": "2025-08-11T20:31:20.927019+00:00",
  "title": "App actions data sharing",
  "content": "The\napp actions feature\nlets Grammarly for Business, Grammarly for Education, Grammarly Premium, and Grammarly Free users perform common tasks, like adding a GIF from Giphy or creating a task in Asana, through approved third-party apps.\nNote:\nThe app actions available to Grammarly Free users are adding a GIF from Giphy and adding an image from Unsplash.\nThis page explains how and when data is shared with these third-party apps in order to facilitate the use of app actions.\nOpt in to app actions\nUsers must initially opt-in to use each app action by viewing and accepting the 3rd-party’s privacy disclosure. If they choose not to complete this opt-in flow, they will remain opted out of that app action.\nTurn app actions on and off\nA Grammarly for Business admin can configure the app actions feature, including turning individual app actions on and off for their team,\nfrom the admin panel\n.\nIf you are a Grammarly Premium or a Grammarly Free user and you want to turn this feature off, please\ncontact the Support team\n.\nWhat data does Grammarly use for app actions?\nFor the app actions feature, Grammarly handles the following user data:\nUser-provided search terms:\nGrammarly handles user-provided search terms for the explicit purpose of transmitting that data in order to return relevant search results. User-provided search terms\nare not\nretained by Grammarly and when used with partner APIs are handled according to their respective privacy policies.\nUser-provided text field inputs:\nGrammarly handles user-provided text field inputs for ticket- and task-based actions so that Grammarly can create tickets and tasks on a user’s behalf. User-provided text field inputs\nare not\nretained by Grammarly and when used with partner APIs are handled according to their respective privacy policies.\nIf you have DLP enabled, please note that Grammarly does not sanitize user-provided search terms and text field inputs used by app actions and partner APIs.\nHow does Grammarly connect users to their third-party accounts?\nGrammarly makes use of the OAuth (Open Authorization) standard so that Grammarly users can access information in their third-party accounts.\nFor app actions that connect to third-party accounts, Grammarly users can only use these actions after connecting their accounts via OAuth. Once a user’s account has been connected, they can log out of that account through the Grammarly UI at any time.\nHow does Grammarly protect my data and privacy?\nGrammarly pledges to do right by our users with best-in-class security practices that keep data private and protected, and with a commitment to safe, responsible AI innovation. For more information, please review the\nGrammarly privacy and security FAQ\n.\nContent safety\nPlease note the following articles detailing how Giphy and Unsplash, which are used to retrieve images, GIFs, and stickers, handle content safety and moderation.\nWhen working with these partners, Grammarly uses the highest and most restrictive content safety settings that Unsplash and Giphy provide in an effort to help with content filtering on the results retrieved from user-provided search terms.\nUnsplash:\nContent Safety\nUnsplash Community Guidelines\nGiphy:\nSafe Search Terms\nGiphy Community Guidelines\nPrivacy policies\nPlease take note of the following policies and statements that detail how third-party partners—and, by proxy, Grammarly—handle data transferred from user-provided search terms and other information required to use and facilitate actions on the platform.\nAsana:\nAsana Privacy Statement\nAtlassian\n:\nAtlassian Privacy Policy\nCalendly:\nCalendly Privacy Notice\nGiphy:\nGiphy Privacy Policy\nUnsplash:\nUnsplash Privacy Policy\nMicrosoft\n:\nMicrosoft Privacy Statement\nHubSpot:\nHubSpot Privacy Policy",
  "category": "Privacy and Security",
  "tags": []
}