{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090571-Grammarly-for-Microsoft-Office-doesn-t-show-suggestions",
  "scraped_at": "2025-08-11T20:35:54.644949+00:00",
  "title": "Grammarly for Microsoft Office doesn't show suggestions",
  "content": "Note:\nIf the Grammarly sidebar doesn’t appear in Microsoft Word when you click\nOpen Grammarly\n, follow the instructions in\nthis article\n.\nIf you use Grammarly for Microsoft Office on a computer with multiple monitors, you may experience these problems:\nThe Grammarly sidebar is visible but doesn’t show suggestions\nThere are no underlines in the text\nTo resolve these issues, follow these instructions:\nOpen Microsoft Word or Outlook, click\nFile\n>\nOptions\n>\nGeneral\nIn the\nUser Interface Options\nsection, select\nOptimize for compatibility\nRestart Microsoft Word or Outlook and see if the issue persists\nNote:\nThis option is available if your Windows version is 8.1 or 10 and MS Office version is 2016, 2019, or 365.\nIf this doesn’t help, set your external monitor as the main one in your settings to resolve the issue. To do that, follow these steps:\nRight-click anywhere on the desktop and select\nDisplay Settings\nClick on the display in question, scroll down, and press\nMake this my main display\nAlternatively, please try the troubleshooting steps below to resolve the issue:\nFor multiple monitors:\nMove your Word or Outlook window to the primary monitor.\nFor any number of monitors:\nIn the\nScale\nand layout\nsection, set your display scaling to 100%.\nFor an ultra-wide monitor:\nMove your Word or Outlook window to the left side of the monitor.\nIf none of the steps above help,\nsend us\na screenshot of the problem that you see. You can find instructions on how to take a screenshot\nhere\n. Even a smartphone snapshot will do!\nAlternatively, we suggest switching to\nGrammarly for Windows\n(available on Windows 10 or newer)\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.\nYou can give\nthe Grammarly Editor\na try. For more information about the Grammarly Editor, visit\nthis page\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}