{
  "url": "https://support.grammarly.com/hc/en-us/articles/4412642815117-Grammarly-for-iPhone-user-guide",
  "scraped_at": "2025-08-11T20:46:09.088697+00:00",
  "title": "Grammarly for iPhone user guide",
  "content": "With Grammarly, your writing will remain polished even on the go. Whether you’re typing a quick text, writing an important email, or adding on to an existing document, Grammarly for iPhone can support you in your writing endeavor.\nGrammarly for iPhone is several apps in one—by installing it once, you’ll have access to the Grammarly Keyboard for iOS, the Grammarly iPhone Editor, and the Grammarly browser extension for Safari on your iOS device.\nNote:\nIf you are an iPad user, check out\nthis article\nabout Grammarly for iPad.\nBefore\ndownloading and installing\nGrammarly on your iPhone, make sure your device is running iOS 14 or newer. Grammarly for Safari on iPhone is available on devices running iOS 15 or newer.\nNote:\nTo start using the Grammarly iPhone Editor, you will first need to install the Grammarly Keyboard for iOS. Once you have installed the Grammarly Keyboard, you can start using the Grammarly iPhone Editor. You will also have the option to easily switch between the Grammarly Keyboard and your iOS keyboard anywhere that you type.\nIf you would prefer to use the Grammarly iPhone Editor without having to install the Grammarly Keyboard, please see our\nFeature Request\nsection to record your feedback.\nOnce installed, follow the on-screen instructions to set up Grammarly and log in using your account credentials. You will then access Grammarly’s companion app, where you can:\nCreate or edit existing documents\nSet up and personalize the Grammarly Keyboard for iOS\nManage your language preference and personal dictionary\nAccess your weekly Grammarly Insights report\nProvide feedback and contact support\nReview our Privacy Policy and Terms of Service\nTo find out more about creating or editing documents on your iPhone, review\nthis article\n.\nIf you’d like to learn more about the Grammarly Keyboard for iOS, check out\nthis guide\n.\nFor additional details on the Grammarly browser extension for Safari on iOS, review\nthis page\n.",
  "category": "Grammarly for iPhone",
  "tags": []
}