{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000089972-I-signed-up-with-the-wrong-email",
  "scraped_at": "2025-08-11T20:29:18.400074+00:00",
  "title": "I signed up with the wrong email",
  "content": "If you have access to the email address you used to sign up, you can update your Grammarly account information by following these instructions:\nSign in\nto your Grammarly account.\nNavigate to the\nProfile\ntab in your account.\nClick\nUpdate\nnext to\nEmail\n.\nEnter your new email address and click\nUpdate\nonce again. Your new email address cannot already be registered with a Grammarly account. If a Grammarly account associated with your new email address already exists, you will need to\ndelete it first\n.\nIn some cases, we’ll require you to enter a 6-digit code sent to your current email address. If you don’t have access to your email inbox, please check\nthis article\n.\nCheck your inbox to verify your new email address.\nIf you can't sign in with your current password,\nsend yourself a password reset email first\n.\nNote:\nThis method works only for individual plans and accounts originally registered using our standard sign-in method with an email address and password. If you registered using Google, Facebook, or Apple, but would like to change the email address on your Grammarly account, please follow\nthese steps\nfirst.\nPro users\nIf you no longer have access to the email address associated with your paid account and don't remember your password, please\nsubmit a support request\nto help us assist you further.\nPremium users\nIf you no longer have access to the email address associated with your Premium account and don't remember your password, please\nsubmit a support request\nto help us restore access to your account.\nYou’ll need to provide an alternative email address, along with Grammarly’s reference number on your bank statement, which should look similar to CO5DXT-8GCH, CO*5DXT-8GCH, 5DXT-8GCH, or qWe23zA. Alternatively, you can provide the following details:\nlast four digits of the credit card number you used for Grammarly\ncard network type (e.g., VISA)\ncredit card expiration date (month/year)\nthe charge date\nthe charge amount\nif you paid with PayPal, your PayPal email address and transaction ID\nIf you paid via the App Store or Google Play Store, a receipt of your payment\nNote:\nFor security reasons, please don’t provide all 16 digits of your credit card or attach photos of your credit card to support tickets. In order to verify the ownership of your account, we just require the details mentioned above.\nFree users\nIf you no longer have access to the email address you used to sign up and you don't remember your password, you will need to\ncreate a new account\nwith your new email address.\nImportant!\nWe recommend setting up a recovery email for your account in case you ever lose access to your email address. To do that, follow the steps from this article:\nSetting up and using a recovery email for your Grammarly account",
  "category": "Update Your Account",
  "tags": []
}