{
  "url": "https://support.grammarly.com/hc/en-us/articles/36124112455949-Grammarly-for-Windows-or-Grammarly-for-Mac-crashes",
  "scraped_at": "2025-08-11T20:29:34.486091+00:00",
  "title": "Grammarly for Windows or Grammarly for Mac crashes",
  "content": "Important:\nSometimes, this issue can be solved by simply restarting your computer. Make sure that you do so before proceeding to the steps below.\nWindows\nGrammarly for Windows relies on the Microsoft .NET Framework. Please ensure that this system component is healthy.\nTo fix the Microsoft .NET Framework, please do the following:\nDownload the repair tool from the\nMicrosoft .NET Framework Repair Tool\npage.\nRight-click the downloaded file and select\nRun as administrator\n.\nIf the tool repairs any system files, please restart your computer and see if the problem persists.\nIf the issue continues, try the following instructions:\nPress the\nWindows\nkey\n+\nR\nto open the\nRun command\nbox.\nType\nappwiz.cpl\nand press the\nEnter\nkey.\nClick\nTurn Windows\nfeatures\non or off\nin the left-side panel.\nClick the\n+\nsymbol next to each\nMicrosoft .NET\nor\n.NET Framework entry\nhere.\nCheck every box next to the\nMicrosoft .NET\nor\n.NET Framework\nentries\n.\nNote:\nA blue box does not mean everything is checked. You must expand the entry.\nClick\nOK\nand wait for the process to complete. This may take a few minutes.\nRestart the computer and see if the issue is resolved.\nAlternatively, you can try downloading and installing the latest Microsoft .NET Framework version available for your platform by following this link:\nDownload .NET Framework 4.8\n.\nIf this doesn’t help, please submit a support request here:\nContact Support\n. To expedite the resolution of the issue, we recommend that you submit the following details:\nA full-screen video of the issue you’re having. You can record it by following these instructions:\nHow to record a video of a technical issue I’m experiencing\n.\nIf you cannot record a video, specify the name of the app or website where the issue occurs and the steps we need to follow to reproduce the issue.\nMac\nTo troubleshoot this issue, follow the instructions in this Apple Support article:\nIf an app freezes or quits unexpectedly on Mac\n.\nIf that doesn’t help, please submit a support request here:\nContact Support\n. To expedite the resolution of the issue, we recommend that you submit the following details:\nA full-screen video of the issue you’re having. You can record it by following these instructions:\nHow to record a video of a technical issue I’m experiencing\n.\nIf you cannot record a video, specify the name of the app or website where the issue occurs and the steps we need to follow in order to reproduce the issue.\nInclude the crash reports. You can retrieve them by opening the\nConsole\napp and checking the\nCrash Reports\nsection. If you see any reports titled “Grammarly Desktop”, click them and copy-paste them into your support request:",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}