{
  "url": "https://support.grammarly.com/hc/en-us/articles/360046272372-Using-the-tone-detector-in-Grammarly-for-Microsoft-Office-in-Outlook",
  "scraped_at": "2025-08-11T20:48:16.004350+00:00",
  "title": "Using the tone detector in Grammarly for Microsoft Office in Outlook",
  "content": "Important:\nGrammarly for Microsoft Office will no longer be updated. We suggest switching to\nGrammarly for Windows\n(if you use Windows 10 or newer) or\nGrammarly for Mac\n(if you use macOS 10.15 or newer)\n, which supports integration with multiple applications and websites, including Microsoft Office apps. Alternatively, we encourage you to give\nthe Grammarly Editor\na try.\nIf you’d like to continue using Grammarly for Microsoft Office on a Windows computer, you can check the tone of your emails when you use Grammarly in Outlook.\nTo check the tone of your writing in Microsoft Outlook, please follow these steps:\nDouble-check that your version of\nGrammarly for Microsoft Office\nis 6.8.230 or newer.\nTo check the version, open Microsoft Outlook, click\nGrammarly\nin the toolbar, and select\nAbout\n. If your version is not up to date, reinstall Grammarly for Microsoft Office by following the steps in\nthis article\n.\nIf Grammarly is up to date, start replying to an email or composing a new one. Be sure to write a few sentences—the tone detector needs at least 150 characters to activate.\nClick the emoji that appears in the lower-left corner of Grammarly’s sidebar:\nYou can also click the\nTone Detector\nbutton in the Grammarly tab for more information about the tone of your writing:\nNote:\nAt this time, the option to turn off the tone detector in Microsoft Outlook is not available.\nOur tone detector is also available through\nGrammarly for Windows or Mac\n,\nthe Grammarly browser extension\n,\nthe Grammarly Keyboard for iOS\n, and\nthe Grammarly Keyboard for Android\n. This feature is not available in other Grammarly product offerings at this time.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}