{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090731-WebSockets-Support-Q-A-for-System-Administrators",
  "scraped_at": "2025-08-11T20:45:11.465183+00:00",
  "title": "WebSockets Support Q&A for System Administrators",
  "content": "This article is meant to assist your system or network administrator with enabling WebSockets on your system and on your Internet Network. Your network or system administrator is a person or a provider who administers your local network, your ISP, or your computer settings.\nQ: What does Grammarly need in order to function correctly?\nA: Besides HTTPS requests, Grammarly products use WebSockets to communicate with the text checking service. The WebSockets use HTTP and HTTPS, with the corresponding ports of 80 and 443. You can read more about WebSockets here:\nen.wikipedia.org/wiki/WebSocket\nwww.websocket.org/aboutwebsocket.html\nQ: We have ports 80 and 443 opened for any connections, but Grammarly encounters issues with WebSockets. What do we do?\nA: In order to work with your firewall correctly, WebSockets needs these ports to be “opened” and also needs some support on the firewall/proxy level.\nAfter establishing a connection, a browser issues an HTTP request with an Upgrade header, which is a hop-by-hop header, i.e. it is meaningful only for a single transport-level connection, and it is neither stored by caches nor forwarded by proxies by default. If a proxy/firewall is not aware of WebSockets and it doesn't forward it further (making some other effort alongside, like keeping the connection active), then it is impossible to establish a connection.\nPlease consult your proxy/firewall documentation about how to enable support for WebSockets.\nQ: We have protocol/domain/URL based firewall rules, what should we allow for Grammarly to work properly?\nA: Besides our HTTPS services (\n*.grammarly.com\n,\n*.grammarly.io\n,\n*.grammarly.net\n) for WebSockets, we use the following endpoints:\nwss://capi.grammarly.com/fpws\nwss://capi.grammarly.com/freews\nwss://dox.grammarly.com/documents\nwss://capi.grammarly.com/wstest",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}