{
  "url": "https://support.grammarly.com/hc/en-us/articles/29422880260621-Tailored-Assistance-Support",
  "scraped_at": "2025-08-11T20:45:01.840830+00:00",
  "title": "Tailored Assistance Support",
  "content": "Tailored assistance is a setting that allows Grammarly to collect, process, and store data, and to associate that data with your account to improve our product’s suggestions for you.\nTailored assistance aims to improve your Grammarly experience. By analyzing the ways and contexts in which you use Grammarly to communicate, our product can offer you insights that are more specific and personalized.\nTailored assistance is available to Grammarly Free, Grammarly Premium, and Grammarly Pro users at this time.\nGrammarly Pro\nTailored assistance is on by default. Account admins can opt out of tailored assistance at any time by visiting the\nFeature access\npage at\nhttps://account.grammarly.com/admin/feature_access\nIf the admin opts out of tailored assistance, all data stored to personalize the Grammarly experience for all users will be deleted. Users who are not admins cannot modify the tailored assistance setting for their accounts.\nWhen a user joins an existing Pro account, their tailored assistance settings will match the preferences set by the account’s admin. If a user leaves a Grammarly Pro account and becomes a Grammarly Free user, the tailored assistance setting will remain what it was when they were a member of the Pro account. The tailored assistance toggle will be visible to the user and modifiable if they wish to change that setting.\nGrammarly Premium and Grammarly Free\nFor most users, tailored assistance is on by default. Users can opt out of tailored assistance at any time by visiting the\nFeature customization\npage:\nhttps://account.grammarly.com/customize/features\nIf the user opts out of tailored assistance, all data stored to personalize their Grammarly experience will be deleted.\nFor users in the EU, UK, Iceland, Norway, Liechtenstein, and Switzerland, tailored assistance starts as off. Users can visit their settings to turn on tailored assistance. This will allow Grammarly to collect and store some information and associate it with their account to personalize the Grammarly experience for them.\nNote:\nGrammarly Premium users transitioning to Grammarly Pro will retain their previous settings.\nTailored assistance recommendations are personalized for each user account, and your writing will never appear in another Grammarly user’s suggestions. You can see what data Grammarly associates with your account by requesting a\npersonal data report\n.",
  "category": "Privacy and Security",
  "tags": []
}