{
  "url": "https://support.grammarly.com/hc/en-us/articles/38552366848781-Grammarly-Expert-Review-user-guide",
  "scraped_at": "2025-08-11T20:45:47.553632+00:00",
  "title": "Grammarly Expert Review user guide",
  "content": "The Expert Review agent identifies relevant subject-matter experts based on your text and suggests edits from the perspective of these experts.\nExpert Review\nis designed to take your writing to the next level—with insights from leading professionals, authors, and subject-matter experts. Whether you're polishing a blog post, crafting an essay, or finalizing an email, Expert Review helps you sharpen your message through the lens of industry-relevant perspectives.\nAvailability\nGrammarly’s\nExpert Review\nis fully available in docs, Grammarly’s AI writing surface, for Grammarly Premium and Grammarly Pro subscribers. Users on the Grammarly Free plan have access to a more limited experience.\nHow to access\nYou can access Expert Review in just a few clicks:\nOpen\na new doc from\napp.grammarly.com\nOnce you’ve either written a meaningful amount of text or copied and pasted your document from another writing surface, look to the\nright-hand panel\nof the screen and click the\nExpert Review\nbutton.\nThe agent will scan your full document to understand the subject matter and style of writing.\nNote:\nReferences to experts in Expert Review are for informational purposes only and do not indicate any affiliation with Grammarly or endorsement by those individuals or entities.\nHow to use\nOnce the Expert Review agent has cross-referenced your writing with relevant experts on the topic you’ve written about, you’ll see specific feedback surface on the right-hand side of the screen. This opens a tailored experience where expert-informed feedback is integrated directly into your document.\nHere's how it works:\nClick on an expert’s name to explore edits relevant to a particular section of your document.\nEach suggestion appears in a card that summarizes the key takeaway.\nClick\nShow example\nto see an expanded version.\nYou can choose to insert an example into your draft—or dismiss it if it’s not quite the right fit, ensuring you remain in control of what guidance you incorporate directly into your writing.\nCustomizing your expert feedback\nTailor your experience by preselecting the experts that matter most to your writing:\nClick\nChoose experts\nat the top right of the panel:\nAdd new experts by picking a\ndynamic topic\n, and Grammarly will suggest relevant contributors.\nTo remove an expert’s perspective, simply click the\nTrash icon\nnext to their name.",
  "category": "Agents",
  "tags": []
}