{
  "url": "https://support.grammarly.com/hc/en-us/articles/360054679292-What-are-Goals",
  "scraped_at": "2025-08-11T20:47:37.089949+00:00",
  "title": "What are Goals?",
  "content": "With the help of the set goals feature, Grammarly can offer tailored writing suggestions that take your audience and writing style into account. Aside from the domain or type of the document, you can also select the intended audience, formality, and intent of your writing.\nNote:\nAt this time, the option to customize your default goals is not available. You will need to adjust your goals for every document.\nAudience\nPrior to selecting this setting, determine who your target audience is. Selecting the appropriate option will help Grammarly provide tailored feedback about readability and clarity.\nFormality\nThe formality of your writing changes depending on the situation. This setting helps Grammarly understand whether the use of slang or colloquialisms is appropriate for a particular document or whether your writing is overly formal.\nDomain\nThis setting allows Grammarly to provide feedback based on the document type. We currently offer six domains. To learn more about this setting, check\nthis article\n.\nNote:\nAt this time, the option to select the domain is available to Premium, Business, and Grammarly for Education users only.\nIntent\nThe experimental intent setting currently doesn’t impact the list of provided suggestions, but it helps us understand what type of feedback you’d like to see in the future.\nThe goals feature is currently available in all Grammarly product offerings except for Grammarly for Mac, Grammarly for Windows, and Grammarly’s mobile keyboards. For detailed instructions on how to adjust your goals in each product offering, follow one of the links below:\nThe Grammarly Editor\nGrammarly for Microsoft Office\nGrammarly for Microsoft Word on Mac\nGrammarly for iPad\nYou can also learn more about this feature by visiting\nthis page\n.",
  "category": "Questions about Grammarly features",
  "tags": []
}