{
  "url": "https://support.grammarly.com/hc/en-us/articles/27448664194957-Manage-domain-controls",
  "scraped_at": "2025-08-11T20:38:37.162680+00:00",
  "title": "Manage domain controls",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nGrammarly is committed to\nstrong data privacy principles\nfor all users. You can specify additional restrictions for your team on what content or data Grammarly can access.\nThe domain controls feature allows Enterprise admins to control what internet domains Grammarly operates in. If a domain is added to the blocklist, your team members will not be able to use Grammarly on the corresponding websites.\nDomain controls are available for:\nGrammarly browser extensions for Chrome, Firefox, and Edge\nGrammarly for Windows\nGrammarly for Mac\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nTo configure domain controls, follow these steps:\nGo to your\nHome\npage, open the\nOrganization\ntab →\nEnterprise Security\n→\nDomains and apps\n.\nTo add a domain or website to the blocklist, click\nAdd to block list\nat the top of the page.\nIn the window that appears next, choose the\nDomain\noption and specify the domain you’d like Grammarly to be blocked from accessing in the\nDomain\nfield. Do not include prefixes like http:// or www.\nIf you wish to block all subdomains within a domain, check the box next to the\nInclude subdomains\noption. If this option is not selected, Grammarly will be blocked only on the main specified domain.\nSpecify on which level this control is applied:\nIf you want to block the domain for every member in your organization, select\nEntire organization.\nIf you want to block the domain only for specific member groups, select\nSpecific groups\nand choose which groups this setting should be applied to. Optionally, you can select\nMake this an admin controlled group\nif you also want to limit the ability to delete a specified group or remove members from that group only to admins. You can learn more in this article:\nHow to organize members into groups\nClick\nSave\n.\nOnce you save these settings, Grammarly will not operate in the domains you specify.\nYou can always remove domains from the blocklist on the\nDomains and apps\npage by clicking on the trash bin icon next to the domain you’d like to remove from the list.",
  "category": "Configure Access & Security",
  "tags": []
}