{
  "url": "https://support.grammarly.com/hc/en-us/articles/31296804338061-Introducing-billing-groups",
  "scraped_at": "2025-08-11T20:35:45.578404+00:00",
  "title": "Introducing billing groups",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nThe billing groups feature allows you to assign members of your Grammarly license to specific billing groups that you can align with your organization’s internal billing structure.\nTable of contents\nWhat are billing groups?\nHow to create billing groups\nHow to assign members to billing groups\nHow to merge billing groups\nHow to delete billing groups\nHow to allocate seats for billing groups\nBilling group contacts and their permissions\nQuestions and answers\nWhat are billing groups?\nBilling groups provide an additional layer for managing seats on your Grammarly license and allow you to associate members with specific internal budgets. For example, if your organization’s software procurement process involves allocating separate budgets for specific departments or teams, you can reflect this in your Grammarly license by creating corresponding billing groups.\nConfiguring billing groups for your Grammarly license allows for:\nEasier seat distribution and tracking across various departments or budgets within your organization.\nGetting seat usage insights by billing departments, empowering you to make informed decisions about seat reallocation, usage optimization, and renewals.\nSetting seat limits for billing groups, ensuring that teams or departments in your organization are in full control over their allocated seats.\nSeeing the exact date when members joined your Grammarly license.\nYou can find an overview of your organization's seat usage on the\nSubscription\npage:\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nHow to create billing groups\nBilling groups can be created automatically based on the cost center attribute passed from an identity provider or manually on the\nBilling Groups\npage.\nTo create a billing group manually, follow these instructions:\nGo to the\nBilling Groups\npage.\nClick\nCreate billing group\nin the upper-right corner.\nIn the window that opens next, enter the group name, assign members to it, optionally add the group’s billing contact, and click\nCreate\n:\nIf you use SAML single sign-on, you can configure the\nCostCenter\nattribute in your identity provider to automatically create billing groups based on the assigned cost centers.\nIf a new member’s cost center is associated with an existing billing group, they will be mapped to that billing group automatically. If no corresponding billing group has been created in Grammarly yet, a new billing group will be created based on the member’s cost center.\nMembers without a cost center attribute in your identity provider will be assigned to your organization’s default billing group. These members can be manually assigned to any of the existing billing groups later from the\nMembers\npage.\nHow to assign members to billing groups\nTo assign team members to a billing group, follow these steps:\nGo to the\nMembers\npage.\nCheck the boxes next to team members’ names and click\nAssign billing group\nin the lower-left corner of the page.\nIn the window that opens next, select a billing group from the list and click\nSave\n.\nHow to merge billing groups\nTo consolidate multiple billing groups into one, follow these instructions:\nGo to the\nBilling Groups\npage.\nCheck the boxes next to the groups you’d like to merge and click\nMerge billing groups\nin the lower-left corner of the page.\nIn the window that opens next, enter a name for the new billing group and click\nMerge groups\n.\nHow to delete billing groups\nTo delete a billing group:\nGo to the\nBilling Groups\npage.\nCheck the boxes next to the groups you’d like to delete and click\nDelete billing groups\nin the lower-left corner of the page.\nIn the window that opens next, click\nDelete\nto confirm the action.\nNote:\nMembers from a deleted group will be assigned to your organization’s default billing group.\nHow to allocate seats for billing groups\nIf you have enabled SAML single sign-on for your Grammarly license and configured the CostCenter attribute in your identity provider, you can allocate a specific number of seats for your billing groups. Follow these instructions to do so:\nGo to the\nBilling Groups\npage.\nClick on the three dots icon\n⋮\nnext to a billing group and select\nAllocate seats\n:\nIn the window that opens next, enter the number of seats you’d like to allocate to the billing group and click\nSave\n.\nOptionally, you can switch the toggle next to\nLimit billing group to the number of allocated seats\n.\nYou can review seat allocation changes in the\nSeat history\nsection:\nTo undo seat allocation for a billing group, delete the number of seats you entered in the seat allocation window and click\nSave\n.\nSeat allocation without limiting a billing group to the number of allocated seats\nIf the number of allocated seats is reached, members with the relevant cost centers can still join your organization’s license and will be mapped to the respective billing group.\nIn this case, we’ll display a warning next to the billing group on the\nBilling Groups\npage:\nAdditionally, an email notification will be sent to all admins of your Grammarly license and the billing group contacts.\nSeat allocation with limiting a billing group to the number of allocated seats\nIf the number of allocated seats is reached, but there are available seats in your organization’s default billing group, new members can still join your organization’s license for 30 days. If the number of allocated seats or the members’ billing group is not changed during this period, the affected members will be removed from the license.\nIf the number of allocated seats is reached, and there are no available seats in your organization’s default billing group, new members will not be able to join your organization’s license.\nBilling group contacts and their permissions\nBilling group contacts have the following permissions:\nAssign or unassign cost centers to their billing group.\nAssign or unassign billing contacts to their billing group.\nAdd or remove members from their billing group.\nExport the list of members of their billing group.\nAllocate, edit, or remove the number of available seats for the billing group.\nMerge their billing groups into one.\nYou can assign a billing contact to a billing group while creating the group or by opening an existing group and clicking\nEdit permissions\nnext to\nBilling contact\n:\nQuestions and answers\nWhat is the difference between cost centers and billing groups?\nCost centers are the attributes that you can define and assign to members in your identity provider. Cost centers can then be mapped to billing groups in your Grammarly license.\nFor example, a “Marketing team” billing group can have three cost centers assigned to it: “Digital marketing,” “Product marketing,” and “Content marketing.” In this case, members who have the “Digital marketing” cost center assigned to them in the identity provider will be mapped to the “Marketing team” billing group.\nCan a team member be part of more than one billing group?\nNo, a team member can be assigned to only one billing group.\nIs there a maximum number of billing groups that an admin can create?\nNo, there’s no limit to the number of billing groups that can be created.\nCan members with a cost center attribute be manually assigned to a billing group?\nMembers who were assigned a billing group through SAML single sign-on can be manually reassigned to any other billing group from the\nMembers\npage. However, upon their next authentication via SSO, they will be reassigned to the billing group according to their cost center attribute.\nIf SCIM provisioning is enabled, only members without a cost center assigned in the identity provider can be manually added to a billing group.\nIf I change the billing group name in Grammarly, will that update my SCIM provisioning settings in the identity provider?\nNo, billing groups and cost center names are separate.\nHow can I view a member’s join date?\nOpen a billing group that the member is part of and check the\nJoin date\ncolumn next to their name and email address:\nYou can also view the join date on the\nMembers\npage.\nNote:\nIf there is no\nJoin date\ncolumn, click on the\nColumns\nmenu at the top of the member list and check the box next to\nJoin date\n.",
  "category": "Manage Subscription & Billing",
  "tags": []
}