{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090552-How-to-enable-the-inactive-Grammarly-add-in",
  "scraped_at": "2025-08-11T20:47:13.237053+00:00",
  "title": "How to enable the inactive Grammarly add-in",
  "content": "If Grammarly is listed as inactive and remains inactive even after you try to activate it, follow the steps below:\nCheck your version of Microsoft Word or Outlook as described in\nthis article\nIf you use the 64-bit version of Office 2016, make sure your version is 16.0.4266.1003 or higher by installing Office updates. Then, download and install\nGrammarly for Microsoft Office\n.\nIf you use Office 365 or Microsoft 365, check for updates and install the latest version of Office 365 or Microsoft 365. Then, download and install Grammarly for Microsoft Office.\nClose all Microsoft Word and Outlook documents or emails and make sure that the Outlook icon doesn’t appear in the Windows tray area\nActivate Grammarly by going to\nFile\n>\nOptions\n>\nAdd-ins\nUnder\nManage\n, select\nCOM Add-ins\nand click\nGo\nCheck the box next to\nGrammarly\nand click\nOK\nThen, check if the Grammarly tab has appeared in Microsoft Word or Outlook\nIf these instructions didn’t help resolve the issue, please follow the steps in the tabs below in this exact order. For example, if the instructions provided in Step 2 don’t help, try the instructions from Step 3 and onward until the problem is fixed.\nStep 2\nPlease make sure Grammarly for Microsoft Office is not listed under\nDisabled Items\n:\nIn Microsoft Word or Outlook, click\nFile\n>\nOptions\n>\nAdd-ins\nUnder\nManage\n, select\nDisabled Items\n, and click\nGo\n. If Grammarly is turned off, select the add-in and click\nEnable\n.\nClose all Microsoft Word and Outlook documents or emails and make sure that the Outlook icon doesn’t appear in the Windows tray area\nActivate Grammarly by going to\nFile\n>\nOptions\n>\nAdd-ins\nUnder\nManage\n, select\nCOM Add-ins\nand click\nGo\nCheck the box next to\nGrammarly\nand click\nOK\nThen, check if the Grammarly tab has appeared in Microsoft Word or Outlook\nStep 3\nIf the previous instructions didn’t help, an antivirus or firewall program on your computer may be blocking Grammarly for Microsoft Office. Try following these steps to resolve the issue:\nInstall the latest updates of your antivirus or firewall software and try to enable Grammarly again. If this doesn’t help, turn off the antivirus or firewall program completely and retry.\nNote:\nIn some cases, antivirus or firewall software might include additional Microsoft Office add-ins. You may need to turn those off manually.\nClose all Microsoft Word and Outlook documents or emails and make sure that the Outlook icon doesn’t appear in the Windows tray area.\nActivate Grammarly by going to\nFile\n>\nOptions\n>\nAdd-ins\nUnder\nManage\n, select\nCOM Add-ins\nand click\nGo\nCheck the box next to\nGrammarly\nand click\nOK\nThen, check if the Grammarly tab has appeared in Microsoft Word or Outlook\nStep 4\nIf the previous instructions didn’t work, there might be a conflict with other add-ins. To resolve this, do the following:\nTurn off all other add-ins except Grammarly\nClose all Microsoft Word and Outlook documents or emails and make sure that the Outlook icon doesn’t appear in the Windows tray area\nActivate Grammarly by going to\nFile\n>\nOptions\n>\nAdd-ins\nUnder\nManage\n, select\nCOM Add-ins\nand click\nGo\nCheck the box next to\nGrammarly\nand click\nOK\nThen, check if the Grammarly tab has appeared in Microsoft Word or Outlook\nStep 5\nIf the issue persists and you use the 64-bit version of Microsoft Office, we recommend installing the 32-bit version of Microsoft Office:\nUninstall Grammarly\nUninstall Microsoft Office\nInstall the 32-bit version of Microsoft Office\nInstall\nGrammarly for Microsoft Office\nIf Grammarly for Microsoft Office doesn’t work after trying these steps, and you’re using Windows 10 or newer, we suggest switching to\nGrammarly for Windows\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.\nAlternatively, you can give\nthe Grammarly Editor\na try. For more information about the Grammarly Editor, visit\nthis page\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}