{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090511-Grammarly-disappeared-from-Microsoft-Word-or-Outlook",
  "scraped_at": "2025-08-11T20:35:08.797895+00:00",
  "title": "Grammarly disappeared from Microsoft Word or Outlook",
  "content": "At this time, Grammarly for Microsoft Office may not initialize if:\nYou’re opening a password-protected Microsoft Word document.\nYour document is open in\nProtected View\n.\nYou’re opening a document stored on a network resource.\nIf one of these scenarios applies to your document, follow these steps:\nSave your document on your local drive.\nOpen Microsoft Word from your\nStart\nmenu, desktop, or taskbar.\nNavigate to the\nOpen\ntab and select the document of your choice.\nHowever, if none of the scenarios above applied and the Grammarly tab doesn’t appear in Microsoft Word or Outlook, follow these instructions instead:\nStep 1\nInstall Grammarly for all users by using these instructions:\nDownload Grammarly for Microsoft Office at\nhttps://www.grammarly.com/office-addin/downloading\nDouble-click the GrammarlyAddInSetup.exe file\nIn the\nWelcome to Grammarly\nwindow that opens next, click\nGet Started\nwhile pressing the\nShift\nand\nCtrl\nkeys on your keyboard\nCheck the box next to the\nInstall for all users\noption and click\nNext\n:\n​If you don't see the option to install for all users, please download and run\nthis file\n.\nStep 2\nIf the issue persists, follow these steps:\nClose Microsoft Word and Outlook\nPress\nWin\n+\nR\nCopy and paste\nC:\\Program Files (x86)\\Grammarly\\Grammarly for Microsoft Office Suite%LOCALAPPDATA%\\Grammarly\\Grammarly for Microsoft Office Suite\ninto the search bar. In the Grammarly folder that opens next, navigate to the folder with the latest Grammarly version.\nNote:\nIf Grammarly wasn’t installed for all users on your computer, please open\n%LOCALAPPDATA%\\Grammarly\\Grammarly for Microsoft Office Suite\ninstead.\nLocate a folder with a name similar to B788D630 and open it\nRight-click\nEnableGrammarly.exe\nand select\nRun as administrator\nPress\nOpen Grammarly\nStep 3\nIf the Grammarly tab didn’t appear, follow these steps:\nOpen Microsoft Word or Outlook, click\nFile\n, choose\nOptions\n, and click\nAdd-ins\nIn the\nView and Manage Microsoft Office Add-ins\npanel, find the\nManage\nlist and click\nCOM Add-ins\n>\nGo\nIn the\nCOM Add-Ins\ndialog box, find and select\nGrammarly\nCheck\nLoad behavior\nat the bottom of the dialog box:\nIf you see “Not loaded. A runtime error occurred during the loading of the COM Add-in,” follow the instructions outlined in this\narticle\n.\nIf you don’t see Grammarly in the COM Add-ins dialog box, we suggest that you:\nUninstall Grammarly\nInstall\nGrammarly for Microsoft Office\nCheck whether the Grammarly tab appears in Microsoft Word or Outlook\nStep 4\nIf the previous steps didn’t help, try the following:\nCheck your version of Microsoft Word or Outlook (64-bit or 32-bit) as described in this\narticle\n- If you use the 64-bit version of Office 2016, make sure your version is 16.0.4266.1003 or higher. If you have an older version,\ninstall Office 2016 updates\n.\n- If you use Office 365 or Microsoft 365, check for updates and install the latest one.\n- If you use Microsoft Office Click-to-Run, please switch to\nMSI-based Office\n.\nOnce you’ve updated Microsoft Office, please\nuninstall and install Grammarly for Microsoft Office again\nCheck whether the Grammarly tab has appeared in Microsoft Word or Outlook\nStep 5\nIf the issue persists:\nOpen Microsoft Word or Outlook, click\nFile\n>\nOptions\n>\nAdd-ins\nIn the\nView and Manage Microsoft Office Add-ins\npanel, find the\nManage\nlist and click\nCOM Add-ins\n>\nGo\nIn the\nCOM Add-Ins\ndialog box, click the\nAdd\nbutton\nLocate the folder where the Grammarly add-in was saved:\nCopy and paste the following line into the\nFile name\ntext field and hit\nEnter\n:\n%LOCALAPPDATA%\\Grammarly\\Grammarly for Microsoft Office Suite\nNote:\nIf Grammarly was installed for all users, please paste the following line instead:\nC:\\Program Files (x86)\\Grammarly\\Grammarly for Microsoft Office Suite\nIn the Grammarly folder that opens next, open the folder titled after the latest version of the Grammarly add-in that you have just installed (e.g., 6.8.254).\nLocate the folder with a title similar to\nCB8930FD05\nand open it:\nIf you have the 64-bit Office, click on\nGrammarlyShim64.dll\n. If you have the 32-bit Office, select\nGrammarlyShim32.dll\ninstead.\nClick\nOK\nNote:\nIf an error message appears, please take a screenshot and send it to us in a\nsupport ticket\n.\nIf you don’t see any error messages, click\nOK\nin the COM Add-ins window and wait until Grammarly finishes loading\nRestart Microsoft Word or Outlook\nCheck if the Grammarly tab has appeared in Microsoft Word or Outlook\nIf Grammarly for Microsoft Office doesn’t work after trying these steps, and you’re using Windows 10 or newer, we suggest switching to\nGrammarly for Windows\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.\nAlternatively, you can give\nthe Grammarly Editor\na try. For more information about the Grammarly Editor, visit\nthis page\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}