{
  "url": "https://support.grammarly.com/hc/en-us/articles/25256977816717-About-true-up-billing",
  "scraped_at": "2025-08-11T20:35:40.898742+00:00",
  "title": "About true-up billing",
  "content": "Included in:\nGrammarly Pro and Business plans\nManaged by:\nAdmins\nTrue-up billing allows you to invite more team members to your Grammarly team now, and pay for their seats later.\nWith true-up billing, you can instantly invite team members above your paid seat count. Once your team members accept their invitations, they can start using Grammarly without any immediate charges to you.\nNote:\nTrue-up billing is not currently available to Grammarly Business teams that use invoices to pay for their subscription. For Grammarly Pro, true-up billing is available starting with the third seat.\nHow can I tell how many additional seats we have in use?\nYou can see the number of additional seats in use on the\nSubscription\npage:\nWhen will our team be charged for any additional seats?\nThe charge date for the seats you added is shown on the\nSubscription\npage under the number of additional seats in use:\nHow much will I be charged for additional seats?\nYou will be charged a prorated amount per seat based on the remaining days in the current subscription period.\nHow will this affect my subscription renewal?\nOn your subscription renewal date, your payment method on file will be automatically charged for the updated number of seats for your next subscription period.\nCan I pay for the additional seats immediately rather than wait to be charged later?\nYou can pay for the additional seats immediately by following these steps:\nGo to your\nSubscription\npage.\nClick\nUpdate plan\nin the upper-right corner.\nUpdate your team size to include all of the additional seats you currently have in use.\nClick\nContinue.\nReview the changes and click\nUpdate plan\nto confirm the charge.\nWhat if I don’t want to be charged for the additional seats?\nTo avoid paying for seats added using true-up billing, you will need to remove any additional seats in use at least 24 hours before the scheduled charge date.\nWill I get reminded about upcoming charges for additional seats?\nYou will receive email reminders 30 days and two days before the scheduled charge date. Additionally, you will receive an in-product notification 48 hours before the charge date.",
  "category": "Manage Subscription & Billing",
  "tags": []
}