{
  "url": "https://support.grammarly.com/hc/en-us/articles/31625547341965-Receive-OAuth-2-0-credentials",
  "scraped_at": "2025-08-11T20:44:42.741022+00:00",
  "title": "Receive OAuth 2.0 credentials",
  "content": "Included in:\nGrammarly Enterprise and Grammarly for Education plans\nManaged by:\nAdmins\nGrammarly API uses OAuth 2.0 protocol for secure integration with third-party applications.\nTo receive OAuth credentials for your application, follow these steps:\nGo to your\nAdmin panel\n.\nOpen the\nOrganization\ntab and choose\nOAuth 2.0 credentials\nin the\nConfigurations\nsection:\nOn the next page, click\nAdd credential\nin the upper-right corner.\nIn the window that appears, enter a name and check the box next to the API you will use.\nClick\nCreate\n.\nNext, click\nCopy to clipboard\nto save your\nClient ID\nand\nSecret\n.\nOverview of OAuth scopes\nGrammarly’s OAuth credentials can be assigned OAuth scopes, which are features that define the specific permissions granted to an OAuth client when accessing the Grammarly API. OAuth scopes limit access to only necessary resources, enhancing security by minimizing granted permissions.\nEach OAuth client can be assigned the following scopes:\nscores-api:read\nProvides read-only access to the\nWriting Score API\n, allowing applications to retrieve writing scores for submitted text.\nSuitable for applications that evaluate or analyze text quality, offering insights like writing clarity, engagement, and overall score.\nscores-api:write\nProvides write access to the\nWriting Score API\n, enabling applications to submit documents for writing score evaluations.\nSuitable for applications that evaluate or analyze text quality, offering insights like writing clarity, engagement, and overall score.\nanalytics-api:read\nGrants read-only access to the\nAnalytics API\n, which provides Grammarly usage statistics for team plan members, including metrics like the number of writing sessions, the percentage of improved writing sessions, and generative AI prompt usage.\nThis scope is commonly used by BI applications or analytical dashboards that show engagement with Grammarly.\nTo learn how to authenticate a client and make API requests to Grammarly using OAuth credentials,\nreview the API documentation\n.\nRelated articles\nWriting Score API\nAnalytics API",
  "category": "Grammarly API",
  "tags": []
}