{
  "url": "https://support.grammarly.com/hc/en-us/articles/32478363601549-Introducing-the-Effective-Communication-Score",
  "scraped_at": "2025-08-11T20:29:32.245746+00:00",
  "title": "Introducing the Effective Communication Score",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins and account managers\nThe Effective Communication Score on the\nTeam overview\npage represents the overall strength of your organization’s communication. By surfacing key metrics, Grammarly can show you where teams are doing well—and where they can improve. With real-time insights, you can see how Grammarly enhances communication effectiveness across your organization, and make data-driven decisions.\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nThe Effective Communication Score section of the\nTeam overview\npage consists of the following elements:\nOverall Effective Communication Score and the Score Breakdown\nThe overall Effective Communication Score is a holistic score that helps you better understand the quality and performance of your organization’s communication.\nTo learn how to improve your team’s Effective Communication Score, check out this article:\nHow can I improve my organization’s Effective Communication Score?\nThe\nScore breakdown\nsection displays the metrics that contribute to your overall Effective Communication Score:\nClarity:\nHow clearly and efficiently is your team communicating? This score analyzes the use of Grammarly’s suggestions to make your team’s writing more concise, simpler, and easier to understand.\nInclusivity:\nHow inclusive is your team’s communication? Help foster a respectful, inclusive workplace by ensuring your team is using language that upholds your company’s values.\nCorrectness:\nEnsure your team’s communications remain mistake-free and strike a professional tone. This score analyzes the use of Grammarly’s suggestions to reduce common communication errors in grammar, punctuation, and spelling.\nStyle consistency:\nHow consistent is your team’s writing style? This score analyzes how Grammarly’s suggestions help your team follow your style guide and writing preferences in their communications.\nBrand consistency:\nHow consistently does your team write in one brand voice? This score analyzes how your team follows the tone profiles created for your organization’s unique brand voice.\nTo examine the data that contributes to your overall score more closely, click\nView detailed score analysis\nunder the score breakdown.\nIn the\nInterpreting your score\nsection, you can also see your\nIndustry Benchmark\n, which is a valuable reference point for comparing your team's writing score to that of other organizations in your industry.\nFor each organization in your industry, we calculate their Effective Communication Score without Grammarly and then average these scores. This creates a benchmark that reflects typical writing performance in your industry.\nGrammarly’s impact on your team’s communication\nThis score highlights Grammarly’s impact on your team’s communication by comparing the number of mistakes before and after applying Grammarly’s suggestions. It compares the average number of suggestions that Grammarly provides to your team for each metric per 1,000 or 100,000 words and the average number of suggestions that remain unaddressed.\nHow the score is calculated\nUnderlying data:\nThe Effective Communication Score analyzes how often writing suggestions are accepted and the tones detected in your members’ writing. This data allows us to calculate the overall score for your team while focusing on key writing elements: correctness, clarity, inclusivity, and brand and style consistency.\nMetric calculation:\nOnce we’ve grouped the underlying data for all members, we calculate an average score for each metric: Correctness, Clarity, Inclusivity, Brand consistency, and Style consistency. To get a percentile for each score, we compare it against the scores of other Enterprise users for a given period of time.\nThe final Effective Communication Score\n: To get your team’s final Effective Communication Score, we calculate the average of all the metrics: Correctness, Clarity, Inclusivity, Brand consistency, and Style consistency.\nNote:\nIf your organization hasn’t set up any style rules or brand tone profiles, the Brand consistency and Style consistency metrics won’t be included in the calculation of your team’s Effective Communication Score.\nHow to share feedback\nTo share your feedback about the Effective Communication Score or submit a feature request, please contact your Customer Success Manager or\ncreate a support request\n.\nRelated articles\nAnalyze my team’s writing performance\nReview member usage analytics\nIntroducing your writing progress dashboard",
  "category": "Team Features",
  "tags": []
}