{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090892-Common-questions-about-weekly-Grammarly-Insights-reports",
  "scraped_at": "2025-08-11T20:33:25.090746+00:00",
  "title": "Common questions about weekly Grammarly Insights reports",
  "content": "Grammarly Insights are designed to provide you with useful information about how you write.\nNote:\nIf you are seeing no activity for the week when you know you've used Grammarly, this typically means that you had no logged-in activity. Log in to your Grammarly account at\nGrammarly.com\nand write on!\nMany Grammarly users spend more time writing online than they may realize. Think about it. Between emails, blog posts, and status updates, our users are writing the equivalent of a novel each month, on average. That’s a lot of words! But what does that mean for you?\nWell, read on to find out.\nThis progress report is an analysis of your writing with Grammarly and provides insights that may help you to become an even better writer. Your progress report looks at three main components of your writing: productivity, mastery, and vocabulary.\nPRODUCTIVITY\nProductivity measures your total word count for the week and also shows how you compare to other Grammarly users. You can also see how the current week compares to your last four weeks of activity. Hey, all those status updates and emails really start to add up!\nMASTERY\nMastery analyzes how many (or how few) mistakes you corrected with Grammarly as it relates to total words written. The fewer mistakes you need to correct with Grammarly, the more accurately you write. You can also see how well you did compared to other Grammarly users and track your progress over the past month.\nVOCABULARY\nThe Vocabulary section will show you how many unique words you’ve written throughout the prior week. The percentage shown lets you know how dynamic — meaning, how varied and diverse — your vocabulary is relative to Grammarly users.\nTONE\nThe Tone section shows the tones found in your writing during the previous week.\nTOTAL WORDS ANALYZED\nThis section reflects the total number of words that Grammarly has analyzed since your account was created.\nTOP GRAMMAR MISTAKES\nEveryone makes mistakes. This section is designed to prevent you from making the same mistakes twice— or 17 times. This is where you'll discover your three most frequent grammatical errors corrected with Grammarly.\nTOP STORIES & TIPS\nThis section offers links to the top blog posts and articles on our website.\nHave you received your Grammarly Insights digest yet? If not, sign up for\nGrammarly\ntoday and see a difference in your writing. We are constantly refining Grammarly Insights and looking for more ways to keep our writers engaged. We hope this new weekly email will be insightful for you! If you have any questions about Grammarly Insights or if you have suggestions for making it better, feel free to reach out to us.",
  "category": "Common Questions",
  "tags": []
}