{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000089892-Problems-signing-in",
  "scraped_at": "2025-08-11T20:31:25.402705+00:00",
  "title": "Problems signing in",
  "content": "I forgot my password\nTo reset your password, request a password reset email by clicking\nthis link\n, entering your email address, and pressing\nSend me reset instructions\n:\nThe email should arrive within about a minute and contain a link that will bring you to a page where you'll be asked to create a new password:\nIn case you experience any issues with resetting your password, please review these articles:\nIf you don't receive the password reset email, check\nthis article\nfor more information.\nIf the password reset link redirects you to the login page, follow\nthese steps\n.\nIf the issue persists after resetting your password, we suggest following the instructions from\nthis article\n.\nNote:\nIf you registered using Google, Facebook, or Apple as a sign-up method, please select the corresponding option at\nhttps://www.grammarly.com/signin\nor in your preferred Grammarly product. However, if you prefer to create a separate password for your Grammarly account, you can do so at\nhttps://www.grammarly.com/resetpassword\n.\nIf you no longer have access to the email address associated with your account, check\nthis article\n.\nI don't remember my paid account login email\nYou can search every email account you use for the word \"Grammarly\" to find any emails we've sent you.\nYou can also try entering any other email addresses you might have used to create an account in the\npassword reset form\n. If there is an account associated with the email you entered, you’ll receive password reset instructions.\nIf you still can't locate the login details for your paid account, please use\nthis form\n.\nI don't remember my free account login email\nSearch every email account you use for the word Grammarly to find any emails we've sent you.\nYou can also try entering any other email addresses you might have used to create an account in the\npassword reset form\n. If there is an account associated with the email you entered, you’ll receive password reset instructions.\nIf you no longer have access to the email address you signed up with and don't remember your password, you will need to\ncreate a new account\nwith your new email address.",
  "category": "Sign-in Help",
  "tags": []
}