{
  "url": "https://support.grammarly.com/hc/en-us/articles/25043801131149-About-Grammarly-Pro",
  "scraped_at": "2025-08-11T20:30:57.179566+00:00",
  "title": "About Grammarly Pro",
  "content": "Grammarly Pro gives you all of Grammarly’s most advanced writing features, such as full-sentence rewrites and tone suggestions, plus team features that help you work more efficiently with your team.\nNote:\nGrammarly Pro replaces Grammarly Premium and Grammarly Business plans.\nWith Grammarly Pro, you can:\nEnsure your message lands how you want it to with one-click tone adjustments\nQuickly polish your writing with instant full-sentence re-writes\nStay in compliance and on-brand with the whole team\nInvite other members to your Grammarly account to stay consistent together\nWe offer monthly, quarterly, and annual subscriptions to Grammarly Pro. To find out more, please visit\nwww.grammarly.com/plans\n.\nNote:\nGrammarly Pro plans are billed as one payment for all seats.\nTo learn more about the accepted payment methods, please review this article:\nHow can I pay for Grammarly?\nFor more information about taxes, see this article:\nDoes Grammarly charge tax?\nWho can use Grammarly Pro?\nTo ensure a smooth user experience for all of our users, we’re rolling out Grammarly Pro gradually, so it may take some time before it is available to everyone.\nGrammarly Pro is currently not available to Grammarly Business and Grammarly for Education customers, as well as to Grammarly Premium customers who purchased their subscription via the App Store or Google Play Store.\nWhat is the difference between Grammarly Premium and Grammarly Pro?\nGrammarly Premium was our paid tier available to individuals only. Grammarly Pro is our new paid tier that will replace Grammarly Premium. Grammarly Pro offers flexible subscription options for individuals and teams.\nWhile Grammarly Premium included access to advanced writing features, such as full-sentence rewrites, tone suggestions, plagiarism detection, and 1,000 monthly generative AI prompts, Grammarly Pro offers more enhanced capabilities:\nAll Grammarly Premium features.\nDoubled monthly generative AI prompts from 1,000 to 2,000.\nThe flexibility of creating teams of up to 149 members.\nAdditional features, such as\nstyle guides\n,\nbrand tones\n, knowledge share,\nsnippets\n, and\nusage analytics\n, that help individuals and teams stay on-brand, compliant, and productive.\nManaging a Grammarly Pro subscription\nI am a Grammarly Premium user. When will Grammarly Premium users be migrated to the Grammarly Pro plan?\nGrammarly Premium users will gradually be transferred to Grammarly Pro plans throughout this year. Your billing amount will remain the same. For more information, please review this article:\nUpdating the Grammarly Premium plan to the Grammarly Pro plan\nWho can I invite to my Grammarly Pro team?\nYou can invite Grammarly Free, Grammarly Premium, and other Grammarly Pro users to your Grammarly Pro team. Grammarly Business and Grammarly for Education users cannot be invited to a Grammarly Pro team at this time.\nHow do I invite members to my Grammarly Pro team?\nTo invite team members, please follow these steps:\nGo to the\nMembers\npage and click\nInvite members\nin the upper-right corner.\nNext, enter your team members’ email addresses and click\nInvite members\n.\nTo join your subscription, invited team members need to click the link in the invitation sent to their email addresses.\nNote:\nAdditional seats for invited members are billed separately according to the standard subscription rates. The charge amount for additional seats is prorated based on the remaining days in your current subscription period. In the next billing cycle, you will be charged the full amount for the updated number of seats on your subscription renewal date.\nCan I remove my team members?\nAs a Grammarly Pro admin, you can remove members of your team at any time. If your team member had a Grammarly Free account before joining your Grammarly Pro team, they will revert to Grammarly Free. If they had a Grammarly Pro subscription, they will be able to continue using it after you remove them from your Grammarly Pro team.\nNote:\nMembers with the admin role should be unassigned this role before they can be removed.\nCan my team members leave my Grammarly Pro team on their own?\nGrammarly Pro members can leave their team’s subscription on their own unless they are assigned the admin role. Grammarly Pro admins can leave only after their admin role is unassigned.\nWhat happens with my current subscription if I join a Grammarly Pro team?\nIf you have a Grammarly Premium subscription, you will automatically receive a prorated refund for the unused period. It may take up to 10 business days for the refund to appear on your statement, depending on your payment method.\nIf you have a Grammarly Pro subscription, depending on whether you are the sole member of your Grammarly Pro team, either your subscription will be paused once you join another Grammarly Pro team, or you will be removed from your current team and added to the new team. If you are a Grammarly Pro admin, you will need to transfer the admin role to another team member before joining a different team.\nYou can also request a refund for your original Grammarly Pro subscription after joining another Grammarly Pro team. To do that, go to the\nSubscription\npage and click\nRequest a Refund\n.\nIf you choose not to request a refund for your previous subscription, it will remain paused. If you leave your current Grammarly Pro team, your previous subscription will resume immediately, and you will keep access to advanced features for the remaining subscription period.\nCan I expand my Grammarly Pro team after the original purchase?\nYou can add more seats to your Grammarly Pro plan at any time. You will be charged a prorated amount for every new team member you invite to join your account. The prorated charge amount depends on the time remaining until your subscription renewal or expiration date.",
  "category": "Grammarly Pro",
  "tags": []
}