{
  "url": "https://support.grammarly.com/hc/en-us/articles/33433628591629-Introducing-Grammarly-s-Writing-Score-Canvas-Integration",
  "scraped_at": "2025-08-11T20:29:16.191431+00:00",
  "title": "Introducing Grammarly’s Writing Score Canvas Integration",
  "content": "Included in:\nOrganization-wide Grammarly for Education plans\nManaged by:\nAdmins\nAvailable to:\nFaculty and students\nGrammarly’s integration with Canvas allows students to evaluate their written assignments for essential correctness, clarity, engagement, and delivery quality before submitting them. This provides students an opportunity to improve their work before turning it in.\nAdditionally, faculty can view Grammarly’s writing score for each submission, which offers an initial insight into the work’s readability.\nThe goal of this integration is for students to submit higher-quality written work, enabling faculty to review assignments more efficiently and pay closer attention to the substance of the writing rather than to its readability.\nGrammarly can be integrated with Canvas at the account, sub-account, or individual course level. After activation, it will be available to all students on the assignment page. The use of Grammarly’s integration with Canvas is entirely optional and does not affect the standard assignment submission process.\nConnect Canvas to Grammarly\nIntegrating Grammarly with Canvas requires access to:\nCanvas admin account\nGrammarly for Education admin account\nTo set up the integration, follow these instructions:\nGo to your Canvas account, open the\nAdmin\ntab, and select a sub-account.\nOn the next page, click on the\nDeveloper keys\ntab on the left.\nIn the upper-right corner, click\n+ Developer Key\nand select\nLTI Registration\nfrom the list.\nIn the window that appears next, insert\nhttps://lti-integration.grammarly.com/registration/start\nin the\nDynamic Registration URL\nfield and click\nContinue\n.\nNext, click\nConnect to Grammarly\n.\nIn the new browser tab that opens, sign in to your Grammarly for Education admin account.\nOnce you see “\nConnection successful\n,” close that browser tab and go back to Canvas.\nIn the\nGrammarly Settings\nsection, click on the dropdown menu under\nUser data shared with this tool\nand choose\nAll user data\nor\nUser’s name only\n.\nClick\nEnable & Close\n.\nWhile on the\nDeveloper keys\npage, select and copy the numerical client ID located in the\nDetails\ncolumn.\nNext, open the\nCourses\ntab in the left-side panel and select a course to connect to Grammarly.\nOn the next page, click on the\nSettings\ntab on the left.\nOpen the\nApps\ntab at the top, click\nView App Configurations\n, and click\n+ App\n.\nIn the window that opens next, click on the dropdown menu under\nConfiguration Type\nand select\nBy Client ID\n.\nIstert the client ID you copied previously into the\nClient ID\nfield and click\nSubmit\n.\nLastly, click\nInstall\nto finish the setup.\nTry out Grammarly in Canvas\nTo check how Grammarly works in Canvas, follow these steps:\nWhile on the course page, click on the\nAssignments\ntab on the left.\nIn the upper-right corner, click\nView as Student\nand select an assignment.\nUnder\nCheck your basic writing quality with Grammarly\n, click\nUpload document\nand select a document. The supported document types are DOC, DOCX, ODT, TXT, and RTF.\nClick\nCheck writing score\n.\nOnce Grammarly analyzes your document, you’ll receive its overall writing score and separate scores in four categories: correctness, engagement, clarity, and delivery.\nClick\nLeave student view\nin the lower-right corner.\nIn the\nStudent Submissions\nsection, you can review Grammarly’s overall writing score for each student submission:",
  "category": "Grammarly for Education",
  "tags": []
}