{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090632-I-can-t-activate-the-plagiarism-checker",
  "scraped_at": "2025-08-11T20:37:53.201156+00:00",
  "title": "I can't activate the plagiarism checker",
  "content": "The plagiarism checker is turned off by default. For steps on how to check your document for plagiarism against an index of publicly accessible websites and major proprietary databases, please select one of the supported product offerings below:\nGrammarly Editor\nIf you're using\nthe Grammarly Editor\n, open or create a new document\nand click\nCheck for AI text & plagiarism\nin the upper-right corner:\nGrammarly for Windows\nThe plagiarism checker in Grammarly for Windows is available only in Microsoft Word.\nTo check your text for plagiarism in Grammarly for Windows, open a document in Microsoft Word, click on the Grammarly widget, and choose\nCheck for plagiarism and AI text\nin the lower-right corner.\nGrammarly for Mac\nCurrently, the plagiarism checker and AI detector features are available in Grammarly for Mac only in Apple Pages and Microsoft Word.\nTo open the plagiarism checker, click on the Grammarly tab on the right side of the screen and click\nReview all suggestions\n:\nIn the window that appears next, click on the quotation marks icon at the top:\nGoogle Docs\nIf you’re using the\nGrammarly browser extension\nin Google Docs, open the Grammarly sidebar and click\nPlagiarism\nin the lower-right corner:\nGrammarly for Microsoft Office on Windows\nIf you’re using Grammarly for Microsoft Office on Windows, go to the\nGrammarly\ntab in Word and click\nPlagiarism\n:\nGrammarly for Microsoft Word on Mac\nIf you’d like to check your text for plagiarism in Grammarly for Microsoft Word on Mac, open Grammarly’s sidebar and click\nPlagiarism\nin the lower-right corner:\nGrammarly iPad Editor\nIf you're using the Grammarly iPad Editor, open or create a new document and click the\nPlagiarism\nbutton in the lower-right corner:",
  "category": "Plagiarism Checker",
  "tags": []
}