{
  "url": "https://support.grammarly.com/hc/en-us/articles/360041471771-How-does-Grammarly-for-Microsoft-Word-work-on-Macs",
  "scraped_at": "2025-08-11T20:30:54.968449+00:00",
  "title": "How does Grammarly for Microsoft Word work on Macs?",
  "content": "Important:\nGrammarly for Microsoft Word on Mac will no longer be updated. We suggest switching to\nGrammarly for Mac\n, which supports integration with multiple applications and websites, including Microsoft Office apps. Alternatively, if you work on longer documents, we encourage you to give\nthe Grammarly Editor\na try.\nIf you prefer to continue using Grammarly for Microsoft Word on Mac, this article is a useful source of information about the following topics:\nThis article covers these topics:\nOpening Grammarly\nChecking text\nDeactivating certain suggestion types\nSettings goals and checking performance\nChecking your text for plagiarism\nChanging default settings\nOpening Grammarly\nOnce you’ve added Grammarly to Microsoft Word, click the\nOpen Grammarly\nbutton in the\nHome\ntab or use the button in your new Grammarly tab to open the Grammarly sidebar.\nWhen you start typing or checking your text, Grammarly will show suggestions in that sidebar.\nChecking text\nGrammarly’s suggestions will appear in the sidebar on the right side of your document. You won’t see underlines in your text, but clicking a suggestion will highlight the relevant portion of text in your document:\nTo accept a suggestion, click on the suggestion card:\nIf you’d like to ignore a suggestion, click the trash can icon to dismiss it.\nTo see a detailed explanation about a suggestion, click the three dots at the bottom of the alert.\nNote:\nGrammarly for Microsoft Word will not turn on if Track Changes is switched on in your document or if there are unresolved comments.\nGrammarly also provides an option to specify which types of suggestions to provide for your document. Grammarly’s four categories of suggestions — correctness, clarity, engagement, and delivery — are all turned on by default. If you’d like to view suggestions in one category at a time, you can click the category name at the top of the sidebar to filter out all other suggestions.\nNote:\nCurrently, you can check up to 150,000 characters (including spaces) at a time with Grammarly for Microsoft Word on Mac.\nDeactivating certain suggestion types\nNote:\nThis feature is available only with Grammarly Premium, Grammarly for Business, and Grammarly for Education.\nCertain types of suggestions, such as adding the Oxford comma and passive voice suggestions, can be turned off. You can view and manage suggestions in your account settings by following\nthis link\n.\nKeep in mind that if you deactivate a certain type of suggestion, it will be deactivated in all of your Grammarly product offerings.\nSetting goals and checking performance\nTo customize the suggestions Grammarly offers, you can adjust your goals. You can choose the audience, formality, and domain (type) of your text by clicking the\nSet Goals\nbutton:\nNote:\nAt this time, the option to select the domain is available to Premium, Grammarly for Business, and Grammarly for Education users.\nYou can also view your document statistics. To do that, click the\nPerformance\nbutton in the upper right corner of the sidebar:\nChecking your text for plagiarism\nIf you are a Premium, Grammarly for Business, or Grammarly for Education user, you can check your document for plagiarism. Keep in mind that the plagiarism checker is deactivated by default.\nTo check your text for plagiarism, click the\nPlagiarism\nbutton in the lower part of the sidebar:\nChanging default settings\nClick the gear icon in the lower right corner of the Grammarly sidebar to access your settings:\nHere you can:\nView your account information\nUpdate your subscription settings\nUpdate your language preference",
  "category": "Grammarly for Microsoft Word on Mac",
  "tags": []
}