{
  "url": "https://support.grammarly.com/hc/en-us/articles/23153676821773-Introducing-voice-features",
  "scraped_at": "2025-08-11T20:45:59.183167+00:00",
  "title": "Introducing voice features",
  "content": "Included in:\nGrammarly Business and Enterprise plans\nAvailable to:\nAll member roles\nTo help organizations communicate more authentically and efficiently, Grammarly is introducing new voice features.\nThe voice features allow Grammarly to develop a voice profile based on each user’s writing style and help them rewrite text in their own unique voice.\nTopics covered in this article:\nWhat’s included in the voice features?\nPersonalized voice profile\nHow to use the voice features\nWhere can I use the voice features?\nWhat’s included in the voice features?\nHere’s what the voice features include:\nautomatic detection of a user’s writing style\nvoice profile that displays the user’s writing style:\ngenerative AI prompt that applies the user’s writing style to their text\nPersonalized voice profile\nYou can view your personalized voice profile by clicking the lightbulb icon and selecting the\nvoice icon\nin the upper-right corner:\nGrammarly detects your unique voice profile from your writing and updates the profile continuously as you write.\nAdditionally, Grammarly understands that you may write short messages in one style and use a different style for longer documents. So it keeps separate voice profiles for documents and messages and can apply the appropriate profile based on the application or website you’re using.\nYou can switch between the\nDocuments\nand\nMessages\ntabs to view the corresponding voice profile:\nAlso, you can customize your voice profile by selecting your role and dialect. To do so, open your voice profile and hover over the section that contains your name, role, and dialect to reveal the\nEdit\nbutton:\nYou can also remove the communication style elements from your voice profile by clicking on them and selecting\nNo, remove it\n:\nHow to use the voice features\nOnce Grammarly has created your voice profile, you can apply it to your text using on-demand generative AI assistance. Here’s how:\nHighlight the text you’d like to rewrite in your voice and click the lightbulb icon or the pencil icon that appears.\nIn the pop-up that appears next, select\nRewrite in my voice\n. You may need to click\nMore\nto see this option.\nYou can instantly insert the rewritten text into your writing or continue editing it by clicking\nRephrase\nor selecting other suggested prompts.\nNote:\nTo learn more about Grammarly’s generative AI assistance, check out this article:\nIntroducing generative AI assistance\nWhere can I use the voice features?\nAt this time, the voice features are available in\nGrammarly for Windows\n,\nGrammarly for Mac\n, and\nGrammarly for Chrome\n.",
  "category": "Team Features",
  "tags": []
}