{
  "url": "https://support.grammarly.com/hc/en-us/articles/25555503115277-Product-Improvement-and-Training-Control",
  "scraped_at": "2025-08-11T20:35:06.547837+00:00",
  "title": "Product Improvement and Training Control",
  "content": "Grammarly’s Product Improvement and Training control allows users to decide whether their content can be used by Grammarly to train its models and improve its product for everyone. Use the tabs below to find the relevant Product Improvement and Training information for your account type.\nGrammarly Free, Grammarly Premium, and single-user Grammarly Pro accounts\nThis section pertains to users of Grammarly Free, Grammarly Premium, and single-user Grammarly Pro accounts. For other account types, including accounts with more than one user, use the tabs on this page to navigate to the relevant information.\nWhat is the Product Improvement and Training control?\nThe Product Improvement and Training control allows users of Grammarly Free, Premium, and single-user Pro accounts to opt out of allowing Grammarly to use their content to train its models and improve its product for everyone. Product improvements include training and validating Grammarly’s AI and machine learning models and general research that informs Grammarly feature development and enhancement. Product Improvement and Training is on for individual users by default.\nWe do not train on any content from users whose account originates in the EU, UK, Iceland, Norway, Liechtenstein, or Switzerland. This is reflected in the privacy settings of those users.\nHow do I turn Product Improvement and Training on or off?\nFollow the steps below to turn on or off Product Improvement and Training:\nFor Grammarly Free and Premium Accounts:\nGo to your account’s privacy settings at\naccount.grammarly.com/security/privacy\n.\nClick the “Product Improvement and Training” toggle to change its setting.\nFor Grammarly Pro accounts with one user:\nGo to your account’s data settings at\naccount.grammarly.com/admin/data_settings\n.\nClick the “Product Improvement and Training” toggle to change its setting.\nIndividuals can update these preferences at any time. For Grammarly Pro accounts with more than one user, only the account’s administrator(s) can modify the Product Improvement and Training control. See the tabs below for more info about the Product Improvement and Training Control for different account types.\nOther FAQs\n1. What does “product improvement and training” mean?\nGenerative AI relies on large language models (LLMs), and LLMs are taught using large datasets. In some cases, that includes customer data. This is what we mean by the term “training.” In addition, Grammarly is able to process customer data to learn how our product is used and how it might function better. This is what “product improvement” means. In sum, product improvement and training refer to:\nTraining datasets for AI and ML\nValidation of models\nGeneral research that informs what features Grammarly could build or enhance\nWith product improvement and training turned off, Grammarly will not process user content for the above purposes.\n2. What content is impacted by the Product Improvement and Training control?\nWhen this control is turned off, none of the content a user inputs into an application or website that Grammarly runs on will be used for training and product improvement for everyone who uses Grammarly. Grammarly may still collect non-content data, such as writing statistics (total words written, types of suggestions accepted, mistakes made, etc.), and may use that data for product improvement and training.\n3. How do you protect my content and data?\nWe take robust steps to protect all of our users and their data, with industry-leading security, privacy, and responsible AI measures. If a user allows Grammarly to use their content for product improvement and training, all sampled content is de-identified (removing any association to the identity of a user), sanitized (removing sensitive data such as credit card numbers, Social Security numbers, or email addresses), and other identifiable content is replaced with random values—for example, the name “Christopher Pike” is replaced with “John Doe.”\n4. Does my Product Improvement and Training setting change if I join a Grammarly Business or Education account?\nIf a Free or Premium user joins an institution account, they will automatically adopt the Product Improvement and Training setting status set by the organization’s admin. However, EU, UK, Iceland, Norway, Liechtenstein, or Switzerland users are not affected by their admin’s setting; training will remain off.\n5. Does my Product Improvement and Training setting change if I create a Grammarly Business or Education account?\nIf a Free or Premium user creates a Team, Pro, or Enterprise account (meaning they become the first admin), the Product Improvement and Training setting for the institution will start with the default setting for that type of institution.\nFor all Grammarly Education accounts, and for Team, Pro, and Enterprise accounts purchased through the Grammarly Sales team, Product Improvement and Training is automatically off, meaning we will not use content from any users within that organization to train our models.\nFor Grammarly Team or Pro accounts purchased directly through the Grammarly website, Product Improvement and Training will initially be on, and an admin can opt out for their entire organization.\n6. How does my Product Improvement and Training setting change if I leave a Grammarly Business or Education account, becoming a Free user?\nIf a user leaves a Grammarly Team, Pro, Enterprise, or Education account and becomes a Free user, the Product Improvement and Training control will keep the setting it had when they were a member of the Business or Education account. The Product Improvement and Training toggle will be visible to the user and modifiable if they wish to change that setting.\nUsers in the EU, UK, Iceland, Norway, Liechtenstein, or Switzerland will never see the Product Improvement and Training control because it always remains off.\nFor further questions, please\ncontact customer support\n. For more information about the Product Improvement and Training settings for other types of Grammarly accounts, use the tabs above to find the relevant information for your account type.\nMultiuser Grammarly Pro accounts purchased through the Grammarly website\nThis section pertains to users of multiuser Grammarly Pro accounts purchased through the Grammarly website. For other account types, use the tabs on this page to navigate to the relevant information.\nWhat is the Product Improvement and Training control?\nThe Product Improvement and Training control allows administrators of Grammarly Business accounts and of multiuser Pro accounts purchased through our website to opt out of allowing Grammarly to use their organization's content to train its models and improve its product for other users. Product improvements include training and validating Grammarly’s AI and machine learning models and general research that informs Grammarly feature development and enhancement.\nSee below for how an administrator can turn on and off organization content being used for product improvement and training.\nWe do not train on any organization content from users whose account originates in the EU, UK, Iceland, Norway, Liechtenstein, or Switzerland, regardless of the setting of this control.\nHow do I turn Product Improvement and Training on or off?\nFollow the steps below to turn on or off Product Improvement and Training:\nGo to your account’s data settings at\nhttps://account.grammarly.com/admin/data_settings\n.\nClick the “Product Improvement and Training” toggle to change its setting.\nOnly administrators can change the Product Improvement and Training setting for multiuser accounts.\nImportant Note:\nThe default setting is on (green checkmark shown), meaning that Product Improvement & Training is enabled. Clicking the toggle will turn it off, meaning that Grammarly will not use your content for training.\nOther FAQs\n1. What does “product improvement and training” mean?\nGenerative AI relies on large language models (LLMs), and LLMs are “taught” using large datasets. In some cases, that includes customer data. This is what we mean by the term “training.” In addition, Grammarly is able to process customer data to learn how our product is used and how it might function better. This is what “product improvement” means. In sum, product improvement and training refer to:\nTraining datasets for AI and ML\nValidation of models\nGeneral research that informs what features Grammarly could build or enhance\nWith product improvement and training off, Grammarly will not use your organization's content for the above purposes.\n2. What data is impacted by the Product Improvement and Training control?\nWhen this control is turned off, none of the content a user inputs into an application or website that Grammarly runs on will be used for training and product improvement for other Grammarly users. Grammarly may still collect non-content data, such as writing statistics (total words written, types of suggestions accepted, mistakes made, etc.), and may use that data for product improvement and training.\n3. How do you protect my content and data?\nWe take robust steps to protect all of our users and their data, with industry-leading security, privacy, and responsible AI measures. If a user allows Grammarly to use their content for product improvement and training, all sampled content is de-identified (removing any association to the identity of a user), sanitized (removing sensitive data such as credit card numbers, Social Security numbers, or email addresses), and other identifiable content is replaced with random values—for example, the name “Christopher Pike” is replaced with “John Doe.”\n4. What if I am an admin located in the European Union (EU) or UK, or I have users in my institution who live in the EU or UK?\nWe do not train on any organization content from users whose account originates in the EU, UK, Iceland, Norway, Liechtenstein, or Switzerland, regardless of the setting of this control.\n5. How does my Product Improvement and Training setting change if I leave a Grammarly Business account and become a Free user?\nIf a user leaves a Grammarly Team or Pro account and becomes a Free user, the Product Improvement and Training control will keep the setting it had when they were a member of the Business account. The Product Improvement and Training toggle will be visible to the user and modifiable if they wish to change that setting.\nUsers in the EU, UK, Iceland, Norway, Liechtenstein, or Switzerland will never see the Product Improvement and Training control because it always remains off.\n6. How does my Product Improvement and Training setting change if I’ve converted from an Enterprise, Education, or other Grammarly Business plan purchased through Sales to another paid Grammarly account?\nFor accounts that were previously on Grammarly’s Enterprise plan or other plans purchased through Grammarly’s Sales team, the Product Improvement and Training control will remain off, with no toggle visible to modify the setting, meaning that none of the organization’s content will be used to train Grammarly’s models or improve its products.\nFor further questions, please contact your sales representative or\ncustomer support.\nAll Grammarly accounts purchased through the Sales team and all Grammarly for Education accounts\nWhat is the Product Improvement and Training control?\nThe Product Improvement and Training control determines whether an organization’s content is used by Grammarly to train its models and improve its product for other users. Product improvements include training and validating Grammarly’s AI and machine learning models and general research that informs Grammarly feature development and enhancement.\nFor all Enterprise-tier accounts and Grammarly Business accounts purchased through Grammarly’s sales team, and all Grammarly for Education accounts, Product Improvement and Training is automatically OFF, meaning Grammarly is not using these organizations’ content to train models or improve its product for other users. For these types of accounts, this setting cannot be changed.\nOther FAQs\n1. What does “Product Improvement and Training” mean?\nGenerative AI relies on large language models (LLMs), and LLMs are “taught” using large datasets. In some cases, that includes customer data. This is what we mean by the term “training.” In addition, Grammarly is able to process customer data to learn how our product is used and how it might function better. This is what “product improvement” means. In sum, product improvement and training refer to:\nTraining datasets for AI and ML\nValidation of models\nGeneral research that informs what features Grammarly could build or enhance\nHowever, with Product Improvement and Training off, Grammarly will not use an organization's content for the above purposes. For the following types of organizations, Product Improvement and Training is automatically OFF, meaning Grammarly is not using these organizations’ content to train models or improve its product for other users: all Enterprise accounts, Teams accounts purchased through Grammarly’s sales team, and all Grammarly for Education accounts.\n2. What data is impacted by the Product Improvement and Training control?\nWhen this control is off, none of the content a user inputs into an application or website that Grammarly runs on will be used for training and product improvement for other Grammarly users.\nGrammarly may still collect non-content data, such as writing statistics (total words written, types of suggestions accepted, mistakes made, etc.), and may use that data for product improvement and training.\n3. What if my organization negotiated a unique data privacy agreement or is subject to special privacy requirements, like HIPAA?\nThe Product Improvement and Training control does not affect other arrangements; Grammarly will continue to adhere to all existing contracts and agreements.\n4. How does my Product Improvement and Training setting change if I leave a Grammarly Business or Education account and become a Free user?\nIf a user leaves a Grammarly Pro, Team, Enterprise, or Education account and becomes a Free user, the Product Improvement and Training control will keep the setting it had when they were a member of the Business account. The Product Improvement and Training toggle will be visible to the user and modifiable if they wish to change that setting.\nUsers in the EU, UK, Iceland, Norway, Liechtenstein, or Switzerland will never see the Product Improvement and Training control because it always remains off.\n5. How does my Product Improvement and Training setting change if I convert from an Enterprise, Education, or other Grammarly Business plan purchased through Sales to another paid Grammarly account?\nFor accounts that were previously on Grammarly’s Enterprise plan or other plans purchased through Grammarly’s sales team, the Product Improvement and Training will remain off, with no toggle visible to modify the setting, meaning that none of the organization’s content will be used to train Grammarly’s models or improve its products.\nFor further questions, please contact your sales representative or\ncustomer support\n.\nAll Grammarly users in the EU or UK\nHow is the Product Improvement and Training setting handled if my account originates in the EU or UK?\nWe do not train on any content from users whose account originates in the EU, UK, as well as Iceland, Norway, Liechtenstein, or Switzerland. This is reflected in the privacy settings of those users..",
  "category": "Privacy and Security",
  "tags": []
}