{
  "url": "https://support.grammarly.com/hc/en-us/articles/27454187430029-Manage-application-controls",
  "scraped_at": "2025-08-11T20:40:13.989007+00:00",
  "title": "Manage application controls",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nGrammarly is committed to\nstrong data privacy principles\nfor all users. You can specify additional restrictions for your team on what content or data Grammarly can access.\nThe application controls feature allows Enterprise admins to specify which desktop applications Grammarly will not run on. If an application is added to the blocklist, your team members will not be able to use Grammarly on that specific desktop application.\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nTo configure application controls, follow these steps:\nGo to your\nHome\npage, open the\nOrganization\ntab →\nEnterprise Security\n→\nDomains and apps\n.\nTo add an application to the blocklist, click\nAdd to block list\nat the top of the page.\nIn the window that appears next, choose the\nApplication\noption and specify the exact filename for a Mac or Windows application you’d like Grammarly to be blocked from accessing in the\nFilename\nfield. To block Grammarly in an application on both operating systems, you need to add each application filename to the blocklist separately.\nSpecify on which level this control will be applied:\nIf you want to restrict Grammarly usage in the specified application for every member in your organization, select\nEntire organization.\nIf you want to restrict Grammarly usage in the application only for specific member groups, select\nSpecific groups\nand choose which groups this setting should be applied to. Optionally, you can select\nMake this an admin controlled group\nif you also want to limit the ability to delete a specified group or remove members from that group only to admins. You can learn more in this article:\nHow to organize members into groups\nClick\nSave\n.\nOnce you save these settings, Grammarly will not run in the applications you specify.\nNote:\nThis feature is implemented for Grammarly for Windows and Grammarly for Mac only.\nYou can always remove applications from the blocklist on the\nDomains and apps\npage by clicking on the trash bin icon next to the application you’d like to remove from the list.\nNaming conventions for applications control\nWhen adding an application to the blocklist, make sure to use the correct syntax for the application name, which varies between Windows and macOS operating systems.\nFor applications that run on\nWindows\n, use the executable name (this is usually something like “application_name.exe”) to specify the application you want to block Grammarly from running. For applications that run on\nmacOS\n, use the application’s unique bundle identifier (bundle ID).\nHow to find an application’s bundle ID on a Mac\nOpen\nTerminal\non your Mac and run the following command:\nosascript -e 'id of app \"Application Name\"'\nwhere\nApplication Name\nis the exact name of the app, as it appears in the doc or in the Applications folder.\nImportant:\nIf your organization uses both Windows and Mac computers and you wish to block the same application on both operating systems, you need to add the application name with the appropriate syntax for each operating system separately. To do so, enter an application name and click\nSave\n. Then, click\nAdd to blocklist\nagain and add another application name.",
  "category": "Configure Access & Security",
  "tags": []
}