{
  "url": "https://support.grammarly.com/hc/en-us/articles/360058725831-Configure-SCIM-provisioning-with-Okta",
  "scraped_at": "2025-08-11T20:29:04.599075+00:00",
  "title": "Configure SCIM provisioning with Okta",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nThis guide provides the steps required to configure SCIM provisioning for Grammarly in Okta. For general information about SCIM provisioning, please see this article:\nConfigure SCIM provisioning\nTopics covered in this article:\nFeatures\nRequirements\nStep-­by-­Step Configuration Instructions\nProvisioning of already assigned users\nResolve Issues\nFeatures\nThe following provisioning features are supported in Okta:\nCreate users in Grammarly\nRemove users in Grammarly when they no longer require access\nKeep user attributes synchronized between Okta and Grammarly\nKeep groups and group membership synchronized between Okta and Grammarly\nNote:\nThe SCIM group provisioning support is available for Grammarly Enterprise customers upon request. If you’re interested in enabling this feature, please contact your Customer Success Manager or\nGrammarly Support team\n.\nRequirements\nOkta account with access to the\nadministrator console\nGrammarly Enterprise\naccount with the\nadmin role\nor a designated custom role\nGrammarly\napp configured in Okta\nSAML Single Sign-On (SSO) enabled in Grammarly\nStep-­by-­Step Configuration Instructions\nLog in to your Grammarly account, go to the\nProvisioning\npage\n, and click\nConfigure\n.\nClick the\nActivate SCIM\nbutton\nGenerate a SCIM token by clicking the\nCreate token\nlink\nCopy the SCIM token for future use, click\nGot it\n, and close the window.\nCheck the\nEnable provisioning features\nbox.\nClick\nConfigure API Integration\n.\nCheck the\nEnable API integration\nbox.\nEnter the\nAPI Token\nprovided by Grammarly (see\nStep 4\nabove).\nClick\nTest API Credentials\n—if successful, a verification message appears at the top of the screen.\nClick\nSave\n.\nSelect\nTo App\nin the left panel, then select the\nProvisioning Features\nyou want to enable.\nProvisioning of already assigned users\nIf you’re adding the provisioning capability to an already existing Grammarly application, you will need to provision the existing users before they can log in.\nTo do this, you will need to go to the\nAssignments\ntab on the apps configuration page and select\nProvision User\n.\nHere you will be able to bulk-provision users. After this provisioning step is complete, all assigned users will be able to log in.\nNote\n: If you don’t see this option, please contact Okta support so they can enable it. With this option, you will be able to bulk-provision all assigned users.\nResolve Issues\nWhen users are deactivated in Okta, they will be deactivated in Grammarly. Users will not be able to log in to the application, but their data will remain available as an “inactive user.” After 30 days, their accounts will be deleted completely.",
  "category": "SAML Single Sign-On",
  "tags": []
}