{
  "url": "https://support.grammarly.com/hc/en-us/articles/360054509951-What-data-does-Grammarly-collect-on-iOS",
  "scraped_at": "2025-08-11T20:38:53.501004+00:00",
  "title": "What data does Grammarly collect on iOS?",
  "content": "When you interact with the\nGrammarly Keyboard for iOS\nor\nGrammarly for iPad\n, we will collect certain information in providing our services. You can find the complete list below.\nThe type of data we collect\nApple categorization\nWhat it consists of\nWhy we need it\nUser content\n“User content”\nAny text that you check with the help of Grammarly as well as audio data you input if you use the dictation feature while Grammarly is activated.\nWe need access to your text to provide you with writing suggestions.\nAccess to the audio data is needed to convert it into text.\nProduct interaction data\n“Usage data”\nAny action you perform with our apps. For example, app launches, clicks, taps, scrolls, etc.\nTo provide our services and personalized features as well as to analyze how you use our services. We may also use this information to gather aggregated user behavior data for marketing purposes.\nContact information\n“Contact info”\nEmail address and name.\nFor user authentication, to communicate with you via emails, and for marketing purposes.\nWe do not sell your information to third-party data brokers.\nDiagnostics data\n“Diagnostics”\nError logs, launch and use times, etc.\nTo troubleshoot any issues you may experience with the app. To calculate aggregated statistics regarding app performance.\nUser ID\n“Identifiers”\nA unique number tied to your Grammarly account.\nTo be able to identify you in Grammarly’s internal systems.\nApple device ID\n“Identifiers”\nA random device identifier assigned by Apple to a user’s device.\nFor marketing purposes. This information is not linked to your user account.\nGrammarly device ID\n“Identifiers”\nA random identifier assigned to a user device in our internal systems.\nTo provide our services and to analyze user behavior data.\nNote:\nThe Grammarly Keyboard for iOS and Grammarly for iPad are blocked from accessing any text fields that may contain sensitive information such as password fields, credit card fields, search fields, and URL fields. They do not have access to the information typed with any of your other keyboards, including the default keyboard for iOS.\nWe maintain security standards and procedures to help keep your words safe and protected. We employ various security measures including but not limited to encryption, secure network configuration and data transfer, and restricted employee access. Visit Grammarly’s\nTrust Center\nto learn about our user-first approach to privacy and security. For more information about our security practices and attestations, please visit\nthis page\n.",
  "category": "Privacy and Security",
  "tags": []
}