{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000089911-I-cannot-log-in-with-my-correct-login-details",
  "scraped_at": "2025-08-11T20:40:23.397644+00:00",
  "title": "I cannot log in with my correct login details",
  "content": "If you can’t log in after entering the correct login details, we suggest double-checking that you are entering the right email address and password. If you’re not sure, reset your password at\nhttps://www.grammarly.com/resetpassword\nand try to log in again.\nNote:\nIf you logged out of your Grammarly account, navigate to\ngrammarly.com/signin\n. You should see a menu displaying the email addresses you previously used to log in.\nIf you registered your Grammarly account using Google, Facebook, or Apple as a sign-up method, please select the corresponding option to log in. If you prefer to set a password for your Grammarly account, you can do that by following the steps in\nHow do I set a password if I registered using Google, Facebook, or Apple?\nNote:\nIf your organization is using single sign-on, please sign in by launching Grammarly through your identity provider (a platform that provides authentication services to your organization). If you are having problems with your identity provider, please ask your organization's administrator to review the instructions in\nAdd Grammarly to an identity provider\n.\nIf resetting your password didn’t help, or you registered your account using a different sign-in method, select the Grammarly product in the below menu to see the corresponding troubleshooting steps.\nGrammarly’s browser extension or the Grammarly Editor\nIf you chose to log in with Facebook when registering your account, and you cannot log in to Grammarly in Firefox, please turn off the\nEnhanced Tracking Protection\noption as shown below:\nBrowser extensions like VPN or ad blockers might prevent you from logging in to Grammarly. Try turning off any browser extensions like these that you may have and see if you are able to log in. You can turn off other extensions in your browser settings:\nChrome:\nCopy\nchrome:extensions\ninto your address bar\nFirefox\n: Open Tools >\nAdd-ons\n>\nExtensions\nSafari\n: Open Safari >\nPreferences\n>\nExtensions\nMicrosoft Edge\n: Copy\nedge:extensions\ninto your address bar\nTemporarily turn off your VPN, proxy, antivirus, and firewall software,\nThere might be an issue with your browser cookies. Please clear cookies in your browser using the instructions in\nHow do I clear cache and cookies?\nGrammarly for Microsoft Office\nIf you can’t log in to Grammarly for Microsoft Office using your correct password or sign-in option, please reinstall Grammarly for Microsoft Office by following the steps in\nHow to reinstall Grammarly for Microsoft Office\n.\nIf you can't log in and you see the \"\nProxy authentication required\"\nmessage, please click\nProxy settings\nto specify your proxy server login details and try logging in again.\nIf you can’t log in to Grammarly for Microsoft Office using your browser, please try the following options:\nThere might be an issue with your browser cookies. Please clear your cookies in your browser using the instructions in\nHow do I clear cache and cookies?\nChange your default browser:\nIf you use Windows 10:\nPress the\nStart\nbutton; then, type\nDefault apps\nIn the search results, select\nDefault apps\nUnder\nWeb browser\n, select the browser currently listed, and then select a different one.\nIf you use Windows 7:\nClick the\nStart\nbutton and click\nControl Panel\nClick on\nPrograms\n>\nDefault Programs\n>\nSet Your Default Programs\nIf you cant see the Programs option, change the view style of Control Panel. Click on\nView\noption in the upper right corner of the Control Panel and select\nCategory\nview\nSelect the browser you want to use as your default and click on\nSet this Program As Default\nTemporarily turn off your VPN, proxy, antivirus and firewall software\nTurn off all your browser extensions. You can use the instructions below to open the extensions list in your browser:\nChrome:\nCopy\nchrome:extensions\ninto your address bar\nFirefox\n: Open Tools > Add-ons > Extensions\nSafari\n: Open Safari > Preferences > Extensions\nEdge\n: Copy\nedge:extensions\ninto your address bar\nMake sure that cookies in your browser are enabled:\nChrome\nCopy\nchrome:settings/content/cookies\ninto your address bar,\ntoggle\nAllow sites to save and read cookies data\n(recommended)\non\nand toggle\nBlock third-party cookies\noff\nFirefox\nIf you can’t log in to Grammarly using Facebook,  please turn off the\nEnhanced Tracking Protection\noption as shown below:\nSafari\nGo to\nPreferences > Privacy >\nUncheck\nBlock all cookies\nand\nPrevent cross-site tracking\nMicrosoft Edge\nCopy\nedge://settings/content/cookies\ninto your address bar, toggle\nAllow sites to save and read cookies data\n(recommended)\non and toggle\nBlock third-party cookies\noff\nGrammarly for Microsoft Word on Mac\nIf you can’t log in to Grammarly for Microsoft Word, please try to resolve this in the following way:\nOpen a blank document in Microsoft Word\nOpen Grammarly and click the \"i\" icon at the top right corner\nClick on\nClear Web Cache\n:\nThe Grammarly Keyboard for iOS or Android\nPlease follow these steps to troubleshoot the issue:\nReboot your Wi-Fi router and try signing in again. If you're using 3G or 4G, please see if you're able to access the internet using your browser.\nTemporarily turn off your VPN and antivirus app (if you're using them on your mobile device).\nTry to log in to the Grammarly Keyboard from another location (office, home, etc.), where the internet service provider is different.",
  "category": "Sign-in Help",
  "tags": []
}