{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000091592-Grammarly-s-browser-extension-user-guide",
  "scraped_at": "2025-08-11T20:38:34.862202+00:00",
  "title": "Grammarly's browser extension user guide",
  "content": "Grammarly offers\na browser extension\nfor Chrome, Safari, Firefox, and Edge. The extension works on popular websites and can help you check your text whenever you write online.\nNote:\nIf you also use\nGrammarly for Windows and Mac\n, the browser extension will be turned off by default but will remain active in Google Docs. For more information on how to use Grammarly in Google Docs, check out\nthis page\n.\nTo check whether the extension is installed, take a look at the top bar of your browser. If the extension is active, you’ll see the Grammarly icon:\nNote:\nIf you use Chrome, you can pin Grammarly’s browser extension to your toolbar for easier access. To do that, click the puzzle icon in the upper-right corner of the browser window and then click the pin icon to add Grammarly to your toolbar.\nOnce the extension is installed, you should see Grammarly’s writing suggestions as you type on different websites.\nThis article covers the following topics:\nChecking text\nUsing generative AI\nDeactivating certain suggestion types\nUsing definitions and synonyms\nAdjusting language preference and managing settings\nChecking text\nWhen you click into a text field, you should see Grammarly’s logo in the lower-right corner. As you start typing, Grammarly will begin to check your text dynamically, and the Grammarly icon will spin.\nNote:\nGrammarly does not initialize in text areas smaller than 38 pixels in height.\nWhen Grammarly finishes checking the text, the icon in the lower-right corner of the text field will show the number of suggestions:\nSome of our suggestions appear as underlines directly in the text. To accept a suggestion, hover over the underlined text, then click on the suggestion that appears:\nOther suggestions will appear one by one once you click the Grammarly icon in the lower-right corner of the text field. To accept a suggestion, click the corresponding button on the card that appears next:\nIf Grammarly flags an unfamiliar word and you’re sure it’s spelled correctly, you can either dismiss the suggestion by clicking\nDismiss\nor add the word to your\npersonal dictionary\nby clicking the book icon.\nNote:\nIf you use Grammarly for Business or Grammarly for Education, the list of suggestions will appear in a sidebar once you click the Grammarly icon in the lower-right corner of the text field.\nYou can also take advantage of Grammarly’s tone detector while using the Grammarly browser extension. To find out more, visit\nthis page\n.\nUsing generative AI\nTo start using generative AI, click the green lightbulb\nnext to the Grammarly icon, then type a prompt. You can also choose from\nsuggested generative AI prompts\nbased on your unique context. To learn more, check out\nIntroducing generative AI assistance\n.\nDeactivating certain suggestion types\nNote:\nThis feature is available only with Grammarly Premium, Grammarly for Business, and Grammarly for Education.\nCertain types of suggestions, such as adding the Oxford comma and flagging passive voice, can be turned off. You can view and manage suggestions in your account settings by following\nthis link\n.\nKeep in mind that if you deactivate a certain type of suggestion, it will be deactivated in all Grammarly product offerings that you use.\nUsing definitions and synonyms\nGrammarly’s browser extension also includes various features to help you improve your writing, such as looking up definitions or synonyms.\nThese options are activated by default, but you can switch them on or off by clicking the Grammarly icon in your browser’s toolbar.\nYou can check the definition of a word on any website by double-clicking it:\nWhen writing, you can find synonyms by double-clicking a word you wrote:\nAdjusting language preference and managing settings\nYou can adjust your preferences by clicking the Grammarly icon in the text field. In the pop-up that opens next, click the gear icon:\nAlternatively, click the Grammarly icon in your browser’s toolbar to update your preferences:\nHere you can:\nTurn off Grammarly’s browser extension for a particular website\nActivate or deactivate the definitions and synonyms feature\nActivate or deactivate the autocorrect feature\nActivate or deactivate phrasal predictions\nChange your\nlanguage preference\nCreate a new document or access your dashboard in the\nGrammarly Editor\nSwitch between using\nGrammarly for Windows and Mac\nand the Grammarly browser extension\nActivate the\nauto-citations feature",
  "category": "Grammarly Browser Extension",
  "tags": []
}