{
  "url": "https://support.grammarly.com/hc/en-us/articles/360044592712-Managing-your-settings-in-Grammarly-for-iPad",
  "scraped_at": "2025-08-11T20:34:37.995093+00:00",
  "title": "Managing your settings in Grammarly for iPad",
  "content": "The Grammarly app\non your iPad allows you to access both the Grammarly Editor and change your Grammarly Keyboard settings. Some settings, such as your language preference and personal dictionary, apply to both modes.\nLanguage Preference and Personal Dictionary\nTo manage your\nLanguage Preference\n, open the Grammarly app, and tap\nAccount\nat the bottom of the screen:\nThen, press\nLanguage Preference\nto choose a dialect:\nTo learn more about the Language Preference feature, check\nthis article\n.\nTo access your Personal Dictionary, please tap the\nManage Personal Dictionary\nbutton in the\nAccount\nmenu:\nThe Grammarly Keyboard\nIf you use the Grammarly Keyboard on your iPad, you can customize your writing experience. To see the list of settings you can adjust, open the Grammarly app and tap\nKeyboard\nat the bottom of the screen:\nHere you can adjust the following preferences:\nKeyboard Layout\nGrammarly for iPad's \"Keyboard Layout\" feature allows you to customize your keyboard layout according to your preference. It offers a variety of layout options, including QWERTY, QWERTZ, AZERTY, Dvorak, Colemak, and Workman. You can also easily switch between these layouts. This feature is especially useful for those who are familiar with different keyboard layouts or who want to try out new layouts to improve their typing speed and accuracy.\nEmoji Suggestions\nWith this feature, you can easily find and use the perfect emoji to enhance your written communication. As you type, Grammarly suggests relevant emoji based on the words you are using, making it easy to add a bit of fun and personality to any message. Whether you're chatting with friends or sending a professional email, emoji suggestions can help you express yourself in a more engaging and effective way.\nEmoji Key\nThe Emoji Key provides quick and convenient access to a wide range of expressive emoji. When this option is turned on, the Emoji Key appears next to the 123 key on your iPad keyboard. With a simple tap, you can access a diverse collection of emoji to add personality, emotion, and visual flair to your messages.\nSynonyms\nThe Synonyms feature in Grammarly for iPad enriches your writing by providing a quick and convenient way to explore alternative word choices. When this feature is turned on, you can easily access synonyms by placing the cursor next to a word. The synonyms will appear on the top bar of the Grammarly Keyboard.\nSwipe Typing\nThe Swipe Typing feature in Grammarly for iPad revolutionizes your typing experience by enabling faster and more intuitive text input. With this feature, you can effortlessly compose messages, emails, and documents by gliding your finger across the keyboard instead of tapping individual keys.\nIt is only possible to trigger swipe typing on an iPad in floating mode\n—\nwhen the keyboard is the size of the iPhone keyboard.\nTo change to the floating keyboard on an iPad, follow these steps:\nOpen any app that requires text input, such as Messages or Notes.\nTap on the text field to bring up the onscreen keyboard.\nTouch and hold the keyboard icon (located in the lower-right corner of the keyboard) until a menu appears.\nFrom the menu, select \"Floating\" or \"Undock\" (the exact wording may vary depending on your iPad model and iOS version).\nThe keyboard will now detach from the bottom of the screen and become a smaller, movable window.\nYou can move the floating keyboard around the screen by dragging it with your finger.\nTo dock the keyboard back to the bottom of the screen, touch and hold the keyboard icon again and select \"Dock\" or \"Merge\" from the menu.\nNote:\nNot all iPad models and iOS versions support the floating keyboard feature. If you don't see the option to switch to the floating keyboard, it may not be available on your device.\nDelete Swipe by Word\nThe Delete Swipe by Word feature in Grammarly for iPad simplifies the process of deleting text by allowing you to delete entire words with a single swipe. With this feature activated, you can effortlessly remove words or phrases by touching your finger to the Backspace key (the key to the right of \"m\") and immediately sliding it to the left. The farther you slide it, the more words will be selected and deleted. Instead of tediously deleting one character at a time, Grammarly intelligently recognizes your swipe gesture and instantly erases entire words, saving you time and effort.\nCompletions Bar\nThe Completions Bar feature in Grammarly for iPad enhances your writing efficiency by providing intelligent word suggestions as you type. Located above the keyboard, the Completions Bar dynamically displays relevant word options based on the context of your text. As you type, Grammarly analyzes your input and offers predictive suggestions to help you complete your sentences with accuracy and speed. Simply select a suggested word from the Completions Bar to insert it into your text.\nAuto-Capitalization\nGrammarly intuitively recognizes the beginning of sentences, proper nouns, and other instances where capitalization is required. As you type, Grammarly takes care of capitalizing the first letter of each sentence and appropriate names, saving you the effort of manually correcting capitalization errors.\nEnable Caps Lock\nBy enabling this feature, you can turn on the Caps Lock mode within your keyboard, allowing you to type in uppercase without having to hold the shift key continuously. This is especially useful when you need to emphasize a word, write acronyms, or enter text in all caps.\nNote:\nTo activate Caps Lock, double-tap the shift/up arrow key.\nAuto-Correction\nThe Auto-Correction feature in Grammarly for iPad ensures that your writing is free from spelling mistakes and typos by automatically applying common corrections as you type.\nSound Feedback on Keypress\nWith this feature enabled, Grammarly generates a subtle sound effect when you press each key on the keyboard.\nShow Lowercase Keys\nWhen enabled, this option ensures that the keyboard always shows the lowercase letters, regardless of the capitalization state. This helps you maintain a consistent visual reference of the lowercase alphabet, making it easier to recognize and select the appropriate keys while typing.\n“.” Shortcut\nDouble-tapping the spacebar will insert a period followed by a space.\nTo turn any of these options on or off, switch the toggle next to them.\nTone Detection\nTap the Grammarly icon on your keyboard to see the tones:\nNote:\nTone detection requires 90+ characters in order to provide you with tone insights.",
  "category": "Grammarly for iPad",
  "tags": []
}