{
  "url": "https://support.grammarly.com/hc/en-us/articles/15509056440461-I-can-t-use-Grammarly-s-generative-AI-features",
  "scraped_at": "2025-08-11T20:35:03.743691+00:00",
  "title": "I can't use Grammarly's generative AI features",
  "content": "We want you to be able to take advantage of all Grammarly has to offer, including our generative AI features, which allow you to rewrite, compose, ideate, and reply in an instant.\nBelow, we’ve provided a selection of troubleshooting steps to follow if Grammarly's on-demand generative AI features are not appearing where you expect them to be.\nThere are several ways to access the generative AI features, including highlighting text to see an in-line entry point, clicking on the green lightbulb icon near the Grammarly icon, and clicking on the side panel of the Grammarly Editor.\nStep 1: Make sure you're using a supported product offering\nTo start off, please ensure you’re using a supported product offering. We’ve created a comprehensive list of product offerings where we’ve released generative AI:\nGenerative AI is available when using…\nNot currently available when using…\nGrammarly for Windows\nGrammarly for Mac\nThe Grammarly Editor\nGrammarly for Chrome\nGrammarly for Microsoft Edge\nGrammarly for iOS (iPhone + iPad)\nGrammarly for Android\nGrammarly for Microsoft Office\nGrammarly for Microsoft Word on Mac\nGrammarly for Safari\nGrammarly for Firefox\nStep 2: Check your Account Settings\nIf you already use a supported product offering, please make sure that generative AI is turned on in your account settings. Go to the\nFeature customization\ntab and make sure each option is switched on:\nIf the options on this page are all gray, and you cannot switch them on or off, please\ncontact Support\nso that our team can investigate this matter further.\nYou can also adjust these settings in the Grammarly for Windows and Mac Settings window and the Grammarly browser extension dropdown menu:\nGrammarly for Windows\nGrammarly for Mac\nGrammarly Browser Extension\nSettings > Customization > Generative AI\nSettings > Customization > Generative AI\nDropdown menu > Generative AI\nStep 3: Check your local software and security settings\nGrammarly's generative AI assistance might be blocked by your local security software or network settings. Please ensure that your antivirus and firewall software allows access to the following internet addresses:\ntreatment.grammarly.com (ports 80 and 443)\ngnar.grammarly.com (ports 80 and 443)\ncapi.grammarly.com (ports 80 and 443)\ndata.grammarly.com (ports 80 and 443)\nauth.grammarly.com (ports 80 and 443)\n*.grammarly.net (ports 80 and 443)\nYou or your IT administrator may need to add exception rules for the above addresses to your firewall and antivirus software.\nStep 4: Check that you have enough generative AI prompts\nIf you have used all your allocated prompts for the month, Grammarly’s generative AI features will no longer appear when you highlight your text.\nA prompt is a sentence or phrase that is used to initiate a response or action from Grammarly's generative AI. You can read more about prompts in this article:\nHow many generative AI prompts do I have?\nPlease rest assured that you will be able to access Grammarly’s suggestions, which appear as underlines in your text, even if you have used up all your generative AI prompts.\nTo see when your prompts will be refilled, hover over the number of remaining prompts to reveal a tooltip:\nGrammarly for Education or Grammarly for Business user\nGrammarly takes transparency and customer control seriously. Administrators can decide whether they want members of their organization to have access to the generative AI features offered by Grammarly.\nYou can check your\nFeatures\ntab to see if generative AI options are turned on for your team. If you do not have access, you can reach out to your account admin for more information, or, if applicable, click\nRequest access\nto alert your admin of your interest.\nI see an error message\nWe recommend reviewing the dedicated article relevant to the error message you’re seeing in the\nResolve Issues > Generative AI assistance\nsection of the Grammarly Support page.",
  "category": "Generative AI assistance",
  "tags": []
}