{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000931852-Invite-team-members",
  "scraped_at": "2025-08-11T20:42:58.449268+00:00",
  "title": "Invite team members",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins and members with designated custom roles\nTo invite team members one by one:\nGo to the\nMembers\npage and click\nInvite\nmembers\nin the upper-right corner.\nIn the window that appears next, enter the email addresses of the people you’d like to invite and click\nInvite members\n.\nNote:\nIf all seats on your subscription have been allotted, your payment method on file will be charged a prorated amount for additional seats needed to invite more team members.\nTo invite multiple team members at once:\nGo to the\nMembers\npage and click\nInvite m\nembers\nin the upper-right corner.\nIn the window that appears next, choose\nImport list\n.\nNext, click on the\nDownload template\nlink.\nAdd the email addresses of the team members you’d like to invite to the downloaded file. You can leave the “Name” and “Group” columns empty.\nReturn to the previous window and click\nChoose file\n.\nOptional: If you choose the\nReplace the existing member list\noption, any team members who are not included in the file will be removed from your subscription.\nUpload the file and click\nContinue\n.\nClick\nConfirm\nto confirm the action.\nTo join your subscription, invited members will need to click the link in the invitation sent to their email addresses.\nIf your team members can’t find the invitation emails after checking their spam folders, ask them to add\ninfo@em.grammarly.com\n,\ninfo@send.grammarly.com\n, and\ndonotreply@grammarly.com\nto their contact lists. Afterward, send the invitations again.\nIf the invitation emails are still not going through, please follow the steps in this article:\nI don't receive emails from Grammarly. What do I do?\nAlternatively, you can invite team members by sending them a unique link to join your subscription. To do that, click\nInvite m\nembers\nand click\nCopy\nnext to\nInvite by link:\nNote:\nInvite links are only available for teams with unique domains and are not available for teams with generic domains, such as @gmail.com or @yahoo.com.\nIf your organization uses SAML single sign-on, please review the instructions in this article:\nAdd team members with SSO activated",
  "category": "Manage Members & Permissions",
  "tags": []
}