{
  "url": "https://support.grammarly.com/hc/en-us/articles/360003474732-Grammarly-Editor-user-guide",
  "scraped_at": "2025-08-11T20:37:57.841773+00:00",
  "title": "Grammarly Editor user guide",
  "content": "The Grammarly Editor combines a web-based editor where you can create, upload, and edit your documents, an account center where you can manage your account and subscription, and an app center where you can download other Grammarly product offerings.\nYou can access the Grammarly Editor at\nhttps://app.grammarly.com/\nin any supported browser. This is a perfect fit for someone who prefers not to download any other applications to their computer or use web-based text editors.\nIf you’d like to use Grammarly with other native apps or websites, we recommend installing\nGrammarly for Windows and Mac\n. For more information, check out\nthis article\n.\nNote:\nThe Grammarly Editor is also available on\niPads\nand\niPhones\n.\nIn this article, you can find the information on:\nGetting started\nCreating and uploading documents\nWriting and editing text\nUsing generative AI\nDeactivating certain suggestion types\nFormatting text\nUsing Grammarly’s plagiarism checker and AI detection\nAdjusting goals\nChanging font size and other settings\nDownloading documents\nReviewing document statistics\nGetting started\nThe Grammarly Dashboard will appear immediately after you log in to your account at\nhttps://app.grammarly.com/\n. This page allows you to manage your settings and your documents. Here you can:\nUpload, create, and edit documents\nManage all of your saved documents\nRestore recently-deleted documents and document versions\nUpgrade your account or manage your subscription settings\nAdjust your account settings and email preferences\nReview the list of Grammarly product offerings you can download\nAccess our Help Center\nCreating and uploading documents\nYou can start working on a new document by clicking\nNew document\n. If you want to check text in any existing document on your computer, click\nUpload file\n:\nYou can also import your text by creating a blank document and pasting the text from your clipboard. However, some of your document’s original formatting may be lost if you use the copy-paste option. Visit\nthis page\nto find out more about preserving your original formatting.\nWriting and editing text\nGrammarly automatically checks everything you type, making it easy to spot and fix errors quickly. You can also take advantage of Grammarly’s AI feature to help you get started on the document or improve it.\nWhen Grammarly detects a writing issue in your text, you’ll see a red, blue, green, or purple underline. If you use Grammarly Pro or Grammarly Business and your team has set up a style guide, you’ll also see gray underlines:\nThe suggestions will appear on the right side of the screen, where you can review them. By default, Grammarly will guide you through suggestions starting at the top of the document. If you prefer browsing through the list of suggestions, click on the suggestion card to locate the underlined phrase in the text.\nWhen reviewing suggestions, you can:\nClick\nAccept\nto accept it—Grammarly will apply it automatically to your text.\nClick\nDismiss\nto ignore the suggestion.\nClick\nLearn more\n(\n) in the upper part of the suggestion card to see a detailed explanation behind each suggestion.\nClick\nMore Actions\n(\n) on the card to flag the suggestion as incorrect or offensive.\nIf you’d like Grammarly to stop flagging a particular spelling as incorrect, you can add the word to your personal dictionary by clicking\nAdd to dictionary\n(\n).\nIf you’re using one of our paid subscription plans, you might also see an option to increase the impact of your text in the lower-right corner of the page—this is our strategic suggestion feature. You can find out more here:\nIntroducing strategic suggestions\n.\nUsing generative AI\nTo start using generative AI in the Grammarly Editor, click the corresponding section in the sidebar on the right, and type a prompt:\nYou can also choose from suggested generative AI prompts based on your unique context. To learn more about Grammarly's generative AI features, check out\nIntroducing generative AI assistance\n.\nDeactivating certain suggestion types\nNote:\nThis feature is available only with Grammarly Pro, Grammarly Premium, Grammarly for Business, and Grammarly for Education.\nCertain types of suggestions, such as adding the Oxford comma and passive voice alerts, can be turned off.\nIf you see a suggestion that is not helpful, click\nMore Actions\n(\n) in the lower part of the suggestion card. If it’s a suggestion that can be deactivated, you’ll see an option that says\nTurn off suggestions like this\n:\nYou can view and manage suggestions on the\nYour Preferences\npage:\nhttps://account.grammarly.com/customize/suggestions\n.\nNote:\nIf you deactivate a certain type of suggestion in the Grammarly Editor, it will also be deactivated in other Grammarly product offerings.\nFormatting text\nIf you create a new document or copy your text into the Grammarly Editor, you can use these formatting options:\nBold and italic text\nNumbered lists and bullet points\nH1 and H2 headers\nLinks\nTo apply any of these, select a specific part of the document you’d like to format and click the corresponding button in the lower part of the screen.\nYou can also use keyboard shortcuts to apply formatting—to find out which shortcuts to use, hover over the formatting option.\nNote\n: If you upload your document to the Grammarly Editor, it will appear as plain text, and our formatting options will be deactivated to preserve the formatting of your original document. That original formatting will be preserved in the version you download after editing. Visit this page to find out more:\nPreserve text formatting\n.\nUsing Grammarly’s plagiarism checker and AI detection\nIf you use one of Grammarly's paid subscription plans, you can check your document for plagiarism or whether your document may be flagged as AI-generated.\nOnce you finish writing or editing your text, click the\nCheck for AI text & plagiarism\nbutton in the upper-right corner of the page:\nFor more information, visit these pages:\nHow to check my document for plagiarism\nand\nHow to use Grammarly's AI detection\n.\nAdjusting goals\nGrammarly can also help you achieve a specific goal with your text and ensure that it’s suitable for your intended audience.\nTo adjust your goals, click\nGoals\nin the upper part of the screen, choose your preferred settings, and click\nDone\n:\nNote:\nDomains are available only to Grammarly Pro, Grammarly Premium, Grammarly for Business, and Grammarly for Education users.\nTo find out more about goals, check out\nHow to Set Goals in the Grammarly Editor, and Why You Should | Grammarly Spotlight\n.\nChanging font size and other settings\nYou can adjust several aspects of your experience with the Grammarly Editor:\nTurn off auto-jumping to the next alert\nPrevent Grammarly from checking quoted text\nIncrease the document’s font size\nActivate the colorblind mode\nNote:\nThe option to exclude quoted text from checking is available only in the\nGrammarly Editor\n. This setting will deactivate all suggestions on text inside quotes, but Grammarly will still check this text for plagiarism.\nTo adjust any of these settings, open any document, click the\nMenu\nicon (\n) in the upper-left corner, and then click\nEditor settings.\nIn the window that opens next, switch your preferred settings on or off.\nYou can also adjust your\nlanguage preference\nin the Grammarly Editor. If you are working on a document, click the\nMenu\nicon (\n) in the upper-left corner to open the sidebar and then select your preferred option under\nLanguage preference\n:\nAlternatively, go to\nAccount\n>\nWriting\n>\nPersonal Style\n>\nLanguage Settings\n, and choose your preferred dialect next to\nI write in\n:\nDownloading documents\nOnce you’ve finished editing, you can download the document by clicking the\nMenu\nicon (\n) in the upper-left corner and selecting\nDownload\n:\nIf you started by uploading a file, Grammarly will export your document in the same file format that you began with (for example, if you started by uploading a .doc file, your Grammarly document will be available to download as a .doc file).\nYou can also copy your text to the clipboard. The clipboard is a temporary storage area where material cut or copied from a file is kept for pasting into another file. You may paste the copied material by using the\nCtrl\n+\nV\n(on Windows) or\nCmd\n+\nV\n(on macOS) key combination.\nReviewing document statistics\nYou can view your document statistics by clicking the\nOverall score\noption. If you don’t see this option, click\nCorrect with Assistant\nfirst.\nThe\nOverall score\nsection offers helpful information about your text, including word count, readability, and vocabulary.\nIf you’d like to download a PDF report of your document statistics, go to\nOverall score\nand select\nDownload PDF Report\nin the pop-up menu that will open:\nNote:\nIf you checked your document for plagiarism, you can also add your plagiarism result to the report.",
  "category": "Grammarly Editor (classic)",
  "tags": []
}