{
  "url": "https://support.grammarly.com/hc/en-us/articles/32389426694029-AI-Chat-Support-and-FAQs",
  "scraped_at": "2025-08-11T20:34:45.197219+00:00",
  "title": "AI Chat Support and FAQs",
  "content": "What is AI Chat?\nGrammarly’s AI Chat brings generative AI directly into your workflow - no matter where you’re working. It interacts in a conversational way to answer questions, help with tasks, provide recommendations, create written drafts, and more.\nAI Chat can also use context from your active window to make its responses more relevant and personalized. For example, you can ask it to summarize a news article you’re viewing or generate marketing copy based on a campaign brief you have.\nWhether you’re looking for quick information, composing a first draft, or just brainstorming, AI Chat adapts to your needs to make your communication and workflow seamless.\nAI Chat is currently available as a beta release on macOS.\nWhich of my data does AI Chat use?\nAI Chat uses the text you write when interacting with it. To provide context for your interactions with AI Chat, additional information from the active window is used. Information from the active window includes non-editable text, such as the text of a news article, and the title of the window. You can also add to the context by attaching files while engaging with AI Chat. The text you write and the associated context is sent to Grammarly servers and subsequently third-party LLM providers.\nDoes AI Chat use information such as my e-mail address, credit card, or phone number?\nWhen you use AI chat, it removes information such as e-mail addresses, credit card, and phone numbers from the text you write as well as the context of your interaction. Specifically, Grammarly servers filter text received from your device before sending it to third-party LLM providers. When you include a file to your interaction with AI Chat it is converted to text so it can be filtered.\nDoes AI Chat store any data about me?\nAI Chat stores a history of your interactions with it, including the text you write, any responses you receive, and the context used.\nWhere is AI Chat data stored?\nWhen using AI Chat, data is stored on your device and Grammarly servers.\nOn-device data is stored encrypted at rest using the AES-256 GCM encryption algorithm and a randomly generated 256-bit key. The key is stored protected in Keychain on macOS.\nData stored on Grammarly servers is protected as described in\nTechnical Specifications\n(see “\nHow We Secure Data\n”).\nTo delete your AI Chat data, including the history of past interactions, right-click on any chat in the lefthand side of the AI Chat window and click “Delete”.\nWhat are some security considerations when using AI Chat?\nAI Chat stores a history of your interactions with it on the device where you use it. The data is encrypted and the encryption key is stored in Keychain on macOS. Other people who can log into or unlock the device may be able to access the encryption key from Keychain and subsequently the history of your interactions, which includes text you write, as well as text from windows and files involved in your interactions. We recommend using a hard-to-guess device password and not sharing the password with others. While the device is unlocked, other people may be able to use AI Chat to access the history of your interactions, even if they cannot log into or unlock the device themselves. We recommend logging out of Grammarly before letting others use your device especially if using a shared device such as a school or library computer.\nNote:\nWe may periodically update this article, so please check back for the latest information.",
  "category": "Privacy and Security",
  "tags": []
}