{
  "url": "https://support.grammarly.com/hc/en-us/articles/33347704601613-Updating-the-Grammarly-Premium-plan-to-the-Grammarly-Pro-plan",
  "scraped_at": "2025-08-11T20:42:29.400589+00:00",
  "title": "Updating the Grammarly Premium plan to the Grammarly Pro plan",
  "content": "Grammarly Premium was our paid tier for individuals.\nGrammarly Pro\nis our new paid tier that will replace Grammarly Premium. Grammarly Pro provides the flexibility of a subscription for one person or for teams of two or more people.\nWhile Grammarly Premium granted access to advanced writing features, such as full-sentence rewrites, tone suggestions, plagiarism detection, and 1,000 monthly generative AI prompts, Grammarly Pro offers more enhanced capabilities:\nAll Grammarly Premium features.\nTwice as many monthly generative AI prompts (2,000 instead of 1,000).\nThe flexibility of creating teams (up to 149 members).\nAdditional features, such as\nstyle guides\n,\nbrand tones\n, knowledge share,\nsnippets\n, and\nusage analytics\n, that help individuals and teams stay on-brand, compliant, and productive.\nGrammarly Premium users will be moved to Grammarly Pro plans gradually throughout this year.\nWith Grammarly Pro, you can enjoy the same seamless experience and features you already love, plus some exciting new tools to supercharge your workflow. We encourage you to learn more at\nwww.grammarly.com/pro\n.\nCan I opt out of the migration?\nUnfortunately, we don’t currently provide an option to opt out of the migration.\nWhen will my plan be updated?\nBeginning in March 2025, we started migrating Grammarly Premium users to our new Grammarly Pro plan. This change is happening gradually, so it may take some time before it is available to everyone. Unfortunately, we can’t share an exact date at this time.\nYou’ll receive further communication from Grammarly regarding this change. Your billing amount will remain the same.\nWill my pricing change?\nWe are not increasing the price at this time. Your billing amount will remain the same. You can check out our current rates at\nwww.grammarly.com/plans\nand review Grammarly’s billing policy on this page:\nTerms of Service\nNote\n: If you add more seats to your Grammarly Pro plan, you will be charged a prorated amount for every new team member you invite to join your account. The prorated charge amount depends on the time remaining until your subscription renewal or expiration date.",
  "category": "Grammarly Pro",
  "tags": []
}