{
  "url": "https://support.grammarly.com/hc/en-us/articles/4428237509645-Grammarly-for-Windows-and-Mac-doesn-t-appear-in-Microsoft-Word",
  "scraped_at": "2025-08-11T20:29:20.620448+00:00",
  "title": "Grammarly for Windows and Mac doesn’t appear in Microsoft Word",
  "content": "Windows\nAt this time, Grammarly for Windows supports the following versions of Microsoft Office:\nMicrosoft Office 2016\nand newer\nMicrosoft Office 365 (installed/updated after February 2020)\nIf you’d like to check the details of your Microsoft Office version, please follow the instructions in\nthis Microsoft Support article\n. If you are running an older version of Microsoft Office 2016, we suggest installing the latest updates before proceeding.\nIf you use\nMicrosoft Office 2016\nand newer and still experience this issue, please follow the steps below:\nMinimize and restore the current window.\nThe Grammarly widget will appear anchored to one of the corners of your Microsoft Office window. Please check to see if it's anchored in one of the corners.\nIf you still don't see the widget appear, click on the Grammarly icon in the system tray (located in the lower-right corner of your screen), right-click on it, and choose\nQuit Grammarly\n:\nThen, click\nType here to search\nbeside your Start menu, type in “Grammarly”, and launch the Grammarly app. Alternatively, please double-click the Grammarly thumbnail on your desktop.\nIf the issue persists, please do the following:\nFind the Grammarly icon in the system tray (located in the lower-right corner of your screen), right-click on it, and choose\nSettings\n:\nSelect the\nBlocked Apps\n(or\nAccess\n) tab. If Grammarly was deactivated on certain websites or apps, the list of such websites or apps will appear under\nBlocked by me.\nIf none of the above helped, please\nreach out to the Support team\nindicating the Microsoft Office version you’re currently using.\nmacOS\nPlease make sure that you have only one Microsoft Office document opened. If you open two documents simultaneously, Grammarly for Mac will initialize in only one of them.\nAdditionally, Grammarly doesn't work in Microsoft Word when the\nOutline,\nDraft,\nor\nWeb\nlayout is selected. If one of those options is selected, follow these steps to change the setting:\nIn your Microsoft Word menu, select\nView\n.\nSelect\nPrint Layou\nt\n:\nNote:\nIf you see a red dot within the Grammarly icon in your system menu bar, click on it and select the option to reopen the app where you are currently editing your text:\nIf you are already using Print Layout, please follow the steps below:\nMinimize the current window and then restore it.\nThe Grammarly widget will appear anchored to one of the corners of your Microsoft Office window. Please check to see if it's anchored in one of the corners.\nIf you still don't see the widget appear, click on the Grammarly icon in the menu bar at the top of your screen and choose\nQuit:\nThen, open Launchpad, locate\nGrammarly Desktop,\nand click it. Alternatively, open Finder, select\nApplications\nin the sidebar, and double-click on\nGrammarly Desktop.\nIf Grammarly still doesn’t work in Microsoft Office products, follow these steps:\nFind the Grammarly icon in the menu bar at the top of your screen and choose\nSettings:\nClick\nBlocked Apps\n(or\nAccess\n) and check whether the application you’re using is listed under\nBlocked by me\n.\nIf none of the above helped, please submit a support request\nhere\n. Make sure to indicate your Microsoft Office version and provide a full-screen screenshot of the window where Grammarly doesn't appear.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}