{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090871-How-does-Grammarly-work",
  "scraped_at": "2025-08-11T20:40:57.281873+00:00",
  "title": "How does Grammarly work?",
  "content": "There’s more to good writing than grammar and spelling.\nGrammarly’s product ensures that everything you type is not only accurate in spelling, punctuation, and grammar but also clear, compelling, and easy to read. Our suggestions help identify and replace complicated sentences with more straightforward ones, refresh repetitive language, and strengthen your writing, so it says what you really mean.\nGrammarly’s algorithms flag potential issues in the text and make context-specific suggestions to help with grammar, spelling and usage, wordiness, style, punctuation, tone, and even plagiarism. Our suggestions explain the reasoning behind each proposed change so you can make an informed decision about whether—and how—to alter this aspect of your writing. Grammarly is also easy to use: Install\nGrammarly for Windows\nor\nGrammarly for Mac\n, and get writing suggestions across a wide array of desktop apps and websites. This includes:\nMicrosoft Office suite (Word and Outlook).\nHundreds of desktop native apps including Slack and Apple Mail.\nAll of your favorite web apps (Gmail, Confluence, Jira, Salesforce, Sheets, Hubspot).\nNote:\nGrammarly for Windows and Mac supports Windows 10 and newer and all macOS versions starting from Catalina (10.15). It will not run on older macOS versions.\nYou can also copy and paste your writing into the\nGrammarly Editor\nonline\n.\nOn mobile devices, you can install:\nGrammarly for iPhone\n, which offers the option to access the Grammarly iPhone Editor on your mobile device and check your writing using the Grammarly Keyboard and the Grammarly browser extension for Safari.\nGrammarly for iPad\n, which allows you to access the Grammarly Editor directly from your iPad.\nGrammarly for Android\n, which helps ensure everything you write on mobile is mistake-free.\nFor those who are looking for more ways to learn Grammar, we offer the following resources:\nGrammarly Handbook\n- an online guide explaining English grammar and style.\nGrammarly Blog\n- offers daily tips, fun commentary, and valuable insights from the wonderful world of writing and grammar.\nGrammarly's Facebook community\nand\nTwitter account\n, both of which provide fans with fun grammar tips and discussions.",
  "category": "Common Questions",
  "tags": []
}