{
  "url": "https://support.grammarly.com/hc/en-us/articles/4410368818445-Configure-SCIM-provisioning-with-OneLogin",
  "scraped_at": "2025-08-11T20:46:23.067887+00:00",
  "title": "Configure SCIM provisioning with OneLogin",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nThis guide provides the steps required to configure SCIM provisioning for Grammarly in OneLogin. For general information about SCIM provisioning, please refer to this article:\nConfigure SCIM provisioning\nTopics covered in this article:\nFeatures\nRequirements\nStep-by-Step Configuration Instructions\nProvisioning of Already Assigned Users\nMonitoring Deployment\nResolve Issues\nFeatures\nThe following provisioning features are supported in OneLogin:\nCreate users in Grammarly\nRemove users in Grammarly when they no longer require access\nKeep user attributes synchronized between OneLogin and Grammarly\nRequirements\nOneLogin\naccount with access to the\nadministrator console\nGrammarly Enterprise\naccount with the\nadmin role\nor a designated custom role\nGrammarly\napp configured in OneLogin\nSAML Single Sign-On (SSO) enabled in Grammarly\nStep-by-Step Configuration Instructions\nLog in to your Grammarly account, go to the\nProvisioning\npage\n, and click\nConfigure\n.\nClick the\nActivate SCIM\nbutton\nGenerate a SCIM token by clicking the\nCreate token\nlink\nCopy the SCIM token for future use, click\nGot it\n, and close the window.\nLog in to the OneLogin admin’s console and navigate to the\nApps → Company Apps → Grammarly\napp.\nGo to the\nConfiguration\ntab. Enter the Grammarly\nSCIM token\ngenerated in step #1.\nClick\nEnable\nto connect to the Grammarly API.\nNavigate to the\nProvisioning\ntab.\nSelect\nEnable provisioning for Grammarly\n.\nChoose the provisioning actions for which you want to\nrequire the administrator’s approval\n. If either\nCreate user / Delete user / Update user\nis enabled (\ne.g., on the screenshot below\n), the selected actions have to be manually approved or ignored each time by the administrator in the\nOneLogin Users → Provisioning\ntab.\nLeave the actions clear if you want OneLogin to make the provisioning changes automatically without requiring administrative approval.\nSelect one of the following actions (Delete, Suspend, or Do Nothing) on what happens with a user in Grammarly if the user’s account is deleted/suspended in OneLogin.\nClick\nSave\n.\nGo to\nApps → Company Apps → Grammarly → Parameters\nto confirm the mapping of Grammarly attributes to OneLogin attributes.\nSelect\nConfigured by admin\n. Make sure the attributes are set as follows:\nAdd users to Grammarly OneLogin. With SSO enabled, these users will be provisioned automatically.\nGo to\nUsers → Users →\nSelect a user\n→\nApplications.\nAssign the Grammarly application.\nProvisioning of Already Assigned Users\nIf you already have Grammarly users, those users can be synchronized with the newly provisioned OneLogin users.\nGo to\nApps → Company Apps → Grammarly\n.\nGo to the\nMore Actions\nmenu. Click\nSync logins.\nOneLogin will retrieve the list of active Grammarly users and automatically link those users based on the default username (email address).\nNote:\nThe\nSync logins\nprocess overwrites the personal Grammarly passwords of the existing users with the passwords stored for those users in OneLogin.\nMonitoring Deployment\nOnce you’ve finished provisioning, check the\nApps → Company Apps → Grammarly → Users\ntab to review the provisioning state of the selected user.\nIf the provisioning row shows\nFailed\nfor the user, click the row to view the reason for the failure. Click\nRetry\nto try again after fixing the issue.\nResolve Issues\nUsers without\nEmail\n,\nFirst Name\n, and\nLast Name\ndefined in their OneLogin profiles cannot be imported to Grammarly as the new users.\nWhen users are deactivated in OneLogin, they will be deactivated in Grammarly. Users will not be able to log in to the application, but their data will remain available as “inactive users.” After 30 days, their accounts will be deleted completely.",
  "category": "SAML Single Sign-On",
  "tags": []
}