{
  "url": "https://support.grammarly.com/hc/en-us/articles/21227721882253-Introducing-app-actions",
  "scraped_at": "2025-08-11T20:43:53.565236+00:00",
  "title": "Introducing app actions",
  "content": "Who has access:\n- Grammarly Pro, Grammarly Premium, Grammarly Business, and Grammarly Enterprise users\n- Grammarly for Education users (the feature is turned off by default and needs to be activated by the license admin)\n- Grammarly Free users (the available app actions are adding a GIF from Giphy and adding an image from Unsplash)\nWith app actions, you can connect Grammarly to apps you use every day and perform common tasks directly from Grammarly. This saves time by avoiding context-switching and helps you stay in the flow of writing.\nApp actions work with:\nAsana\n: Manage your work faster. Create new Asana tasks or search for and link to existing ones from wherever you use Grammarly.\nUnsplash\n: Find and insert the perfect image for your text. Browse millions of free, high-quality images from Unsplash, without switching screens.\nGiphy\n: Bring your writing to life with expressive GIFs. Browse Giphy’s library and insert images from wherever you are working with Grammarly.\nJira\n: Keep your projects on track and your stakeholders informed. Create Jira issues or search for and link to existing ones from wherever you use Grammarly.\nConfluence\n: Easily share company knowledge with your teammates. Search for and link to your Confluence pages directly from Grammarly.\nCalendly\n: Make scheduling meetings seamless. Share your availability via Calendly from wherever you use Grammarly.\nHubSpot\n: Manage your CRM with ease. Quickly create HubSpot contacts, or search and link to existing ones from wherever you use Grammarly.\nMicrosoft 365\n: Get quick access to Microsoft 365. Search for and link to your files from wherever you’re writing.\nSmartsheet\n: Drive projects forward and keep stakeholders informed. Create new Smartsheet tasks (rows) or search and link to existing ones from wherever you’re writing\nmonday.com\n: Maintain project momentum and keep stakeholders updated. Create new monday.com tasks (items) or search and link to existing ones from wherever you use Grammarly.\nGrammarly’s translation feature\n: T\nranslate text directly within Grammarly. You can learn more in this article:\nIntroducing Grammarly’s translation feature\nRequirements\nGenerative AI assistance must be turned on.\nEnable generative AI for your team\n.\nAdmins of team plans can turn on all or specific app actions in the corresponding section of the\nFeature access\npage:\nFor individual Grammarly Pro, Grammarly Premium, and Grammarly Free users, the feature is activated by default. See the\nApp actions\nsection below for instructions on how to start using the app actions available for your account.\nNote:\nApp actions are currently available in\nGrammarly for Windows\n,\nGrammarly for Mac\n(for Grammarly Business and Grammarly Enterprise users only), and in\nGrammarly for Chrome\n.\nApp actions\nLearn how to use the app actions currently available in Grammarly.\nAsana\nCreate or find a task in Asana\nYou can create or find Asana tasks directly from Grammarly wherever you write—for example, while taking notes or communicating with team members. This saves time and ensures that you have all the task context at your fingertips.\nCreate a task in Asana\nTo create a task in an Asana workspace, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate a task in Asana\n. You may need to select\nMore\nto see this option.\nIf this is your first time using this app action, you’ll need to connect Grammarly to your Asana account.\nAfter reviewing the privacy disclosure, select\nConnect Asana\n.\nOn the next screen, choose an Asana account and then select\nAllow\nto authorize Grammarly on the account.\nOnce you’ve connected your Asana account, return to\nCreate a task in Asana\nand select a\nworkspace\n. You’ll only need to do this once.\nYou can change your workspace at any time by opening the Asana action and selecting\nChange workspace\n.\nType the\ntask name\nand optionally include details like the description, project, assignee, and due date. Then, select\nCreate Task\n.\nYou’ve created a task in Asana, without leaving Grammarly! You can now\nInsert\nthe task into the document, select the\nCopy\nbutton to copy the task link to clipboard, or select the\nOpen\nbutton to open the file link in the browser.\nFind a task in Asana\nTo find a task in an Asana workspace, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate a task in Asana\n. You may need to select\nMore\nto see this option.\nSelect the\nFind a Task\ntab.\nSearch for tasks by typing a word or phrase in the search bar.\nYou can also select a word or phrase from your writing, then use this app action. The selected text will automatically be filled into the search bar.\nThe list of tasks is scoped to recently viewed tasks by the user, which can be from any workspace the user has visibility\nto.\nSelect a task to add a link to the task directly into your text.\nYou can also select the\nCopy\nbutton to copy the task link to the clipboard, or select the\nOpen\nbutton to open the task link in the browser.\nIf you are the Asana administrator, your team members may encounter an error if you turn on the\nRequire app approval\nsetting. You will need to follow these instructions to approve Grammarly:\nApp management and integrations\n.\nFor additional questions about app management for your Asana organization, please reach out to\nAsana Support\n.\nIf you’re not the Asana administrator in your organization and are facing difficulties connecting Asana, here are some suggestions for reaching out to your Asana administrator or IT team:\nAsk your admin to enable app actions\n.\nUnsplash\nAdd an image from Unsplash\nA picture is worth a thousand words. With access to Unsplash’s repository of high-resolution images directly from Grammarly, you can easily enhance your writing with visuals.\nTo add an image from Unsplash, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nAdd an image from Unsplash\n. You may need to select\nMore\nto see this option.\nIf this is your first time using this app action, review the privacy disclosure, then select\nUse Unsplash\n.\nSearch for images by typing a word or phrase in the search bar. You can also select a word or phrase from your writing, then use this app action. The selected text will automatically be filled into the search bar.\nSelect an image to add it directly into your text. You can also click\nCopy\nto add the image to your clipboard.\nGiphy\nFind and insert a GIF from Giphy\nTo enhance your writing with visual flair, you can use Grammarly to search Giphy’s extensive library and quickly add GIFs or stickers into your text.\nTo add a GIF from Giphy, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nAdd a GIF from Giphy\n. You may need to select\nMore\nto see this option.\nIf this is your first time using this app action, review the privacy disclosure, then select\nUse Giphy\n.\nSearch for GIFs or stickers by typing a word or phrase in the search bar. You can also select a word or phrase from your writing, then use this app action. The selected text will automatically be filled into the search bar.\nSelect a GIF or sticker to add it directly into your text. You can also click\nCopy\nto add the GIF or sticker to your clipboard.\nJira\nCreate or find an issue in Jira\nYou can create or find an issue in Jira directly from Grammarly wherever you write—for example, while messaging team members or documenting projects. This saves time and ensures that you have all the issue context at your fingertips.\nCreate an issue in Jira\nTo create an issue in a Jira project, complete the following steps:\nClick the\ngreen lightbulb icon\nnext to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate an issue in Jira\n. You may need to select\nMore\nto see this option.\nIf this is your first time using this app action, you’ll need to connect Grammarly to your Atlassian account.\nAfter reviewing the privacy disclosure, select\nConnect Jira\n.\nOn the next screen, choose an Atlassian account and then select\nAllow\nto authorize Grammarly on the account.\nOnce you’ve connected your Atlassian account, return to\nCreate an issue in Jira\nand select a\nproject\nand\nissue type\n.\nType the\nsummary\nand optionally include details in the description, along with optional markers for the intended parent epic and sprint. Then, select\nCreate issue\n.\nYou’ve created an issue in Jira, without leaving Grammarly! You can now\nInsert\nthe issue into the document, select the\nCopy\nbutton to copy the issue link to clipboard, or select the\nOpen\nbutton to open the file link in the browser.\nFind an issue in Jira\nTo find an issue in a Jira project, complete the following steps:\nClick the\ngreen lightbulb icon\nnext to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate an issue in Jira\n. You may need to select\nMore\nto see this option.\nSelect the\nFind an Issue\ntab.\nSearch for issues by typing a word or phrase in the search bar.\nYou can also select a word or phrase from your writing, then use this app action. The selected text will automatically be filled into the search bar.\nThe list of issues is scoped to recently viewed issues by the user, which can be from any project the user has visibility to.\nThe format of tasks returned in the search results is as follows:\nSelect an issue to add a link to the issue directly into your text. You can also click\nCopy\nto copy the issue link to the clipboard, or click\nOpen\nto open the file link in the browser.\nIf you are the Atlassian administrator, your team members may encounter an error if you turn on the\nRequest feature\nsetting. You will need to approve user requests to use Grammarly.\nMore information can be found a\nt\nManaging user requests for Marketplace apps\n.\nFor\nadditional questions about app management in Atlassian, please reach out to\nAtlassian Support\n.\nIf you’re not the Atlassian administrator in your organization and are facing difficulties connecting Jira, here are some suggestions for reaching out to your Atlassian administrator or IT team:\nAsk your admin to enable app actions\n.\nConfluence\nFind a page in Confluence\nWith the ability to access Confluence from Grammarly, you can quickly find and link to a page while writing.\nTo find a page in Confluence, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nFind a page in Confluence\n. You may need to select\nMore\nto see this option.\nIf this is your first time using this app action, you’ll need to connect Grammarly to your Atlassian account.\nAfter reviewing the privacy disclosure, click\nConnect Confluence\n.\nOn the next screen, choose an Atlassian account and then select\nAllow\nto authorize Grammarly on the account.\nSearch for pages by typing a word or phrase in the search bar.\nYou can also select a word or phrase from your writing, then use this app action. The selected text will automatically be filled into the search bar.\nSelect a page to add a link to the page directly into your text.\nYou can also select the\nCopy\nbutton to add the link to your clipboard, or select the\nOpen\nbutton to open the file in your browser.\nYou can log out of your Atlassian account or switch your account at any time by opening the app actions menu, selecting\nFind a page in Confluence\n, and then selecting\nLog out of Confluence\n.\nIf you are the Atlassian administrator, your team members may encounter an error if you turn on the\nRequest feature\nsetting. You will need to approve user requests to use Grammarly.\nMore information can be found a\nt\nManaging user requests for Marketplace apps\n.\nFor\nadditional questions about app management in Atlassian, please reach out to\nAtlassian Support\n.\nIf you’re not the Atlassian administrator in your organization and are facing difficulties connecting Confluence, here are some suggestions for reaching out to your Atlassian administrator or IT team:\nAsk your admin to enable app actions\n.\nCalendly\nShare your availability via Calendly\nTo make scheduling meetings easier, you can share your Calendly availability wherever you use Grammarly.\nTo share your availability via Calendly, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nShare your availability via Calendly\n. You may need to select\nMore\nto see this option.\nIf this is your first time using this app action, review the privacy disclosure, then select\nConnect Calendly\n.\nOn the next screen, select a method to log in to Calendly.\nNote that this action allows Grammarly to connect to your Calendly account and manage your Calendly events.\nIf successful, you will land on a “Connection successful” confirmation screen.\nSelect an\nevent type\nfrom the drop-down list, then optionally overwrite the default link text.\nOptionally, you can check the box to\nMake link single-use\n. A single-use link expires after someone schedules a meeting with you. If this box is checked, the invitee can’t book time with you again unless you send them a new link.\nYou can now\nInsert\nthe Calendly link into the document, select the\nCopy\nbutton to copy the meeting link to the clipboard, or select the\nOpen\nbutton to open the meeting link in the browser.\nHubSpot\nCreate or find contacts in HubSpot\nWith the ability to work with HubSpot contacts directly from Grammarly, you can quickly create, search for, and link to a CRM record while writing.\nCreate a contact in HubSpot\nTo create a contact in HubSpot, complete the following steps:\nClick the green lightbulb icon next to the Grammarly icon. You may need to hover over the Grammarly icon in order to see this option.\nSelect\nCreate or find a contact in HubSpot.\nYou may need to select\nMore\nto see this option.\nIf this is your first time using this app action, you’ll need to connect Grammarly to your HubSpot account:\nAfter reviewing the privacy disclosure, select\nConnect HubSpot.\nOn the next screen, choose a HubSpot account and then select\nAllow\nto authorize Grammarly on the account.\nOnce you’ve connected your HubSpot account, return to\nCreate or find a contact in HubSpot.\nIn the\nCreate a contact\ntab, type a contact’s email and optionally include other information, such as the contact’s first and last name, job title, and the contact owner. Then, click\nCreate contact.\nYou’ve created a contact in HubSpot, without leaving Grammarly! You can now\nInsert\nthe contact into the document, select the\nCopy link\noption to add the contact link to your clipboard, or select\nOpen in browser\nto view the contact in your browser.\nFind a contact in HubSpot\nTo find a contact in HubSpot, complete the following steps:\nClick the green lightbulb icon next to the Grammarly icon. You may need to hover over the Grammarly icon in order to see this option.\nSelect\nCreate or find a contact in HubSpot.\nYou may need to select\nMore\nto see this option.\nSelect the\nFind a contact\ntab.\nSearch for contacts by typing a word or phrase in the search bar. You can also select a name or email address from your writing and then select this app action. The selected text will automatically be filled into the search bar.\nThe search results will display the contacts in the following format:\nOnce you have located the contact, select it to add a link to the contact directly within your text. You can also select the\nCopy link\noption to copy the contact link to your clipboard or select\nOpen in browser\nto view the contact in your browser.\nIf you are the HubSpot administrator, your team members may encounter an error if you have not authorized Grammarly. To request authorization, your team members will need to follow these steps:\nInstall an app.\nFor any additional questions about connecting third-party apps to HubSpot, please reach out to\nHubSpot Support.\nIf you’re not the HubSpot administrator in your organization and are facing difficulties connecting HubSpot, here are some suggestions for reaching out to your Google administrator or IT team:\nAsk your admin to enable app actions\n.\nMicrosoft 365\nFind a file in Microsoft 365\nWith the ability to access Microsoft 365 from Grammarly, you can quickly find and link to a file while writing.\nTo find a file in Microsoft 365, complete the following steps:\nClick the green lightbulb icon next to the Grammarly icon. You may need to hover over the Grammarly icon in order to see this option.\nSelect\nFind a file in Microsoft 365.\nYou may need to select\nMore\nto see this option.\nIf this is your first time using this app action, you’ll need to connect Grammarly to your Microsoft account:\nAfter reviewing the privacy disclosure, click\nConnect Microsoft 365.\nIf prompted, choose a Microsoft account and then select\nAllow\nto authorize Grammarly on the account.\nSearch for files by typing a word or phrase in the search bar. You can also select a word or phrase from your writing and then select this app action. The selected text will automatically be filled into the search bar.\nSelect a file to add a link to the file directly into the document. You can also select the\nCopy link\noption to add the link to your clipboard or select\nOpen in browser\nto open the file in your browser.\nWhen searching for files, you’ll see your files that are stored on OneDrive and SharePoint.\nYou can log out of your Microsoft account or switch your account at any time by opening the app actions menu, selecting\nFind a file in Microsoft 365,\nand then selecting\n…\n>\nSwitch Microsoft account\n, or\n…\n>\nLog out of Microsoft.\nIf you are the Microsoft 365 administrator, your team members may encounter an error if you have not authorized Grammarly. To authorize Grammarly, you will need to follow these steps:\nReview admin consent requests.\nFor additional questions about connecting third-party apps to Microsoft, please reach out to\nMicrosoft Support.\nIf you’re not the Microsoft 365 administrator in your organization and are facing difficulties connecting Microsoft 365, here are some suggestions for reaching out to your Google administrator or IT team:\nAsk your admin to enable app actions\n.\nSmartsheet\nCreate or find rows in Smartsheet\nTo manage and share your projects more easily, you can create or find Smartsheet tasks (rows) directly from Grammarly wherever you write.\nCreate a row in Smartsheet\nTo create a row in Smartsheet, complete the following steps:\nClick the green lightbulb next to the Grammarly icon. You may need to hover over the Grammarly icon in order to see the lightbulb icon appear.\nSelect\nCreate a row in Smartsheet.\nYou may need to select\nMore\nto see this option.\nIf this is your first time using this app action, you’ll need to connect Grammarly to your Smartsheet account.\nAfter reviewing the privacy disclosure, select\nConnect Smartsheet.\nOn the next screen, choose a Smartsheet account and then select\nAllow\nto authorize Grammarly on the account.\nOnce you’ve connected your Smartsheet account, return to\nCreate a row in Smartsheet\nand select a workspace or folder if prompted. You’ll only need to do this once.\nYou can change your workspace or folder at any time by opening the Smartsheet action and selecting\n…\n>\nChange workspace.\nSelect the sheet, type the row name, and optionally include other details. Then, click\nCreate row.\nYou’ve created a row in Smartsheet, without leaving Grammarly! You can now\nInsert\nthe row link into the document, select the\nCopy link\noption to add the row link to your clipboard, or select\nOpen in browser\nto open the sheet containing the row in your browser.\nFind a row in Smartsheet\nTo find a row in Smartsheet, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate a row in Smartsheet.\nYou may need to select\nMore\nto see this option.\nSelect the\nFind a row tab.\nSearch for rows by typing a word or phrase in the search bar.\nYou can also select a word or phrase from your writing, then use this app action. The selected text will automatically be filled into the search bar.\nThe list of rows is scoped to recently viewed rows by the user, which can be from any workspace or folder the user has visibility to.\nSelect a row to add a link to it directly into your text. You can also select the Copy link option to copy the row link to your clipboard, or select\nOpen in browser\nto open the sheet containing the row in your browser.\nIf you are the Smartsheet administrator, and your team members encounter an error connecting Smartsheet, please reach out to\nSmartsheet Support\nto check if authorization is necessary for your organization.\nIf you’re not the Smartsheet administrator in your organization and are facing difficulties connecting Smartsheet, here are some suggestions for reaching out to your Google administrator or IT team:\nAsk your admin to enable app actions\n.\nmonday.com\nCreate or find items in monday.com\nSeamlessly manage projects by creating new monday.com tasks (items) or linking to existing ones directly from Grammarly.\nConnecting monday.com to Grammarly\nIf this is your first time using this app action, you’ll need to visit\nthis link\nand authorize Grammarly to connect with your monday.com account. Select or add which workspaces you would like to connect, and click\nInstall.\nIf your monday.com account is managed by your organization, the authorization may need to be performed by your monday.com administrator.\nOnce you have authorized Grammarly from the monday.com site, follow these steps within Grammarly to complete the connection:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate an item in monday.com.\nYou may need to select\nMore\nto see this option.\nAfter reviewing the privacy disclosure, select\nConnect monday.com.\nOn the next screen, choose a monday.com account and then select\nAuthorize\nto authorize Grammarly on the account.\nCreate an item in monday.com\nTo create an item in monday.com, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate an item in monday.com.\nYou may need to select\nMore\nto see this option.\nSelect a workspace if prompted. You’ll only need to do this once.\nYou can change your workspace at any time by opening the monday.com action and selecting\n…\n>\nChange workspace.\nSelect a board, type the item name, and optionally include other details. Then, click\nCreate item.\nYou’ve created an item in monday.com, without leaving Grammarly! You can now\nInsert\nthe item link into the document, select the\nCopy link\noption to add the item link to your clipboard, or select\nOpen in browser\nto open the item link in your browser.\nFind an item in monday.com\nTo find an item in monday.com, complete the following steps:\nClick the green lightbulb icon next to the Grammarly button. You may need to hover over the Grammarly button in order to see the lightbulb icon.\nSelect\nCreate an item in monday.com.\nYou may need to select\nMore\nto see this option.\nSelect the\nFind an item tab.\nSearch for items by typing a word or phrase in the search bar.\nYou can also select a word or phrase from your writing, then use this app action. The selected text will automatically be filled into the search bar.\nThe list of items is scoped to recently viewed items by the user, which can be from any workspace the user has visibility to.\nSelect a task to add a link to the task directly into your text.\nYou can also select the\nCopy link\noption to copy the task link to your clipboard, or select\nOpen in browser\nto open the task link in your browser.\nIf you encounter the {\"\"error\":\"invalid_scope\",\"error_description\":\"Invalid scope param\"} error, please ensure that you have authorized Grammarly to connect with your monday.com account by following\nthis link\n.\nIn case your monday.com account is managed by your organization, the authorization may need to be performed by your monday.com administrator. Here are some suggestions for reaching out to your Google administrator or IT team:\nAsk your admin to enable app actions\nIf you are the monday.com administrator, please reach out to\nmonday.com Support\nfor any additional questions about connecting third-party apps to monday.com.\nGrammarly’s translation feature\nThis feature allows you to translate text directly while writing with Grammarly. To learn more, please review this article:\nIntroducing Translate with Grammarly\nIn-product feedback\nYou can share your feedback at any time by navigating to an app action and selecting\n… > Feedback\n.\nYou may also receive a prompt to give feedback after using an app action.\nFrequently asked questions\nWhere can I use the app actions feature?\nThe app actions feature is currently available in\nGrammarly for Windows and Mac\nand in\nGrammarly for Chrome\n.\nIf you’re using a browser different than Google Chrome, please ensure that you are using Grammarly’s desktop app and not attempting to use the app actions feature with the Grammarly browser extension.\nHow do I know if I’m using Grammarly’s desktop application or the Grammarly browser extension?\nTo learn more about Grammarly for Windows and Mac and how it looks, please refer to this article:\nGrammarly for Windows and Grammarly for Mac user guide\n.\nYou can also learn more about temporarily\nturning off the Grammarly browser extension\n.\nWhat do I do if I see a “Connection blocked” screen?\nIf you encounter a “Connection blocked” screen, as shown in the image below, please ensure that your network administrator has added *.grammarly.net to your organization’s allowlist.\nFor more information, please review the following articles:\nNetwork configuration blocks Grammarly services\nWebSockets Support Q&A for System Administrators",
  "category": "Generative AI assistance",
  "tags": []
}