{
  "url": "https://support.grammarly.com/hc/en-us/articles/38717930873229-Grammarly-for-Mac-s-background-processes-overview",
  "scraped_at": "2025-08-11T20:46:01.518023+00:00",
  "title": "Grammarly for Mac's background processes overview",
  "content": "Grammarly for Mac leverages the system’s capabilities to spawn several different background processes. These are sometimes referred to as agents, launch agents, daemons, services, or login items. Below is a list of their purpose, when they run, and related files.\nGrammarly Desktop Helper\nPurpose\nThis helper ensures the stability and performance of the main application by restarting it in the event of a crash or hang. Additionally, it acts as an intermediary in the communication with browsers to integrate with certain websites.\nLifecycle\nThe system service launchd starts this process at login, and restarts it if it gets terminated. This is achieved by using the KeepAlive and RunAtLoad options.\nFiles\n~/Library/LaunchAgents/com.grammarly.ProjectLlama.Shepherd.plist\n/Applications/Grammarly Desktop.app/Contents/Library/LaunchAgents/Grammarly Desktop Helper.app\nGrammarly Desktop Update Service\nPurpose\nThe update service is a secondary update mechanism for the main Grammarly app. It periodically checks for updates released by the Grammarly team in case the primary update mechanism built into the main app fails.\nLifecycle\nThe system service launchd starts this process on startup, and restarts it if it gets terminated. This is achieved by using the KeepAlive and RunAtLoad options. If the service cannot be started by launchd, the main Grammarly app will also launch this process as a regular process (not an agent).\nFiles\n~/Library/LaunchAgents/com.grammarly.ProjectLlama.UpdateService.plist\n~/Library/Application Support/com.grammarly.ProjectLlama/Grammarly Desktop Update Service.app\n/Applications/Grammarly Desktop.app/Contents/Library/LaunchAgents/Grammarly Desktop Update Service.app\nGrammarly Desktop Uninstaller\nPurpose\nThis process detects when the main Grammarly application has been deleted and performs cleanup tasks, such as removing other background processes and their associated files.\nLifecycle\nThe system service launchd starts this process when files are changed in the /Applications directory. The process immediately terminates after checking whether Grammarly has been uninstalled and performing the necessary cleanup actions. This is achieved by using the WatchPaths option.\nFiles\n~/Library/LaunchAgents/com.grammarly.ProjectLlama.Uninstaller.plist\n~/Library/Application Support/com.grammarly.ProjectLlama/Grammarly Desktop Uninstaller.app\n/Applications/Grammarly Desktop.app/Contents/Library/LaunchAgents/Grammarly Desktop Uninstaller.app",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}