{
  "url": "https://support.grammarly.com/hc/en-us/articles/4410365455373-Error-validating-SAML-message",
  "scraped_at": "2025-08-11T20:39:01.415560+00:00",
  "title": "Error validating SAML message",
  "content": "If you see “Error validating SAML message” when setting up SSO or logging in to your account, check the corresponding instructions below.\nError validating SAML message when setting up SSO (Microsoft Entra ID)\nThis error message in Microsoft Entra ID may be caused by a corrupted certificate generated by Microsoft Entra ID.\nWe suggest you try generating a new certificate. To do that, click\nEdit\nnext to\nSAML Signing Certificate\n, and then click\nNew Certificate\nin the window that opens next.\nIf you are locked out of your admin account and experience issues with updating your x.509 certificate, you can sign in bypassing SSO authentication by following the steps below:\nLog in using this link:\nhttps://www.grammarly.com/signin?ssoRedirect=false\nLog in again using this link:\nhttps://www.grammarly.com/signin?ssoRedirect=false&secureLogin=true\nError validating SAML message when setting up SSO (other identity providers)\nThis error indicates that the signature validation of the SAML response from your identity provider was unsuccessful. The SAML response is signed by the identity provider’s private key and is validated on the Grammarly side using the identity provider’s public key. The public key is contained within the certificate (X509) uploaded to Grammarly. We need to ensure it is valid and corresponds to the private key used by the identity provider to sign the SAML response.\nIf you are locked out of your admin account and experience issues with updating your x.509 certificate, you can sign in bypassing SSO authentication by following the steps below:\nLog in using this link:\nhttps://www.grammarly.com/signin?ssoRedirect=false\nLog in again using this link:\nhttps://www.grammarly.com/signin?ssoRedirect=false&secureLogin=true\nSSO might have also been misconfigured on the identity provider side. Please ensure that all attributes, including NameID, are present in the SAML configuration.\nError validating SAML message when trying to log in\nTo log in to your Grammarly account, please launch Grammarly via your identity provider.\nIf you do not see the Grammarly app in your identity provider’s interface, please contact your account administrator directly and ask them to configure SAML single sign-on correctly using the instructions provided in these articles:\nSet up SAML single sign-on\nAdd Grammarly to an identity provider\nError urn:oasis:names:tc:SAML:2.0:status:Responder\nThis error code indicates that the identity provider blocked the authentication because of incorrect or missing user permissions or service provider configuration.\nThis issue is typically caused by SSO-specific information missing in the service provider configuration on the identity provider side.\nWe suggest that you verify all parameters in the configuration, particularly NameID, to ensure they are correct.\nPlease see this article to learn more:\nAdd Grammarly to an identity provider",
  "category": "Resolve Issues",
  "tags": []
}