{
  "url": "https://support.grammarly.com/hc/en-us/articles/360047798371-Error-Grammarly-add-in-has-failed-to-load",
  "scraped_at": "2025-08-11T20:47:08.441781+00:00",
  "title": "Error: Grammarly add-in has failed to load",
  "content": "If you see “Grammarly add-in has failed to load,\" try one of the solutions below:\nNote:\nAt this time, Grammarly doesn’t support documents opened from Microsoft SharePoint. If you see “Grammarly add-in has failed to load” in such documents, please download them from SharePoint and then open using Microsoft Word.\nSolution 1\nInstall Grammarly for all users by following these steps:\nUninstall your current version of the Grammarly add-in via\nControl Panel\n>\nPrograms\nand\nFeatures\n> right-click on\nGrammarly for Microsoft Office Suite\n> select\nUninstall\n.\nIf you use Windows 10:\nRight-click the\nStart\nbutton in the lower left corner of the screen, and select\nApps and Features\non the pop-up menu. Click\nGrammarly for Microsoft Office Suite\n> select\nUninstall\n.\nDownload Grammarly for Microsoft Office at\nhttps://www.grammarly.com/office-addin/downloading\nRight-click the GrammarlyAddInSetup.exe file and choose\nRun as Administrator\n.\nWhen you see the \"Welcome to Grammarly\" window, click\nGet Started\nwhile pressing the Shift and Ctrl keys on your keyboard.\nCheck the\nInstall for all users\noption and click\nNext\n:\nIf you don't see the option to install for all users, please download and run the file attached at the bottom of this article.\nSolution 2\nLog in to Windows as any user that is not an administrator.\nSolution 3\nEnable\nUser Account Control\nby following these steps:\nPress the\nWindows\nkey, type\nUAC\nin the search bar, and press\nEnter\nOnce you open the\nUser Account Control Settings\nwindow, choose any preferred level of security and press\nOK\n.\nSolution 4\nIf the issue persists, please repair Microsoft Office as described\nhere\nand try installing the add-in again.\nIf Grammarly for Microsoft Office doesn’t work after trying these steps, and you’re using Windows 10 or newer, we suggest switching to\nGrammarly for Windows\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.\nAlternatively, you can give\nthe Grammarly Editor\na try. For more information about the Grammarly Editor, visit\nthis page\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}