{
  "url": "https://support.grammarly.com/hc/en-us/articles/4403054674829-Configure-SCIM-provisioning",
  "scraped_at": "2025-08-11T20:36:03.919791+00:00",
  "title": "Configure SCIM provisioning",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nYou can configure System for Cross-domain Identity Management (SCIM) for your Grammarly subscription, which automatically provisions members and groups when they are assigned Grammarly application access at your identity provider if you are using a supported identity provider. The identity providers currently supported for SCIM-based provisioning are Okta, Azure AD, and OneLogin.\nIn order to use SCIM-based provisioning, you must be already using SAML single sign-on (SSO) for user authentication. For more information, please see this article:\nSet up SAML single sign-on\nWhen using SAML SSO, by default your identity provider does not communicate with Grammarly to create members or groups when you assign or unassign users to the application. Grammarly performs just-in-time (JIT) provisioning of the member’s account the first time a member signs in via your identity provider. With the enablement of SCIM-based provisioning, your identity provider will notify Grammarly when users are assigned or unassigned application access.\nWhen you assign application access, your identity provider will communicate with Grammarly to create a member account and send an onboarding email to the user. When you unassign application access, your identity provider will communicate with Grammarly to invalidate any authenticated sessions and deactivate the member’s account. The Grammarly account will be suspended within an hour of receiving the deletion request and permanently deleted within 30 days.\nSupported identity providers\nThe following identity providers can provision or de-provision members of your Grammarly subscription using SCIM:\nOkta\nMicrosoft Entra ID (Azure AD)\nOneLogin\nRippling\nTurning on provisioning with existing members\nIf you already have team members in your Grammarly subscription and you turn on provisioning, a reconciliation process needs to happen. As part of this process, your identity provider will notify Grammarly of all assigned users. Grammarly will reconcile users already invited via a provisioning request from the identity provider and their status will be reflected on the\nMembers\npage. To determine users who haven’t been reconciled with the identity provider, access the\nProvisioning\npage. If there are users who haven’t yet been provisioned by the identity provider, the\nProvisioning\npage will show a warning banner. Click the\nDownload report\nlink to download a CSV file containing the list of members that haven’t yet been provisioned. This report can be used to bulk delete outstanding users, if appropriate, or for manual processing.\nNote:\nFor some identity providers, the step to provision already assigned users may have to be triggered manually. See the identity-provider-specific steps for more information.\nTurning on provisioning for groups\nSCIM can be used to organize team members into groups for select identity providers. This allows you to sync your identity provider group configuration with your Grammarly subscription.\nNote:\nThe SCIM group provisioning support is available for Grammarly Enterprise customers upon request. If you’re interested in enabling this feature, please contact your Customer Success Manager or\nGrammarly Support team\n.\nAssigning a cost center to team members\nSCIM can also be used to define the\nCostCenter\nattribute, which assigns the appropriate cost center to each team member. This information can then be viewed in the Grammarly admin panel.\nNote:\nThe option to view the cost center in the admin panel is available upon request.",
  "category": "SAML Single Sign-On",
  "tags": []
}