{
  "url": "https://support.grammarly.com/hc/en-us/articles/26993719119501-How-can-I-turn-off-the-Grammarly-AI-Does-Grammarly-use-trigger-AI-detectors",
  "scraped_at": "2025-08-11T20:43:03.276459+00:00",
  "title": "How can I turn off the Grammarly AI? Does Grammarly use trigger AI detectors?",
  "content": "The growing use of AI tools has raised concerns about AI plagiarism and prompted the adoption of AI detectors. We'd like to address some of the concerns regarding how Grammarly uses AI and promote ongoing dialogue on this emerging issue.\nThe difference between AI and generative AI\nSince our founding in 2009, Grammarly has been harnessing the power of AI to improve your writing experience. Our foundational AI technology—integrating machine learning, natural language processing, and insights from human linguists—is designed to preserve your unique voice and message while improving your writing through suggestions for spelling, grammar, clarity, conciseness, and tone.\nThis AI technology is integral to the suggestions provided by our product. It does not change the substance of the writing, and it cannot be turned off separately from Grammarly.\nIn 2023, Grammarly introduced\noptional\ngenerative AI features that enable users to\nproduce new content\nbased on their inputs or prompts. This advancement reflects our ongoing commitment to supporting every phase of communication, from initial brainstorming to final draft.\nThese features are not turned on by default; they’re available\non-demand\n, and users have full control over when and how to use them. These features can generate content and meaningfully change writing. Any user can turn off generative AI in the\nFeature customization tab\nin their account settings. For more information, refer to this guide:\nIntroducing generative AI assistance\n.\nThe challenges of identifying AI-generated text\nAs the prevalence of AI tools grows, the landscape of AI detection tools is also evolving. While AI detectors can help assess whether text appears AI-generated, none today can reliably and conclusively determine whether AI was used to produce text. These tools should be considered\na single data point\nrather than the sole source of evidence when investigating AI use and highlight the need for a nuanced understanding of how AI use fits into an organization’s academic or professional standards.\nWe recommend combining automatic AI detection with manual review, and encourage writers to track their writing process with\nGrammarly Authorship\nand\nprovide proper attribution\nwhen they use AI.\nLooking to the future, we see an opportunity for a collaborative dialogue among educators, professionals, and technology providers. We aim to contribute to developing clear guidelines that promote the responsible use of AI. Find more details in the resources linked below:\nAre AI Detectors Accurate? Understanding Their Limitations\nGrammarly Authorship Just Got a Major Update: Here’s What It Means for Students and Instructors\nFrom AI Detection to Authorship: How Grammarly Empowers Responsible AI Use",
  "category": "Common Questions",
  "tags": []
}