{
  "url": "https://support.grammarly.com/hc/en-us/articles/4403227105549-What-certifications-and-attestations-has-Grammarly-obtained",
  "scraped_at": "2025-08-11T20:39:42.789958+00:00",
  "title": "What certifications and attestations has Grammarly obtained?",
  "content": "SOC 2\nGrammarly has successfully completed SOC 2 (Type 1) and SOC 2 (Type 2) examinations and received corresponding reports. These examinations validate that Grammarly meets the strict SOC 2 standards for security, availability, confidentiality, and privacy of our customers’ data.\nSOC 3\nGrammarly’s SOC 3 report is a publicly available version of the SOC 2 (Type 2) report. To learn more, view the\nSystem and Organization Controls (SOC 3) Report\n.\nISO/IEC 27001:2013\nThis is an international standard for information security management systems. Obtaining this certification confirms that Grammarly meets industry-standard requirements for establishing, implementing, maintaining, and continually improving an information security management system. You can view\nGrammarly’s ISO 27001 certificate\n.\nISO/IEC 27017:2015\nThis certification sets forth security requirements for cloud service providers and customers. It shows that Grammarly adheres to industry standards concerning the provision and use of cloud services. You can view\nGrammarly’s ISO 27017 certificate\n.\nISO/IEC 27018:2019\nThis international standard covers the protection of users’ personal information. Grammarly meeting this standard demonstrates our commitment to safeguarding your data. You can view\nGrammarly’s ISO 27018 certificate\n.\nISO/IEC 27701:2019\nThis certification verifies that Grammarly\nmeets industry-standard requirements for privacy information management. You can\nview\nGrammarly’s ISO 27701 certificate\n.\nPCI DSS\nGrammarly is compliant with the Payment Card Industry Data Security Standard.\nGrammarly’s attestation\nconfirms that your payment information is protected in accordance with industry standards.\nHIPAA\nThe Health Insurance Portability and Accountability Act of 1996 establishes a set of standards to protect sensitive health information. Grammarly is compliant with HIPAA Security, Privacy, and Breach Notification rules.\nIf you need to sign a BAA in order to comply with HIPAA, please be aware that currently we can enter into BAAs only for volume licenses of 100 seats or more. This limitation allows us to process these requests promptly and efficiently. We are looking to optimize this process as we ramp up HIPAA support for our other customers. If you are interested in a license of 100 seats or more, please submit your request\nby contacting us\n.\nCloud Security Alliance\nThe Cloud Security Alliance is a nonprofit organization with the goal of promoting best practices in relation to cloud computing. Grammarly is a CSA-Trusted Cloud Provider and has completed the\nConsensus Assessment Initiative Questionnaire\nto represent our security controls.\nCCPA\nGrammarly complies with the California Consumer Privacy Act (CCPA). You are welcome to review our\nPrivacy Policy\nfor more information.\nFERPA\nGrammarly is compliant with the Family Educational Rights & Privacy Act (FERPA). If you’d like to review our EDU addenda please\ncontact us\n.\nNYS Education Law 2-d\nGrammarly is compliant with the New York State Education Law 2-d. If you’d like to review our EDU addenda please\ncontact us\n.",
  "category": "Privacy and Security",
  "tags": []
}