{
  "url": "https://support.grammarly.com/hc/en-us/articles/33885668963469-Enterprise-domain-controls-for-new-signups-and-existing-users",
  "scraped_at": "2025-08-11T20:33:02.741246+00:00",
  "title": "Enterprise domain controls for new signups and existing users",
  "content": "Included in:\nGrammarly Enterprise plans.\nPlease contact your Customer Success Manager to enable these controls.\nGrammarly’s Enterprise-tier licenses equip administrators with robust internal controls to manage user access, ensure compliance with licensing agreements, and improve security. These features provide new user sign-up controls leveraging organizational email domains, as well as service provider-initiated sign-in options and in-product messaging for individual Grammarly Free, Premium, and Pro users who share the same domain.\nThe solutions described in this article require configuring SAML single sign-on beforehand. If you haven’t done so yet, please\nset up SAML single sign-on\n.\nTopics covered in this article:\nControlling New User Signups\nDomain Verification\nManaging Existing Users\nDomain Capture\nInvite Capture\nControlling New User Signups\nDomain Verification\nDomain verification changes the account creation flow for new users visiting Grammarly for the first time. Once an email domain has been verified by Grammarly, the following will happen:\nAll new users creating accounts at\nwww.grammarly.com/signup\nwith a matching email domain will be routed to your organization’s SSO login page.\nIndividuals who have not been granted access to Grammarly in an identity provider will not be able to create Grammarly accounts using their work email addresses.\nIndividuals who have been granted access to Grammarly in an identity provider will have Grammarly accounts automatically created for them and will instantly join your Grammarly license.\nThis process ensures that:\nAll employees access the correct enterprise license.\nThere are no individuals inadvertently creating personal Grammarly accounts using their work email addresses.\nOnly those who have been granted access to Grammarly in an identity provider can join your Grammarly license.\nYou can restrict domains that should not be used for user registrations.\nNote:\nIf your company uses both top-level domains and subdomains, they will need to be verified independently. For example, verifying the email domain @acme.com will not affect individuals with the @marketing.acme.com email address. You can selectively apply these settings per domain.\nManaging Existing Users\nThe functionality described below allows Enterprise account owners to enable in-app messaging for Grammarly’s existing user base, offering individuals with matching email domains the option to either join the Enterprise license or change their Grammarly account email address to a personal one.\nDomain verification described above is a prerequisite to continue with either Domain Capture or Invite Capture.\nDomain Capture\nDomain capture enables a requirement for all users with a matching email domain to either join the Enterprise license or change the email address associated with their Grammarly account. They will not be able to continue using Grammarly and will receive an in-product notification with the options detailed below:\nIf an individual had a personal Grammarly Pro or Premium subscription before joining the Enterprise license, their subscription will be paused for the duration of their membership. They will have the option to request a prorated refund on their\nSubscription\npage.\nThese settings will come into effect the next time the end user signs in to Grammarly.\nInvite Capture\nInvite capture differs from Domain Capture in that it impacts only\nthose invited to the license\n, not everyone with the corresponding email domain.\nOrganizations not utilizing SSO can also leverage invite capture to prompt invited members to join their organizational license.\nThese settings will come into effect the next time the end user signs in to Grammarly.\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nRelated articles\nSet up SAML single sign-on\nManage domain controls\nConfigure Managed Mode",
  "category": "Manage Members & Permissions",
  "tags": []
}