{
  "url": "https://support.grammarly.com/hc/en-us/articles/360043832652-Create-style-rules",
  "scraped_at": "2025-08-11T20:31:36.611987+00:00",
  "title": "Create style rules",
  "content": "Included in:\nGrammarly Pro, Business, and Enterprise plans\nManaged by:\nAdmins, account managers, group managers, and members with designated custom roles\nThe\nstyle rules\nfeature allows you to create custom rules around the proper use, spelling, and formatting of specific words, terms, and phrases in order to ensure teamwide consistency.\nTopics covered in this article:\nGetting started\nHow to add style rules in bulk\nExample style rules\nHow do I assign team members to a style rule set?\nCan I create multiple style rule sets?\nCan I see how often the style rules are being used?\nHow can I change the style guide logo?\nCan I limit the style rules to certain websites?\nHow do I activate or deactivate a style rule set?\nHow do I duplicate a style rule set?\nHow do I delete a style rule set?\nHow do I come up with new style rules?\nWhat access do team members with different roles have?\nGetting started\nTo create style rules, go to the\nStyle Rule Sets\npage and click\nCreate rule set\nin the upper-right corner.\nIn the window that appears, enter the rule set name, assign it to anyone in your organization or to team members in specific groups, and click\nSave.\nClick on the style rule set you created.\nYou can add new rules one by one by clicking\nAdd rule\nin the upper-right corner of the page or upload several rules at once by clicking\nImport list\n:\nTo get a better understanding of how it works, we suggest you start by clicking\nAdd rule\n. Here you will see the three parts that make up a rule:\nOriginal text\n— an incorrectly spelled word or phrase that you’d like to change (Tip: you can press\nTab\nto enter several instances).\nRule\ntext\n— a substitute for the original text. Leave this field empty if there is no substitute for the original text.\nExplanation\n- some context for your team to understand the suggestion.\nAdditionally, you can configure the formatting options and add related materials. To learn more, check out this article:\nIntroducing extended style rules functionality\nOnce the necessary fields are filled out, click\nSave\nto add the new rule to your style rule set.\nThat’s it! Your team members will now see suggestions from the style rule set as they type:\nNote:\nStyle rule suggestions are not available in the\nGrammarly Keyboard\nat this time.\nHow to add style rules in bulk\nYou can upload style rules as a CSV or Excel file by following these steps:\nGo to the\nStyle Rule Sets\npage, click on an existing style rule set, or click\nCreate rule set\nin the upper-right corner to create a new one.\nClick\nImport list\nin the upper-right corner of the page, and click\nDownload CSV\n.\nOpen the downloaded file and add your style rules to it. It is important to keep the original formatting of the file intact.\nGo back to the previous window and click\nNext\n.\nClick\nChoose file\nand select the file with your style rules.\nClick\nImport rules\n.\nNote:\nIf you’re having trouble uploading the file, please make sure that it does not contain non-English characters and try again.\nExample style rules\nThese are some example categories of style rules:\nProduct or company names\nOriginal text\nChange to\nExplanation of the rule\nAcmeco\nAcmeCo\nThis is the preferred spelling of our company name.\nAlways capitalized (or lowercase) terms\nArtificial Intelligence\nartificial intelligence\nIf you spell out artificial intelligence, don’t capitalize the a and i.\nAbbreviations\nML\nmachine learning\nAlways spell out machine learning.\n&\nand\nAlways spell out and.\nBTW, btw\nby the way\nAvoid using abbreviations in correspondence with the clients\nJargon to avoid\nsynergy, synergies\nThis term doesn’t resonate with customers. Avoid in public-facing material.\nTerms with specific uses\nsmartphone, smartphones\nUse “smartphone” only when talking about phones specifically. When talking about phones and tablets, use “mobile device.”\nPreferred terminology\nemployee\nteam member\n“Team member” is our preferred term\nemployees\nteam members\n“Team member” is our preferred term\nHow do I assign team members to a style rule set?\nGo to the\nStyle Rule Sets\npage\n, click on the three dots\n⋮\nicon\nnext to the corresponding style rule set, and select\nSettings\n.\nClick on\nAnyone in the selected groups\n, select a user group you wish to assign to the style rule set, and click\nSave\n. You can also choose\nAnyone in my organization\nto assign the style rule set to all team members.\nNote:\nA single user group can have multiple style rule sets assigned to it. If you assign another style rule set to a group that already has one assigned to it, they will be getting suggestions from both style rule sets.\nCan I create multiple style rule sets?\nNote:\nMultiple style rule sets are not included in Grammarly Pro plans. Members of Grammarly Pro plans can create one style rule set.\nMembers of Grammarly Business plans can create up to 50 style rule sets. To create additional style rule sets, follow these steps:\nGo to the\nStyle Rule Sets\npage\nand click\nCreate Rule Set\nin the upper-right corner.\nIn the window that appears next, enter the name of the style rule set, assign it to a user group or to your whole organization, and click Save.\nCan I see how often the style rules are being used?\nTo check the number of times each style rule was viewed, accepted, and dismissed, go to the\nStyle Rule Sets\npage, click on a style rule set,\nand click on a specific rule. These metrics are also shown under the\nViewed\nand\nAccepted\ncolumns on the style rule set page.\nCan I change the style guide logo?\nThe style guide logo appears on the suggestion cards from all style rule sets. To upload your custom image, go to the\nStyle Rule Sets\npage and click on the logo\nto the left of\nStyle Rule Sets\n.\nCan I limit the style rules to certain websites?\nYou can specify a list of URLs where you’d like the style rule suggestions to appear. You may find this useful if your style rules are geared toward external communication (for example, writing publicly on LinkedIn) but less important for internal communication (for example, Slack messages).\nTo create an allowed list, follow these steps:\nGo to the\nStyle Rule Sets\npage and click on a style rule set.\nOn the next page, click on the three dots\n⋮\nicon in the upper-right corner and choose\nSettings\n:\nUnder\nShow suggestions for this rule set on:\n, add the URLs of the websites where you would like your style rule suggestions to appear and confirm the selection by clicking\nSave\n. On all other websites, style rule suggestions will be hidden unless the user clicks the Grammarly widget in the lower-right corner of the text field.\nFormatting tips:\ngoogle.com (no “www”)\n:\nUse this format to include all associated URLs, including www.google.com, mail.google.com, docs.google.com, etc.\ndocs.google.com:\nUse this format to include only the page found at a specific URL.\nHow do I activate or deactivate a style rule set?\nGo to the\nStyle Rule Sets\npage, click on the three dots\n⋮\nicon next to the corresponding style rule set, and click\nDeactivate\nor\nActivate\n.\nA corresponding tag will appear next to a style rule set if it’s inactive.\nHow do I duplicate a style rule set?\nGo to the\nStyle Rule Sets\npage, click on the three dots\n⋮\nicon next to the corresponding style rule set, and click\nDuplicate\n.\nHow do I delete a style rule set?\nGo to the\nStyle Rule Sets\npage, click on the three dots\n⋮\nicon next to the corresponding style rule set, and click\nDelete\n.\nHow do I come up with new style rules?\nTake a moment to brainstorm some common writing issues among your team members. These might include customer or product names that are often miswritten, special terms that get used incorrectly, or words that your company prefers not to use.\nWhen you specify the original text, consider adding a few versions of it if your team tends to miswrite it in different ways.\nWhen setting up a new style rule, be sure to account for all forms of the word or phrase, including plurals and different tenses.\nAs you and your team begin interacting with the suggestions generated by your style rules, you’ll likely want to make adjustments. You can change, add, or delete a style rule at any time.\nWhat access do team members with different roles have?\nTeam members with the\nadmin\nor\naccount manager\nroles have editing permissions for all style rules functionality: they can create, edit, or remove style rules assigned to the whole organization, or to specific groups. They can also see statistics associated with any existing style rule.\nTeam members with the\ngroup manager\npermissions can create and edit only the style rule sets assigned to the user group they have permissions to manage. Group managers can view the style rules assigned to other groups or to the whole organization but can’t make any changes to them. They also won’t see any statistics associated with the style rules that are not applicable to their groups. Group managers can duplicate any existing style rule set. However, it can be assigned only to the user group they have permissions to manage.\nNote:\nThe group manager permissions are available only to Grammarly Enterprise customers.\nIf you’re a Grammarly Enterprise admin, you can also create a\ncustom role\nfor individuals who need to manage company-wide style rules or define organizational brand tones without unnecessary admin permissions to manage groups or see the team’s analytics. To learn more, check out this article:\nAbout custom roles\nTeam members with the\nuser\nrole can view the style rules assigned to them but can’t make any changes. They also won’t see any statistics associated with the style rules.",
  "category": "Team Features",
  "tags": []
}