{
  "url": "https://support.grammarly.com/hc/en-us/articles/5806184637325-Error-Can-t-connect-to-Grammarly-or-Something-went-wrong",
  "scraped_at": "2025-08-11T20:35:28.823307+00:00",
  "title": "Error: Can't connect to Grammarly or Something went wrong",
  "content": "Important:\nSometimes, this issue can be solved by simply restarting your computer. Make sure that you do so before proceeding to the steps below.\nThe error message “Something went wrong” or a gray Grammarly widget is usually caused by restrictions within your network, VPN, proxy, or firewall settings.\nTo resolve this, you need to ensure that your network, firewall, VPN, or proxy allows access to the following internet addresses:\n*.grammarly.com (ports 80 and 443)\n*.grammarly.io (ports 80 and 443)\n*.grammarly.net (ports 80 and 443)\nYou or your IT administrator may need to add exception rules for the above addresses to your network, firewall, VPN, or proxy settings.\nAdditionally, Grammarly apps use WebSockets to communicate with our servers, with the corresponding ports of 80 and 443. Besides allowing the URLs mentioned above, you need to ensure that your network, VPN, firewall, or proxy fully supports the WebSocket protocol. You can read more about WebSocket support in this article:\nWebSockets Support Q&A for System Administrators\n.\nIf this doesn’t help, we recommend the following troubleshooting steps, depending on your operating system (Mac or Windows):\nWindows\nTry switching off the\nSmartScreen\nfor Microsoft Edge\n: open\nWindows Security\n, select\nApp & Browser\ncontrol\n>\nReputation-based protection\nsettings\n, and turn off\nSmartScreen for Microsoft Edge\n. This feature may be blocking the pop-up necessary for the Grammarly assistant window to function correctly:\nReinstall Microsoft Edge WebView from the following page:\nMicrosoft Edge Developer | Microsoft Edge WebView2\n. Download the Evergreen Bootstrapper version by scrolling down the page and selecting\nDownload\nunder\nEvergreen Bootstrapper\n. Then, run the downloaded file with administrator rights by double-clicking it and selecting\nRun as administrator\n.\nIf you experience this issue specifically in Microsoft Word, it may be caused by Copilot. If you use a personal or family Microsoft Office account, please try turning that feature off: Go to\nFile\n>\nOptions\n>\nCopilot\nand uncheck the\nEnable Copilot\nbox; select\nOK\n, and then restart Microsoft Word.\nIf none of the above suggestions help, please submit a support request here:\nContact Support\n. To expedite the resolution of the issue, we recommend that you retrieve and attach the Grammarly for Windows logs and a video recorded while retrieving them.\nMac\nThe root cause of this issue may depend on the app where you’re using Grammarly.\nIf the issue occurs in\nMicrosoft Word\n:\nPossible root cause:\nCopilot is enabled in Microsoft Word. If you can turn off Copilot while using Grammarly, it should resolve the issue.\nHow to troubleshoot:\nIf you use a family or personal Microsoft 365 subscription, check out this Microsoft Support article:\nHow to turn off Copilot in Microsoft 365 Family and Personal subscriptions\n.\nIf your Microsoft 365 license is provided by your organization, you can reach out to your IT administrator and refer them to these articles:\nManage Microsoft 365 Copilot settings in the Microsoft 365 admin center\n,\nManage Copilot agents in Integrated Apps - Microsoft 365 admin\n.\nPossible root cause:\nTrack Changes mode is enabled in the document with markup and comments.\nHow to troubleshoot:\nSwitch to the\nOriginal\nsetting in the\nReview\ntab:\nPossible root cause:\nThe document contains over 200 pages.\nHow to troubleshoot:\nTry splitting the document into 100-page sections to check if the issue persists.\nIf the issue occurs in\nMicrosoft Teams\n:\nPossible root cause:\nThe error may occur after removing an image from the text.\nHow to troubleshoot:\nSelect the entire text and perform the cut-and-paste action.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}