{
  "url": "https://support.grammarly.com/hc/en-us/articles/7145206934029-How-to-collect-error-logs-in-Grammarly-for-Windows-and-Mac",
  "scraped_at": "2025-08-11T20:40:59.633149+00:00",
  "title": "How to collect error logs in Grammarly for Windows and Mac",
  "content": "Error logs are typically requested by our Support team when there is a technical issue with Grammarly for Windows and Mac. If you experience a technical issue, please check out the\nResolve Issues\nsection of our Support site first.\nNote:\nPlease also ensure you record a full-screen video of the issue you’re experiencing\nwhile collecting the logs\nby following these instructions:\nHow to record a video of a technical issue I’m experiencing\n. Even a smartphone video will work!\nIf you're experiencing an issue with accessing your account, please continue to follow these steps anyway as Grammarly for Windows logs can still be collected.\nWindows\nExit the app that's causing the issue.\nFind and click on the Grammarly icon in the system tray and select\nStart Collecting Logs\n:\nOpen the app or website where the issue occurs and type a few words or sentences to reproduce that issue.\nGo back to the service window and select\nStop Collecting Logs\n:\nThe Grammarly log folder will open automatically. Send the _GrammarlyLogs file to us in a support ticket.\nNote:\nThe Grammarly.Desktop.txt file may contain the text you've typed or the name of the application you've opened. We recommend that you do not type sensitive information while logs are enabled.\nmacOS\nFirst, you will need to turn on logging for Grammarly for Mac:\nStart recording your Mac screen by pressing\nCommand\n+\nShift\n+\n5\n, selecting\nRecord Entire Screen\nand pressing\nRecord\n.\nQuit Grammarly for Mac by clicking on the Grammarly button in the menu bar and selecting\nQuit:\nOpen the Terminal application on your Mac. You can quickly locate the Terminal application by pressing\nCmd\n+\nSpace\non your keyboard and using the Spotlight search.\nCopy and paste the following string into the Terminal app and press\nEnter:\ndefaults write com.grammarly.ProjectLlama LogVerbosity -int 5\nLaunch\nGrammarly Desktop\nand try to reproduce the issue that you have been encountering in the app or on the website where it occurs.\nDeactivate logging:\nQuit Grammarly for Mac by clicking the Grammarly button in the menu bar and selecting\nQuit\n.\nOpen the Terminal application, copy and paste the following string, and press\nEnter\n:\ndefaults delete com.grammarly.ProjectLlama LogVerbosity\nFinish the recording by clicking\nStop Recording\n(\n) in the upper-right corner of your screen.\nShare the video you recorded with\nour Support team\nand specify the time and date when you tried to reproduce the issue.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}