{
  "url": "https://support.grammarly.com/hc/en-us/articles/10017919817869-How-to-reinstall-the-Grammarly-browser-extension",
  "scraped_at": "2025-08-11T20:42:46.680886+00:00",
  "title": "How to reinstall the Grammarly browser extension",
  "content": "Chrome\nSafari\nFirefox\nEdge\nFirst, uninstall Grammarly for Chrome by right-clicking on the Grammarly icon in the Chrome toolbar and selecting\nRemove from Chrome\n.\nThen, open Google Chrome and visit the\nChrome Store\nto install the Grammarly browser extension. Click\nAdd to Chrome\nto start the download.\nFirst, uninstall the Grammarly browser extension by following these steps:\nNavigate to\nabout:addons\nand select the\nExtensions\npanel.\nSelect\nGrammarly\n.\nClick the\nRemove\nbutton.\nClick\nRestart now\nif it pops up. Your tabs will be saved and restored after the restart.\nThen, open Firefox and visit the Firefox Add-ons\npage\nto install the Grammarly browser extension. Click\nAdd to Firefox\nto start the download.\nFirst, uninstall the extension:\nGo to\nFinder\n>\nApplications\n>\nGrammarly for Safari\n.\nClick Grammarly for Safari and select\nMove to Trash\nfrom the dropdown menu. Alternatively, you can drag and drop the app to\nTrash\n.\nIf prompted, enter the password to your computer to confirm the deletion.\nNote:\nBefore uninstalling the app, please make sure that Grammarly for Safari is not running. If the app is running, right-click the Grammarly icon on the dock and select\nQuit\n.\nThen, click\nthis link\nto open the Apple App Store and install the Grammarly browser extension. Click\nGet\n>\nInstall\nto start the download. When the download is finished, click\nOpen\n.\nFirst, uninstall the extension by following these steps:\nNavigate to your browser's menu and select the\nExtensions\npanel.\nClick\nGrammarly for Microsoft Edge\n.\nSelect\nUninstall\n.\nOnce that's done, add Grammarly’s browser extension to Microsoft Edge, please click\nthis link\n. Then, click\nGet\n, and then press\nAdd Extension\n:\nAfter you have downloaded and installed Grammarly for Microsoft Edge, you should be able to use it as you write online.",
  "category": "Grammarly Browser Extension",
  "tags": []
}