{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000089932-I-need-to-change-my-email-address",
  "scraped_at": "2025-08-11T20:32:25.764330+00:00",
  "title": "I need to change my email address",
  "content": "The email address you use when signing up for Grammarly is where we’ll send important emails like password resets, so we encourage you to keep it up to date.\nYou can change the email associated with your Grammarly account by following these steps:\nGo to your\nProfile\npage\nand c\nlick\nUpdate\nnext to\nEmail\n.\nIf prompted, enter the verification code sent to your email address. If you cannot access your email inbox, please refer to this article:\nI can't access my email address to verify my account\nIn the window that appears next, enter your new email address and click\nUpdate\n. If your new email address is associated with an existing account, it is required to delete the other account first. For more information, please see this article:\nChanging your email to an email that already exists\nClick the link in the confirmation email sent to your new email address to confirm the change.\nNote:\nIf you registered using Google, Facebook, or Apple, you must set a password for your account to enable the email change option. To do that, follow the steps from this article:\nHow do I set a password if I registered using Google, Facebook, or Apple?\nIf you are a member of an organizational subscription, your account needs to be temporarily removed from the subscription to unlock the email change option, and then invited back using the new email address. Please contact your account administrator for further assistance. Their contact information is available on the\nSubscription\npage.\nI haven’t received a confirmation email\nYou should receive a confirmation email from Grammarly shortly after you update your email address. If you’re not receiving it, try the following:\nCheck your spam or junk folder and any other tabs in your new email inbox.\nOpen your Grammarly account settings and check for typos in the new email address. If the address is incorrect, you can change it by following the steps above.\nAdd the following email addresses to your email contact list and try updating your email address again:\nhello@info.grammarly.com\nhello@mail.grammarly.com\nhello@notification.grammarly.com\nImportant!\nWe recommend setting up a recovery email for your account in case you ever lose access to your email address. To do that, follow the steps from this article:\nSetting up and using a recovery email for your Grammarly account\nRelated articles\nChanging your email to an email that already exists\nHow do I set a password if I registered using Google, Facebook, or Apple?\nI can't access my email address to verify my account\nSetting up and using a recovery email for your Grammarly account",
  "category": "Update Your Account",
  "tags": []
}