{
  "url": "https://support.grammarly.com/hc/en-us/articles/11226802974477-Review-member-usage-analytics",
  "scraped_at": "2025-08-11T20:38:44.157723+00:00",
  "title": "Review member usage analytics",
  "content": "Included in:\nGrammarly Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins, account managers, group managers, and members with designated custom roles\nThe\nMember usage\npage allows you to see who is actively using Grammarly. This data can help you:\nUnderstand product adoption among team members as you onboard your organization to Grammarly.\nBetter manage license allocation by removing inactive team members or expanding access for teams with higher usage.\nGet a pulse on your team’s usage activity over time and see whether it has improved or needs attention.\nNote:\nThis is currently a beta feature. Please\nreach out to Grammarly Support\nor your Customer Success Manager to provide feedback.\nTopics covered in this article:\nWhat’s new?\nWhat is available?\nHow can I download this data?\nCan I turn off member usage analytics?\nWhat’s new?\nThe\nWriting Sessions Improved\nchart has been replaced with the new\nGrammarly Usage Summary\nchart, which shows a breakdown of Grammarly usage within your organization. For more information about this chart, please review the\nWhat’s new?\nsection in this article:\nAnalyze my team’s writing performance\nThe\nWriting Sessions Improved\nchart is still available on\nTeam overview\npage.\nWhat is available?\nTeam members with the admin and account manager roles, as well as team members with the group manager permissions, can see which team members are using Grammarly and information about their usage.\nTeam members with the admin or account manager roles can filter for and view usage data for any of the existing user groups, while team members with the group manager permissions can only view the data of the specific user groups they have permission to manage.\nGrammarly Enterprise admins can create a custom role that grants permissions to manage the organization’s analytics (view, filter, and export team or individual usage data), but without full admin privileges. You can learn more in this article:\nAbout custom roles\nNote:\nThe group manager permissions and custom roles are available only to Grammarly Enterprise customers.\nThe table under the\nGrammarly Usage Summary\nchart displays the list of your team members and their usage data.\nColumns\nName:\nTeam member’s name\nEmail:\nTeam member’s email address\nDays Active:\nThe number of days a team member was actively using Grammarly during the selected date range\nWriting Sessions:\nThe number of writing sessions that took place during the selected date range. A writing session occurs when a team member uses Grammarly to actively write or edit text. A session automatically ends after 30 minutes of inactivity.\nNote:\nWriting sessions do not reflect a user’s productivity or quality of work because everyone’s working style is different. Some team members may write for long stretches of time, while others may break up their writing time. This data is available to help put the\nSessions Improved\nvalue in perspective.\nSessions Improved\n: The percentage of writing sessions that were improved out of writing sessions that had at least one error and took place during the selected date range. A writing session is considered improved if there are fewer mistakes in the text at the end of a session than at the beginning.\nNote:\nThe\nSessions Improved\nstatistic is not reflective of a team member’s writing ability. It’s intended to help you understand which team members get the most value out of Grammarly. If a team member has a low percentage of improved sessions, it may mean that they had fewer writing issues identified by Grammarly during the selected time period.\nHow can I download this data?\nTo download the member usage data in a CSV file, click\nExport\nin the upper-right corner of the table.\nCan I turn off member usage analytics?\nTeam members with the admin role or a designated custom role can turn off this feature for the entire team on the\nFeature access\npage by switching the toggle next to\nIndividual usage analytics\n:",
  "category": "Team Features",
  "tags": []
}