{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000091472-What-is-document-domain-and-how-do-I-change-it",
  "scraped_at": "2025-08-11T20:36:57.896106+00:00",
  "title": "What is document domain, and how do I change it?",
  "content": "Note:\nDocument domains are available with Grammarly Pro, Grammarly Premium, Grammarly Business, and Grammarly for Education.\nAbout domains\nYou can select the style of the document that best corresponds to the type of writing you are checking in order to get the most accurate and relevant suggestions. Grammarly offers six document domains:\nGeneral\nAcademic\nBusiness\nEmail\nCreative\nCasual\nGeneral\nis a good one to start with if you are unsure about which style to pick.\nAll the styles apply most of Grammarly’s spelling, grammar, and punctuation checks. Below is a list that details the variations among the styles, from most to least formal:\nAcademic\nAcademic is the strictest style of writing. On top of catching grammar and punctuation issues, Grammarly will make suggestions around passive voice, contractions, and informal pronouns (I, you), and will point out unclear antecedents (e.g., sentences starting with “This is…”).\nBusiness\nThe business style setting checks the text against formal writing criteria. However, unlike the Academic domain, it allows the use of some informal expressions, informal pronouns, and unclear antecedents.\nGeneral\nThis is the default style and uses a medium level of strictness.\nEmail\nThe email genre is similar to the General domain and helps ensure that your email communication is engaging. In addition to catching grammar, spelling, and punctuation mistakes, Grammarly also points out the use of overly direct language that may sound harsh to a reader.\nCasual\nCasual is designed for informal types of writing and ignores most style issues. It does not flag contractions, passive voice, informal pronouns, who-versus-whom usage, split infinitives, or run-on sentences. This style is suitable for personal communication.\nCreative\nThis is the most permissive style. It catches grammar, punctuation, and spelling mistakes but allows some leeway for those who want to intentionally bend grammar rules to achieve certain effects. Creative doesn’t flag sentence fragments (missing subjects or verbs), wordy sentences, colloquialisms, informal pronouns, passive voice, incomplete comparisons, or run-on sentences.\nChanging domains\nTo change your document domain in the Grammarly Editor, click\nGoals\n. In the window that opens next, select the corresponding domain option:\nYou can also get customized suggestions by selecting the Intent, Audience, and Formality.\nFor more information about the goals feature, visit\nthis page\n.",
  "category": "Grammarly Editor (classic)",
  "tags": []
}