{
  "url": "https://support.grammarly.com/hc/en-us/articles/24058745495053-Error-Grammarly-is-temporarily-unavailable-There-is-an-issue-connecting-to-your-organization-security-settings",
  "scraped_at": "2025-08-11T20:39:57.028034+00:00",
  "title": "Error: \"Grammarly is temporarily unavailable. There is an issue connecting to your organization security settings.\"",
  "content": "Note:\nThis issue may occur if you're using an outdated version of Grammarly for Windows or Mac. To resolve it, please follow the instructions in this article to reinstall the application:\nHow do I reinstall Grammarly for Mac or Grammarly for Windows\n?\nThis error message may indicate temporary connection issues and typically resolves on its own.\nIf you continue to see the error message, please check if your internet connection is stable. In addition, we recommend reconnecting to Wi-Fi or restarting the Wi-Fi router.\nIf the issue persists, please try logging out of Grammarly for Windows and Mac, restarting it, and logging in again:\nWindows\nRight-click on the Grammarly icon in the system tray in the lower-right corner of your screen and select\nSettings.\nUnder the\nAccount\ntab, click\nSign out.\nOnce you have signed out, please click the Grammarly icon again and select\nQuit\nGrammarly.\nOpen the\nStart\nmenu, type \"Grammarly,\" and launch the Grammarly app. Alternatively, please double-click the Grammarly thumbnail on your desktop.\nIn the window that opens next, click\nSign in.\nThis will take you to the login page, where you can enter your account login credentials.\nmacOS\nClick on the Grammarly icon in the menu bar at the top of your screen and select\nSettings.\nUnder the\nAccount\ntab, click\nSign\nout.\nOnce you have signed out, please click the Grammarly icon again and select\nQuit.\nOpen Launchpad and select\nGrammarly Desktop.\nAlternatively, please click on\nFinder,\nselect\nApplications\nin the sidebar, and double-click on\nGrammarly Desktop.\nIn the window that opens next, click\nSign in.\nThis will take you to the login page, where you can enter your account login credentials.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}