{
  "url": "https://support.grammarly.com/hc/en-us/articles/360041953832-Known-issues-on-websites",
  "scraped_at": "2025-08-11T20:37:19.218227+00:00",
  "title": "Known issues on websites",
  "content": "Check out the list of websites where you can occasionally experience an issue with the Grammarly browser extension.\nGmail\nGoogle Docs\nWordPress\nI don’t see the Grammarly icon\nAt this time, Grammarly doesn’t initiate in Gmail if your interface is set to a language that uses a right-to-left script. To change your interface in Gmail to English, please follow\nthese steps\n.\nIf that is not the case, please clear your browser’s cache as described in\nthis article\n.\nNote:\nGrammarly may not initialize in new emails if you’re opening a composition window in full-screen mode. Our development team has been made aware of the issue. Our investigation indicates that this occurs due to certain experiments carried out by Google.\nAlternatively, consider switching to\nGrammarly for Windows and Mac\n, which integrates with multiple websites and applications.\nGrammarly doesn't check the subject line on Gmail\nAt this time, Grammarly's extension doesn't check the subject line of emails being composed in Gmail.\nAs a workaround, we suggest that you copy the subject line and paste it into the body of the email for Grammarly to check it, and then copy the text back to the subject line.\nAlternatively, consider switching to\nGrammarly for Windows and Mac\n, which integrates with multiple websites and applications.\nI don’t see the Grammarly icon on Google Docs\nIf the issue occurs in the Chrome browser, please re-enable Grammarly in Google Docs by following the instructions below:\nIf the Grammarly icon isn’t visible in your browser's toolbar, click the Extensions icon and pin Grammarly for Chrome:\nClick the G icon in the browser’s toolbar and switch off and then switch on\nCheck for writing suggestions\non Google Docs\n. The G icon should then appear in the lower-right corner of your document.\nIf the issue persists or you experience it in a different browser (Firefox, Edge, or Safari), please clear your browser’s cache as described in\nthis article\n.\nI don’t see Grammarly underlines in Google Docs\nPlease make sure there are no footnotes and tables in your document. We’re experiencing some compatibility issues with Google Docs documents that contain footnotes and tables.\nAs a workaround, we recommend removing them and adding them back after editing your document with Grammarly.\nIf your document doesn’t contain any footnotes or tables, however, and you don’t see Grammarly underlines, please clear your browser's cache as described in\nthis article\n.\nGrammarly slows down Google Docs\nAt this time, documents of thirty pages or more may slow down Grammarly’s performance. We are working on extending this limitation.\nI don’t see Grammarly in other Google Drive services\nGrammarly currently supports several Google Drive services, including Google Docs, Google Sheets, and Google Forms. Google Slides is not currently supported.\nIf you'd like to use Grammarly in Google Sheets, you'll need to install\nGrammarly for Windows and Mac\nby following the instructions in ​​\nHow do I install Grammarly for Windows or Grammarly for Mac?\nGrammarly works when you access WordPress from the /wp-admin page (https://<domain.com>/wp-admin/post.php). Also, if you switch to the classic editor, Grammarly should work there as well.\nAt this time, Grammarly does not work if you access WordPress from https://wordpress.com/post/<domain.com>. We don’t currently have a quick fix, but please rest assured that our team has been made aware of the issue.\nNote:\nIf the website where you experience an issue is not on the list, we encourage you to take advantage of the Grammarly Virtual Helper. Please open it by clicking the green button in the lower-right corner of the page and then entering the name of the website where you experience the problem.",
  "category": "Grammarly Browser Extension",
  "tags": []
}