{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000091672-How-does-Grammarly-for-Microsoft-Office-work",
  "scraped_at": "2025-08-11T20:33:32.696557+00:00",
  "title": "How does Grammarly for Microsoft Office work?",
  "content": "Important:\nGrammarly for Microsoft Office will no longer be updated. We suggest switching to\nGrammarly for Windows\nor\nGrammarly for Mac\n, which supports integration with multiple applications and websites, including Microsoft Office apps. Alternatively, we encourage you to give\nthe Grammarly Editor\na try.\nIf you prefer to continue using Grammarly for Microsoft Office on your Windows computer, this article is a useful source of information about the following topics:\nOpening Grammarly\nChecking text\nDeactivating certain check types\nChecking your document for plagiarism\nAdjusting goals\nChanging default settings\nOpening Grammarly\nOnce you’ve added Grammarly to Microsoft Word or Outlook, click\nOpen Grammarly\nin the\nHome\ntab or use the button in your new Grammarly tab, and the Grammarly sidebar will appear:\nWhen you start typing or checking your text, Grammarly will show suggestions in that sidebar.\nOnce you open Grammarly, you’ll also see a Grammarly tab where you can select goals for your document, specify which categories of suggestions you want to run on your document, turn the plagiarism check on or off, manage your deactivated suggestions, and adjust your settings.\nChecking text\nGrammarly’s suggestions will appear as underlines in your text and as suggestion cards in the Grammarly sidebar on the right.\nIf you click the underlined word, a corresponding card will be expanded in the sidebar. The card allows you to accept, ignore, and learn more about a suggestion:\nAccept suggestion\n: Click on a suggestion to apply the change in the text. To revert a recently applied suggestion, click\nUndo\n.\nIgnore suggestion\n: Dismiss the suggestion and remove it from the list of suggestion cards.\nLearn more\n: Get a detailed explanation of the highlighted writing issue, and learn how you can improve your future writing.\nGrammarly also provides an option to specify which types of suggestions to provide for your document. Grammarly’s four categories of suggestions — clarity, correctness, engagement, and delivery — are all turned on by default. However, if you prefer to switch on only correctness, clarity, delivery, or engagement, click on the corresponding button in the Grammarly tab. To see all suggestions for your document, click\nAll Issues\n.\nNote:\nIf you are a Grammarly for Business user, you can also take advantage of\nstyle guide\nsuggestions in Microsoft Word or Outlook.\nIf you use Grammarly in Microsoft Outlook, you can use our tone detector to check the tone of your writing. For more details, check\nthis article\n.\nDeactivating specific types of suggestions\nCertain types of suggestions, such as Oxford comma and passive voice suggestions, can be turned off.\nIf you see a suggestion that is not helpful, hover over the trash bin icon in the upper right corner of the suggestion card. If it’s a suggestion that can be deactivated, you’ll see an option that says\nTurn off suggestions like this\n:\nAfter you deactivate a suggestion, you can turn it back on by clicking\nDeactivated Suggestions\nin the Grammarly tab:\nNote:\nThis feature is available only to Grammarly Premium users. If the\nDeactivated suggestions\nbutton is grayed out, you haven’t deactivated anything yet. If you’d like to learn more about this feature, check\nthis article\n.\nChecking your document for plagiarism\nThe plagiarism checker is available only to our paid users and is deactivated by default. To check your text for plagiarism, click the\nPlagiarism\nbutton in the Grammarly tab:\nTip:\nWe suggest activating the plagiarism checker on your document after you have finished writing it.\nAdjusting goals\nYou can set your preferred goals to receive more tailored writing feedback from Grammarly. To adjust your settings, click the\nAdjust Goals\nbutton in the Grammarly tab:\nIn the pop-up window, select your desired audience, formality level, and\ndomain (type)\nfor your text.\nNote:\nThe\nDomain\nsetting is not available in Grammarly for Microsoft Office in Outlook.\nChanging default settings\nClick\nSettings\nto access your Grammarly settings within Word or Outlook. You can:\nView your account information and access your profile settings\nAccess and manage your\npersonal dictionary\nUpdate your\nlanguage preference\nAutomatically open Grammarly for every new document you create\nTurn background checking on or off\nYou can also see your version of Grammarly for Microsoft Office or check for updates by clicking\nAbout\nin the Grammarly tab:\nLastly, you can find a link to our support pages, activate the diagnostics mode, and set up your proxy settings by clicking\nSupport\n:",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}