{
  "url": "https://support.grammarly.com/hc/en-us/articles/22595729580301-I-experience-issues-in-Microsoft-Word",
  "scraped_at": "2025-08-11T20:32:18.253236+00:00",
  "title": "I experience issues in Microsoft Word",
  "content": "Our development team has been working to identify the root cause of several reported issues, including:\nUnderlines not appearing in text\nGrammarly not automatically jumping to the next suggestion\nCorrupted text after accepting a suggestion\nThe cursor jumps to an incorrect location in the document.\nThe number of suggestions shown in the Grammarly widget resets, or counts up repeatedly.\nThey’ve determined that the issues listed above may be caused by the following elements:\nInserted citations, like endnotes\nA table of contents\nFootnotes\nImages\nTables\nEquations\nInterference from Microsoft Office add-ins\nFor optimal performance, we suggest removing these elements from your Microsoft Word document. We also suggest splitting your document into parts that do not exceed 50 pages.\nPlease know we are working to roll out several incremental improvements for the integration of Grammarly for Windows with Microsoft Word. These will become available automatically once they’re ready, and releases can be tracked at\nGrammarly's Bug Resolution Updates\n.\nIf the issue persists after removing the elements listed above from your document, please\nsubmit a support request\nand provide the following details so we can investigate this issue further:\nThe original document\nA full-screen video showing the issue you're experiencing. You can record it by following the instructions at\nHow to record a video of a technical issue I’m experiencing\n.\nThe Grammarly for Windows and Mac logs as outlined in this article:\nHow to collect error logs in Grammarly for Windows and Mac\n.\nThe\nMicrosoft Word version\nyou're currently using.\nWe apologize for any inconvenience and appreciate your patience while we work toward improving this integration.\nNote:\nIf the issue is that the Grammarly widget has disappeared altogether, please refer to this article:\nGrammarly for Windows and Mac doesn’t appear in Microsoft Office products (Microsoft Word, Outlook, PowerPoint, etc.)\n.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}