{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000930532-Remove-team-members",
  "scraped_at": "2025-08-11T20:30:30.029909+00:00",
  "title": "Remove team members",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins and members with designated custom roles\nTo remove members from your team plan, follow these steps:\nGo to the\nMembers\npage.\nCheck the boxes next to the members you’d like to remove and click\nRemove\nin the lower-left corner of the page.\nIn the window that appears, click\nRemove members\nto confirm the action.\nMembers who have been removed will receive an email notification from Grammarly about this change. They can continue using their existing Grammarly accounts, and any documents stored in their accounts will not be affected. If a member had an individual subscription that remained paused while they were part of your team plan, their subscription will automatically resume.\nIf you have a list of members who should be removed from your plan, you can import it by following these steps:\nGo to the\nMembers\npage.\nClick on the three dots icon\n⋮\nin the upper-right corner and select\nRemove members by list\n:\nIn the window that appears next, click on the\nDownload template\nlink.\nAdd the email addresses of the members who should be removed to the downloaded file.\nReturn to the previous window and click\nChoose file\n.\nUpload the file and click\nReview changes\n.\nClick\nRemove members\nto confirm the action.\nIf you have a list of members who should remain or be added to your plan and want to remove all others, follow these steps:\nGo to the\nMembers\npage and click\nInvite m\nembers\nin the upper-right corner.\nIn the window that appears next, choose\nImport list\n.\nNext, click on the\nDownload template\nlink.\nAdd the email addresses of the team members who should remain in your subscription to the downloaded file, and do not include those who should be removed. You can leave the “Name” and “Group” columns empty.\nReturn to the previous window, and c\nhoose the\nReplace the existing member list\noption. In this case, team members who are not included in the file will be removed from your subscription.\nClick\nChoose file\n.\nUpload the file and click\nContinue\n.\nClick\nConfirm\nto apply the changes.\nAfter you remove team members from your plan, their seats will remain vacant until you invite someone else in their stead. If you no longer need the extra seats, you can update your subscription as described in this article:\nAdd or remove seats\nNote:\nIf your organization is using SAML single sign-on, you also need to unassign access to the Grammarly app in your identity provider for team members that you would like to remove.",
  "category": "Manage Members & Permissions",
  "tags": []
}