{
  "url": "https://support.grammarly.com/hc/en-us/articles/32752750261517-Introducing-the-feature-access-panel",
  "scraped_at": "2025-08-11T20:41:53.073029+00:00",
  "title": "Introducing the feature access panel",
  "content": "Included in:\nPro, Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins\nThe\nFeature access\npage within the Grammarly admin panel serves as a centralized control hub that allows admins to efficiently manage their team members’ access to various Grammarly features.\nYou can configure the following features:\nGenerative AI\nTurn on or off generative AI assistance for your team.\nWhen generative AI is turned on, you can click\nEdit access\nto choose whether it should be available to all members of your organization or only to members of specific groups.\nLearn more about generative AI assistance\n.\nStrategic suggestions\nTurn on or off proactive suggestions based on inferred writing goals and audience.\nThis feature requires generative AI assistance to be turned on. If the generative AI assistance is activated for specific groups within your organization, turning on strategic suggestions will activate this feature for those particular groups only. You can learn more in this article:\nIntroducing strategic suggestions\nApp actions\nTurn on or off all app actions for all members of your team plan. To activate or deactivate specific app actions, including Grammarly’s translation feature, click on\nAdditional app actions settings\nand switch the toggles next to the appropriate apps:\nLearn more about app actions\n.\nAuthorship\nTurn on or off the option for members of your organization’s subscription to demonstrate the sources of their text in Google Docs and Microsoft Word documents.\nLearn how Authorship works\n.\nKnowledge Share\nTurn on or off the Knowledge Share feature for all members of your team plan.\nLearn how Knowledge Share works\n.\nAdditionally, to turn on or off proactive suggestions for new Knowledge Share terms, individual members can change their preference for\nIntelligent Knowledge Share term creation\non the\nYour preferences\npage.\nPersonal dictionary\nTurn on or off the option for your team members to add new words to their personal dictionary. If this option is turned off, Grammarly will continue to recognize the preferred spelling for words already added to personal dictionaries.\nLearn how personal dictionaries work\n.\nPersonal snippets\nTurn on or off the option for your team members to create, view, or edit their personal snippets.\nLearn more about snippets\n.\nAdditionally, to turn on or off proactive suggestions to create new snippets, individual members can change their preference for\nIntelligent snippet creation\non the\nYour preferences\npage.\nIndividual usage analytics\nTurn on or off the option for admins, account managers, group managers, and members with designated custom roles to see Grammarly usage data of individual team members.\nLearn about individual usage analytics\n.\nGrammarly for Microsoft Office\nTurn on or off background checking for Grammarly for Microsoft Office in Microsoft Word and Outlook for all members of your team plan. When background checking is turned off, Grammarly does not automatically check text in Microsoft Word documents or Microsoft Outlook emails. In this case, your team members will not receive writing suggestions unless they enable Grammarly in each document or email they want to check.\nTo change this setting for Microsoft Word or Outlook separately, click on\nAdditional Grammarly for Microsoft Office settings\n:\nFor the changes to take effect, please ensure that the following conditions are met:\nYour team members have waited at least five minutes.\nYour team members have turned off Grammarly for Microsoft Office and then turned it back on.\nYour team members have an up-to-date version of Grammarly for Microsoft Office installed (v6.7.186 and above).",
  "category": "Team Features",
  "tags": []
}