{
  "url": "https://support.grammarly.com/hc/en-us/articles/16664924710797-Introducing-Knowledge-Share",
  "scraped_at": "2025-08-11T20:35:13.230835+00:00",
  "title": "Introducing Knowledge Share",
  "content": "Included in:\nGrammarly Pro, Business, and Enterprise plans\nManaged by:\nAll members or specific roles selected by admin\nKnowledge Share helps your team members decode terms like acronyms or internal project names by providing tooltip-like explanations—a definition of a term, key contacts, and links to relevant documents.\nTopics covered in this article:\nHow to add terms to Knowledge Share\nWhere does Knowledge Share work?\nHow to edit or delete Knowledge Share terms\nHow to export Knowledge Share terms\nHow to turn Knowledge Share on or off\nHow to add terms to Knowledge Share\nYou can add the terms that you’d like to define in two ways:\nBy going to the\nKnowledge Share\npage, clicking\nAdd term\n, and selecting\nAdd individual term:\nBy opening the\nKnowledge Share\npage, clicking\nAdd term\n, and choosing\nImport list\n. You will see the prompt to download a template, which you can fill in with the list of terms. Once that’s done, click\nNext\nin the same window and upload the file.\nAdditionally, you can benefit from our pre-set term lists by clicking\nAdd term\nand selecting\nAdd pre-set terms.\nOnce the terms have been added, Grammarly will highlight them for you and your team members. Hover over a highlighted term to surface its description, relevant documents, and key contacts:\nWhere does Knowledge Share work?\nKnowledge Share is currently available in Google Docs, Gmail, Confluence, and Jira via\nGrammarly for Chrome\n, in Microsoft Word and Outlook via\nGrammarly for Windows\n, and Slack via\nGrammarly for Mac\n.\nIn Google Docs, Knowledge Share definitions will be displayed in documents that are not owned by you. In Gmail, term definitions will appear in emails that you have received or sent, but not in new emails you compose.\nIn Microsoft Word for Windows, you will see Knowledge Share highlights while writing, reading your documents in Read Mode, and viewing read-only documents.\nIn Microsoft Outlook, Knowledge Share definitions will be shown for incoming emails.\nIn Confluence and Jira, Knowledge Share definitions will appear for published text.\nHow to edit or delete Knowledge Share terms\nTo edit or delete a term, go to the\nKnowledge Share\npage and click on the term you’d like to modify. In the window that opens next, edit the term details and click\nSave\nto apply the changes, or click\nDelete term\nif you’d like to delete the term:\nYou can also start editing a term from its definition card that appears on hover.\nAdditionally, you can delete a term by locating it on the\nKnowledge Share\npage and clicking the three dots icon next to the term.\nNote:\nWhen creating terms, you can add aliases (alternative names) for each term.\nIf you are the admin of your team’s subscription, you can select which roles allow your team members to create, edit, and delete Knowledge Share terms.\nTo do that, go to the\nKnowledge Share\npage, click on the three dots icon in the upper-right corner of the page, and select\nSettings\n.\nNote:\nBy default, the option to add, edit, delete, or export Knowledge Share terms is available to admins, account managers, group managers, users, and members with designated custom roles. The option to assign group manager permissions and create custom roles is available only to Grammarly Enterprise customers.\nHow to export Knowledge Share terms\nYou can export the terms in bulk by going to the\nKnowledge Share\npage and clicking\nExport\nin the upper-right corner:\nHow to turn Knowledge Share on or off\nYou can activate or deactivate Knowledge Share for your organization in the corresponding section of the\nFeature access\npage.\nIf you deactivate Knowledge Share, you and your team members will no longer see definitions of the terms added on the\nKnowledge Share\npage.\nTo stop receiving suggestions to create new Knowledge Share terms, go to\nYour preferences\npage and turn off\nIntelligent Knowledge Share term creation\n. This setting is controlled by each member independently.",
  "category": "Team Features",
  "tags": []
}