{
  "url": "https://support.grammarly.com/hc/en-us/articles/4478776460045-Receive-an-invoice-to-purchase-Grammarly-Business",
  "scraped_at": "2025-08-11T20:41:33.562525+00:00",
  "title": "Receive an invoice to purchase Grammarly Business",
  "content": "Topics covered in this article:\nRequesting an invoice\nPaying an invoice\nChanging the billing details on an invoice\nRequesting a quote for subscription renewal or additional seats\nCanceling an invoice\nCredit balances\nIf your organization requires an invoice prior to purchase, you can choose this as your payment method for your Grammarly Business purchase.\nNote:\nInvoices are available only for annual subscriptions to Grammarly Business starting with 10 or more seats. If you initially paid with a credit card or PayPal but would like to renew your subscription using an invoice, please\ncontact Support\n.\nAt this time, there is no free trial for Grammarly Business subscriptions purchased via invoice. Your subscription will be activated once payment has been received by Grammarly. The paid subscription period will start on the payment receipt date, not on the date the invoice was requested. Your payment is due within 30 days upon the invoice request and within 14 days on seat upgrades made subsequently.\nIf you are an existing Grammarly Premium user, you will continue to have access to the Premium features until the payment for your Grammarly Business subscription is received.\nRequesting an invoice\nTo request an invoice for your Grammarly Business purchase, please follow these steps:\nGo to\nwww.grammarly.com/upgrade/business\nSet your team size to 10 or more members.\nChoose the annual plan and click\nContinue\nto Payment\nor\nContinue to Account Creation\n.\nIf prompted, sign up for a Grammarly account or sign in by clicking\nI have an account\nin the upper-right corner.\nUnder the\nPayment details\nsection, click\nInvoice\n.\nFill in your billing details.\nIf you’d like to add a purchase order number, check the box next to\nInclude a purchase order number\n, insert your PO number in the field that appears next, and click\nContinue\n.\nReview the billing details and click\nConfirm\n.\nNote:\nOnce the payment for your Grammarly Business subscription is received, your subscription will be set to automatically renew one year from the payment receipt date. An invoice for your subscription renewal will be generated 30 days before that date.\nTo request an invoice for additional seats, see the instructions below:\nGo to the\nSubscription\npage.\nClick\nUpdate plan\nunder the\nPlan\nsection.\nIn the new window that appears, set the updated number of seats and click\nContinue\n.\nReview your billing information and click\nConfirm\n. If you need to change the billing information, select the\nUpdate Billing Details\noption, fill in updated billing details, and click\nUpdate\n.\nAll additional seats will be made available for use immediately. You’ll have 14 days to make a payment for the additional seats. If no payment is received within 14 days, the additional seats will be removed according to the following logic:\nUnused seats will be removed first.\nAny other additional seats will be removed based on the last activity date. For example, a seat with the last activity date of May 1 will be removed before a seat with the last activity date of May 31.\nNote:\nThe option to request an invoice for additional seats becomes available after the payment for the original invoice is received. There can be no more than one pending invoice at a time.\nPaying an invoice\nTo pay your Grammarly Business invoice, go to the\nSubscription\npage and click\nMake a payment\n. You can also click the payment link in the email from our payment processor Stripe, sent to the billing email address you specified in the invoice request form. The email in question should be titled “New invoice from Grammarly, Inc.” If you haven’t received the email with the invoice, please see this article:\nNot receiving email sent from Stripe\nYou can pay your Grammarly Business invoice using the following payment methods: credit card, debit card, ACH Credit/Wire, ACH Debit, Apple Pay, and Google Play. All payments for Grammarly are made exclusively in U.S. dollars.\nNote:\nPayments via PayPal and paper checks are not supported at this time. Also, we do not accept payments from bill.com. If ACH/Wire payment method is used, it can take up to five business days until the payment is received and your Grammarly Business subscription is activated.\nBank transfer (ACH/Wire) details:\nAccount Type:\nChecking\nBank / Institution:\nWELLS FARGO BANK, N.A.\nRouting number:\n121000248\nAccount number:\nProvided in Invoice\nSWIFT Code / BIC:\nWFBIUS6S\nAddress:\n420 MONTGOMERY STREET\nSAN FRANCISCO, CA\n94104\nUSA\nRecipient Type:\nBusiness\nBeneficiary:\nGrammarly, Inc\nChanging the billing details on an invoice\nOnce you confirm your billing details and request your Grammarly Business invoice, it no longer can be changed. To change the details on your invoice, you need to cancel the original invoice and request a new one afterward.\nIf you would like to have your purchase order (PO) number reflected on your invoice, please add it to the\nBilling Details\nsection before the invoice is issued.\nRequesting a quote for subscription renewal or additional seats\nTo download a quote for your subscription renewal, follow these steps:\nGo to the\nSubscription\npage.\nScroll down to the\nBilling Details\nsection and click\nUpdate\n.\nScroll down and check the box next to\nInclude a purchase order number\n.\nClick\nGet a quote\n.\nIf you need a quote for the purchase of additional seats, follow the instructions below:\nGo to the\nSubscription\npage.\nClick\nUpdate\nunder the\nPlan Summary\nsection.\nIn the window that appears next, set the updated number of seats and click\nContinue\n.\nClick\nEdit\nin the\nBilling details\nwindow.\nScroll down and check the box next to\nInclude a purchase order number\n.\nClick\nGet a quote\n.\nIf you already have an open invoice for additional seats, you will need to void it first to be able to follow the steps above.\nCanceling an invoice\nYou can cancel your Grammarly Business invoice request at any time before your payment due date. Additionally, Grammarly will automatically void your invoice if no payment is received within 30 days.\nTo cancel an invoice request for your Grammarly Business purchase, please follow these steps:\nGo to the\nSubscription\npage.\nAt the bottom of the page, click\nCancel Subscription Request\n.\nIn the new window that appears, click\nYes, Cancel\n.\nSelect a cancellation reason and click\nCancel Subscription\n.\nIf you wish to cancel an invoice for additional seats, go to the\nSubscription\npage and click\nVoid Invoice\nunder the\nTransactions\nsection.\nCredit balances\nIf your invoice is overpaid or we receive payment for an expired invoice, the amount will become a credit balance. Credit balances will not expire as long as your account is active. Additionally, credit balances are automatically applied to the next invoice. You should see\nApplied balance\non the invoice where the credit balance has been automatically applied.",
  "category": "How to Upgrade",
  "tags": []
}