{
  "url": "https://support.grammarly.com/hc/en-us/articles/9182359307917-Can-Grammarly-help-me-with-citations-and-a-bibliography",
  "scraped_at": "2025-08-11T20:33:37.245586+00:00",
  "title": "Can Grammarly help me with citations and a bibliography?",
  "content": "To use our free auto-citations feature, install the\nGrammarly browser extension\n. Anytime you’re reading on a compatible source website, you’ll see a\nGet citation\nbutton appear in the lower-left corner of your screen. Click this button, and Grammarly will present a full citation and an in-text citation for the source you’re viewing, ready and formatted for you to use. If you need to format citations for a new paper in a different style guide, you can easily switch between APA, MLA, and Chicago using the suggestion’s dropdown menu.\nIf you don’t see this button, please switch on the\nShow “Get citation”\noption. The\nGet citation\nbutton will then appear at the bottom of the page on one of these websites:\njournals.plos.org/plosone\nsciencedirect.com/science/article/pii/\njournals.sagepub.com/doi\nncbi.nlm.nih.gov/pmc/articles\ndoaj.org/article\narxiv.org/abs\n*.springeropen.com/articles\nfrontiersin.org/articles/\nonlinelibrary.wiley.com/\njournals.physiology.org/\nscience.org/\nnature.com\npnas.org/\nannualreviews.org/\npubs.asha.org/\nacademic.oup.com/\nmdpi.com/\nmuse.jhu.edu/\nonline.ucpress.edu/journals\njournals.uchicago.edu/\nIf you use Grammarly Premium, Grammarly for Business, or Grammarly for Education, Grammarly can also help identify any formatting mistakes and format your bibliography or in-text citations according to the MLA, APA, or Chicago formatting style.\nWhen using the Grammarly Editor, choose your preferred formatting style by setting your domain to\nAcademic\nand then adjusting the\nFormat\nsetting:\nGrammarly will then offer suggestions to ensure that your in-text citations and references are formatted in accordance with your preferred formatting style.\nIf you’d like to generate a citation for any reference, check out our free\nCitation Generator\n. You’ll need to enter the information about your source and then copy the citation to your document.\nFor more information about citations, check out\nthis blog post\n.",
  "category": "Questions about Grammarly features",
  "tags": []
}