{
  "url": "https://support.grammarly.com/hc/en-us/articles/34229560223885-Why-can-t-I-pass-the-CAPTCHA-verification",
  "scraped_at": "2025-08-11T20:35:11.012386+00:00",
  "title": "Why can’t I pass the CAPTCHA verification?",
  "content": "When using Grammarly, you may occasionally encounter a CAPTCHA—short for Completely Automated Public Turing test to tell Computers and Humans Apart. CAPTCHAs help us verify that you're human and protect Grammarly from automated bots.\nIf you're experiencing issues with a CAPTCHA, try the following solutions:\nTurn off your VPN or proxy:\nVPNs and proxies can sometimes trigger CAPTCHA requests. Try deactivating them temporarily and refreshing the page.\nIf you're unsure whether you’re using a proxy, you can check by following the steps in this article:\nHow can I tell if I use a proxy server?\nEnsure your browser is up to date. Check your browser settings for available updates.\nDeactivate browser extensions temporarily. Some extensions may interfere with CAPTCHA. Try turning them off and refreshing the page.\nLog in using a different browser, network, or device.\nTo stop seeing these prompts in the future, we suggest setting up two-step verification for your account:\nSign in to your Grammarly account, click\nYour\nAccount\nin the left-side panel and select\nTwo-Step Verification\n. Here is a direct link:\nhttps://account.grammarly.com/security/mfa\nClick\nTurn On\n. You may be asked to verify your account again by entering your password and a 6-digit code sent to your email address.\nSelect which second factor you would like to use (a third-party authenticator app or text messages).\nIf you’d like to use a third-party authenticator app:\nScan the QR code using your preferred third-party authenticator app.\nClick\nNext\n.\nEnter the verification code from within your authenticator app.\nClick\nVerify\nto activate two-step verification.\nIf you’d like to use text messages:\nEnter a valid phone number that can receive text messages.\nClick\nSend Code\n.\nEnter the verification code you received via text message.\nClick\nTurn On\nto activate two-step verification.\nClick\nDone\n.\nImportant:\nPlease save the backup codes you’ll see in the pop-up menu that opens next. If you lose access to your phone or authenticator app, a backup code is the only way you’ll be able to sign in to your Grammarly account on new devices.\nAs an alternative, you can solve an audio challenge instead of a visual one. To do so, click the headphone icon at the bottom of the CAPTCHA window.",
  "category": "Sign-in Help",
  "tags": []
}