{
  "url": "https://support.grammarly.com/hc/en-us/articles/21602062542989-How-to-block-and-manage-blocked-apps-in-Grammarly-for-Android",
  "scraped_at": "2025-08-11T20:48:18.306207+00:00",
  "title": "How to block and manage blocked apps in Grammarly for Android",
  "content": "This article details the steps necessary to block and unblock Grammarly for Android within individual apps.\nBlocking Grammarly for Android\nTo stop Grammarly for Android from appearing within specific applications, follow these steps:\nStart by opening the app where you want to deactivate Grammarly for Android.\nOnce the app is open, look for the Grammarly widget (represented by the letter “G”) that appears on your screen.\nTap and hold this Grammarly widget. Drag it down toward the bottom of the screen until a circular icon with an X appears.\nDrag the Grammarly widget onto the circular X icon.\nWhen a menu pops up at the bottom of the screen, select the option\nBlock this app\n. This will prevent Grammarly from proofreading your text within that specific application.\nTip:\nIf you would like to turn off Grammarly for Android temporarily, you can drag the Grammarly widget to the circular X icon. Without tapping\nBlock this app\n, close the menu by selecting the X on the right. This will turn off Grammarly for Android for your current session. You can bring the Grammarly widget back by closing and reopening the application you were working in.\nUnblocking Grammarly for Android\nIf you change your mind and want to unblock Grammarly within a particular application, please do the following:\nLaunch the Grammarly companion app on your Android device.\nSelect\nBlocked apps\nto see a list of applications where Grammarly is currently deactivated.\nTap\nUnblock\nnext to the app where you want Grammarly for Android to be reactivated.\nManaging apps blocked by Grammarly\nGrammarly for Android may not work with certain financial, medical, streaming, and other apps due to performance limitations. If you have any incompatible apps installed, they will appear in the\nBlocked Apps\nsection of the Grammarly companion app, labeled\nBlocked by Grammarly\n.\nIf you'd like Grammarly to support any of these apps, you can tap the\nRequest\nbutton:\nThis helps us gather feedback but does not immediately enable Grammarly in that app. We'll notify you if the app becomes supported in the future.",
  "category": "Grammarly for Android",
  "tags": []
}