{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090372-I-don-t-see-the-Grammarly-icon-in-text-fields",
  "scraped_at": "2025-08-11T20:43:00.796309+00:00",
  "title": "I don't see the Grammarly icon in text fields",
  "content": "If the Grammarly icon is not fixed in the lower-right corner of the text field, this may be because\nGrammarly for Windows and Mac\nis active in your browser. Only one of our product offerings can be active at a time.\nWhen the Grammarly browser extension is installed, you’ll see a Grammarly icon in your browser toolbar. If the Grammarly icon isn’t visible in your browser’s toolbar, click the\nExtensions\nicon and select Grammarly from the list. If the icon is gray, the Grammarly browser extension is turned off, and Grammarly for Windows and Mac may be the active product offering.\nIf you have Grammarly for Windows and Mac installed, you should see a movable widget (Windows) or the Grammarly tab on the right side of your screen (Mac) once you begin typing in the text field.\nYou can choose which product offering to use in your browser by clicking the Grammarly icon in your browser’s toolbar and turning the\nCheck text with browser extension\nsetting on or off.\nIf the Grammarly icon within your browser toolbar is already green, please select the tab for the browser that you are using and follow the troubleshooting steps below:\nChrome\nSafari\nFirefox\nEdge\nCheck that Grammarly for Chrome is installed and activated:\nCopy and paste this string into your address bar:\nchrome:extensions,\nand press\nEnter\n.\nSee if Grammarly for Chrome appears on the list of extensions and if the switch next to the extension is blue:\nIf Grammarly is not on the list of extensions, please visit\nthis page\nto add it to your browser.\nTry temporarily turning off all other extensions you’re using:\nCopy and paste this into the address line:\nchrome:extensions\nSwitch all other extensions except Grammarly off.\nCheck that Grammarly for Firefox is installed and activated:\nCopy and paste this string into your address bar:\nabout:addons\nand press\nEnter\n.\nSee if Grammarly for Firefox appears on the\nEnabled\nlist and if the switch next to the extension is blue:\nIf Grammarly is not on the list of extensions, click\nthis link\nto add it to your browser.\nTry temporarily turning off all other extensions you’re using:\nCopy and paste\nabout:addons\ninto your address bar and press\nEnter\n.\nSwitch all other extensions except Grammarly off.\nCheck that Grammarly for Safari is installed and activated:\nOpen Safari Preferences by navigating to\nSafari\n>\nPreferences\nor pressing\nCommand\n+\nComma\n.\nNavigate to the\nExtension\ntab.\nFind Grammarly for Safari on the list of extensions and verify that the\nEnable Grammarly for Safari\ncheckbox is checked.\nIf Grammarly is not on the list of extensions, click\nthis link\nto add it to your browser.\nTry temporarily turning off all other extensions you’re using:\nGo to\nSafari\n>\nPreferences\n(or use Command ⌘+ Comma).\nSelect the\nExtensions\ntab and untick the boxes next to each extension.\nCheck that Grammarly for Microsoft Edge is installed and activated:\nCopy and paste this string into your address bar:\nedge://extensions/\nand press\nEnter\n.\nSee if Grammarly for Microsoft Edge appears on the list of extensions and if the toggle next to the extension is blue:\nIf Grammarly is not on the list of extensions, please visit\nthis page\nto add it to your browser.\nTry temporarily turning off all other extensions you’re using:\nCopy and paste this string into your address bar:\nedge://extensions/\nand press\nEnter\n.\nSwitch all other extensions except Grammarly off.",
  "category": "Grammarly Browser Extension",
  "tags": []
}