{
  "url": "https://support.grammarly.com/hc/en-us/articles/360061408151-Analyze-my-team-s-writing-performance",
  "scraped_at": "2025-08-11T20:36:55.685086+00:00",
  "title": "Analyze my team’s writing performance",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nAvailable to:\nAll member roles\nGrammarly’s\nanalytics dashboard\nallows you to explore your team’s aggregated writing activity across several dimensions, such as interactions with Grammarly and improvements in writing over time. To learn more about analyzing team members’ individual usage, check out this article:\nReview member usage analytics\nTopics covered in this article:\nWhat’s new?\nWhat’s available?\nApplying filters\nSetting the date range\nWhat’s new?\nAs we strive to provide robust, insights-driven analytics on your team’s writing with Grammarly, we made the following enhancements to the\nTeam overview\npage:\n1. Introduced the Effective Communication Score for Enterprise teams:\nThe Effective Communication Score represents the overall strength of your organization’s communication. By surfacing key metrics, Grammarly can show you where teams are doing well—and where they can improve. You can learn more in this article:\nIntroducing the Effective Communication Score\n2. Added a chart to display data on application and domain usage\nAdded a new chart:\nWhere Your Members Are Using Grammarly\n. This chart shows the top 10 applications and websites where your team members are writing with Grammarly. Additionally, you can filter the results to view where your team members are using Grammarly’s generative AI.\nNote:\nAt this time, the application and website data can’t be filtered by a user group or other criteria.\n3. The “Active Team Members” chart replaced with the “Grammarly Usage Summary” chart\nThe new\nGrammarly Usage Summary\nchart provides a breakdown of Grammarly usage within your organization. It allows you to compare the following values over time:\nNumber of users who are connected to Grammarly\nNumber of users who are writing while Grammarly is connected\nNumber of users who accepted Grammarly suggestions while they wrote with Grammarly connected\nHow to read this chart?\nIn an optimal scenario, all three lines on the chart should closely align with each other. If there is a noticeable distance between any of the lines, it may be a good opportunity to promote the use of Grammarly within your organization.\nNote:\nYou can send reminders to team members with pending invitations by clicking\nRemind Invited\nin the right-side panel. This option will appear only to team members with the admin role and if the data filter is set to\nAll members\n.\nThe data from the\nGrammarly Usage Summary\nchart is also shown as a snippet at the upper-right corner of your\nHome\npage:\nWhat’s available?\nWriting Sessions Improved\nThis graph will help you understand how Grammarly improves your team’s written communication:\nGrammarly Suggestions\nThis graph helps you understand how your team members interact with Grammarly’s suggestions. You can look at the suggestions by specific outcomes to identify trends and areas of improvement. Additionally, you can combine multiple outcomes and apply any of the available views (e.g., by totals or by percentage).\nTop 10 tones used by your team\nThis chart shows the top ten tones detected in your team’s communication to relay whether your team members are consistently making the right impression:\nGenerative AI Usage\nIf generative AI is enabled for your team, this graph will show how many generative AI prompts your team members have used:\nAnalytics data may be displayed with up to a 30-hour delay depending on your time zone.\nThe data will not be displayed if there were fewer than two active team members in the selected time period.\nTeam members with the admin and account manager roles or group manager permissions can download raw data by clicking\nExport\nin the upper-right corner of the page. For more information, check out this article:\nOrganize exported team overview analytics data\nGrammarly Enterprise admins can create a custom role that grants permissions to manage the organization’s analytics (view, filter, and export team or individual usage data), but without full admin privileges. You can learn more in this article:\nAbout custom roles\nOnce a team member is removed, their data will not be taken into account for the entire time period.\nApplying filters\nNote:\nThis feature is not available to team members with the user role. Team members with the group manager permissions will be able to apply filters only for the selected groups they have permission to manage. Custom group filter functionality is not available to group managers.\nYou can filter analytics data by a\nuser group\nor create a custom filter.\nTo filter by a user group, click\nAll members\nat the top of the page and select the box next to a group.\nTo create a custom filter:\nOpen the filters dropdown menu.\nClick\nCreate custom filter\n:\nEnter the filter name and select the boxes next to the team members you’d like to include (minimum of 2, maximum of 1,000).\nClick\nCreate filter.\nNote:\nYou can create up to a maximum of 30 filters.\nWhile any users with the admin or account manager role can filter by user groups, custom filters won’t be visible to other team members. You can also combine any number of filters by user group and custom filters in the same query:\nWhen team members are added to a custom filter or a user group, their data will be included for the entire time period they have been a part of the subscription and not just since the day they were added to the filter or group.\nNote:\nIf a member is included in several groups, they will be accounted for only once in aggregated statistics and graphs.\nTo edit or delete a custom filter, open the filters dropdown menu and click on the pencil icon next to a filter:\nSetting the date range\nYou can choose to view the data for the previous 7 days, the previous 30 days, or for a custom date range.\nYou can only choose dates starting from April 1, 2021.\nThe date format is YYYY/MM/DD.\nFor date ranges of 30 days or less, data will be grouped by day. For date ranges between 31 and 180 days, data will be grouped by week. For longer date ranges, data will be grouped by month.\nIf the date range can’t be broken down into a whole number of weeks, the last data point will show an incomplete week.\nHere’s how data will be grouped into 7-day and 30-day blocks depending on the graph:\nWriting Sessions Improved:\nPercentage of improved sessions over the time period\nGrammarly Suggestions:\nView by totals:\nThe total value over the entire time period\nView by percentage:\nPercentage of the total number of suggestions that were accepted\nView per 100 words:\nThe average number of suggestions per 100 words over the time period\nTones Detected:\nThe average percentages of tones used per day. The number of writing sessions during a day is not taken into account when calculating the average over a time period. For example, if Grammarly detected that 50 percent of your writing was in a friendly tone on day one, and 25 percent was in a friendly tone on day two, the resulting number for two days would be (50+25)/2=37.5 percent regardless of how much text you wrote on either day\n.",
  "category": "Team Features",
  "tags": []
}