{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090052-Delete-your-Grammarly-account",
  "scraped_at": "2025-08-11T20:46:58.666232+00:00",
  "title": "Delete your Grammarly account",
  "content": "Note:\nIf you logged out of your Grammarly account, navigate to\ngrammarly.com/signin\n. You should see a menu displaying the email addresses you previously used to log in.\nDeleting your account will remove your personal information from Grammarly, including any documents that you have saved in\nthe Grammarly Editor\n. This action cannot be undone.\nIf you just want to cancel a paid subscription (and all future payments), but you don’t want to delete your Grammarly account, you can do so by following the steps\nin this article\n.\nIf you have a paid subscription and want to proceed with the account deletion, please\nsubmit a support ticket\n.\nIf you would like to delete your free Grammarly account on a desktop computer or your mobile device, see the instructions below:\nLog in\nto your Grammarly account at\nhttps://www.grammarly.com/signin\n.\nGo to\nhttps://account.grammarly.com/profile\nand click\nDelete Account\nat the bottom of the page.\nThese instructions are the same for all sign-in methods. However, depending on your sign-in option, you might need to complete an additional verification step. For example:\nIf you registered using the email and password method, Grammarly will ask you to provide your password to confirm the action.\nIf you used Facebook to sign up with Grammarly, you’ll need to enter your Facebook password.\nIf you used Google to sign up, you will need to select the corresponding Google account and sign in after clicking the\nDelete Account\nbutton.\nNote:\nIn some cases, we require you to verify your ownership of the account by entering a 6-digit code sent to your current email address. If you don’t have access to your email inbox, please\nlet us know\n.\nIf you use a paid Grammarly account under the management of a company, organization, or other legal entity, please reach out to your account administrator for more information.",
  "category": "Account Settings",
  "tags": []
}