{
  "url": "https://support.grammarly.com/hc/en-us/articles/29548735595405-About-Grammarly-Authorship",
  "scraped_at": "2025-08-11T20:37:02.236171+00:00",
  "title": "About Grammarly Authorship",
  "content": "What is Grammarly Authorship?\nGrammarly Authorship enables users to demonstrate their sources of text in a Google Doc or Microsoft Word document. When a user enables Authorship tracking within either Google Docs (via the Grammarly browser extension) or Microsoft Word (via Grammarly for Windows and Mac),\nGrammarly Authorship proactively tracks the writing process. Authorship automatically categorizes the source of text as it is entered into the body of a document. Because Grammarly runs on your browser and across your desktop (via the Mac and Windows client), Grammarly is able to distinguish between text that is typed directly into your document, text that is pasted from a browser-based source, and text that is pasted from an unknown source, like a private browsing window. Furthermore, Grammarly Authorship provides specific categorizations, distinguishing text that is AI-generated from the text that is typed by the end user and then modified with Grammarly’s generative AI rephrasing capability. Authorship also categorizes text that is typed and then edited with traditional, non-generative Grammarly features, like grammatical error correction, clarity rewrites, and word choice suggestions.\nAs of April 22, 2025, Authorship is available within Google Docs via the Grammarly browser extension and as a beta release in Microsoft Word via Grammarly for Windows and Mac.\nFor users on accounts obtained or purchased through Grammarly’s website (Free, Pro, and Premium):\nBasic Authorship tracking functionality is available to all users in both Google Docs and Microsoft Word, with the option to generate and share any number of Authorship reports. Grammarly Pro and Premium plans also include detailed attribution for external sources other than text entered by the user, including text that is copied from a website or desktop application (in Microsoft Word only) and text that is copied from a generative AI source. If you use Grammarly Pro or Premium, you also have access to AI and plagiarism detection within Authorship reports, showing specific text that may overlap with online sources or may have been AI-generated despite not being directly pasted into the body of the document.\nFor users on accounts purchased through our Sales team (Grammarly for Education, Enterprise, and certain Pro and Business accounts):\nUsers on these accounts can also enable tracking, generating, and sharing an unlimited number of reports. Users on these plans will also have detailed attribution from external sources and the ability to see any AI or traditional plagiarism checks within their reports.\nCustomers who are using the Grammarly browser extension for Chrome and Edge can turn on Authorship within Google Docs. Customers using Grammarly for Windows and Mac can enable Authorship within Microsoft Word on their desktops.\nNote for K–12 Grammarly for Education and Grammarly Business account admins:\nGB admins can use the admin panel to switch Authorship on or off in the Grammarly browser extension in Google Docs for your entire team.\nK-12 institutional admins\nshould reach out to their Customer Success Manager to request that Authorship be turned on for their users in both Google Docs and Microsoft Word.\nBy default, Authorship is not available in Grammarly for Windows and Mac for Grammarly Business team members, as it is currently in beta in this product offering. If you’d like your team to have access to Authorship in Microsoft Word before the feature becomes generally available, please reach out to your Customer Success Manager to request it.\nHow do I activate Grammarly Authorship?\nWithin Google Docs\nIf you have the Grammarly browser extension installed in Chrome or Edge and you open a blank Google Doc, you will see a dialog asking you to enable Authorship.\nAfter you click\nOK\nor close the dialog, you will then see two notifications at the bottom left of your screen: one will let you know that Authorship is now available, and the second one will show the menu to activate Authorship tracking.\nYou can either:\nClick the thumbprint icon next to the\nTrack writing activity\npop-up to turn on Authorship tracking for that single document session, or\nTake no action, in which case nothing is tracked.\nYou can also select the\nStart automatically\noption in the widget menu if you want tracking to start automatically whenever a new Google Doc is opened. Doing so means you will always be able to generate a report that categorizes text sources. If you only enable tracking for the current document you are working on, please keep in mind that you will have to turn it on individually from the thumbprint icon at the bottom left for each document you want to track.\nOnce you click\nTrack writing activity\n(shown as a thumbprint icon) for the first time within Google Docs, a clipboard permissions dialog will show up:\nOnce you click\nAllow access\n, your browser extension will ask for its own permissions. The Chrome permissions are shown below, as an example:\nIMPORTANT:\nPlease note that if you do not allow clipboard access, Authorship will only be able to track text actions within the current Google Doc and will\nnot\nbe able to attribute any text from browser-based sources.\nOnce you’ve turned on Authorship and granted clipboard access, the menu will look like the following:\nYou are always able to keep the thumbprint icon from appearing via the individual settings on the Grammarly browser extension main menu.\nWithin Microsoft Word\nIf you have Grammarly for Windows and Mac installed on your computer and you open a blank Microsoft Word document, you will see a dialog asking you to activate Authorship.\nAfter you click\nOK\nor close the dialog, you will then see two notifications at the bottom left of your screen: one will let you know that Authorship is now available, and the second one will show the menu to activate Authorship tracking.\nNote for Mac users:\nYou must save your document in order to enable tracking.\nOnce you’ve seen this dialog, you can either:\nClick the thumbprint icon next to the\nTrack writing activity\npop-up to turn on Authorship tracking for the current, single document session, or\nTake no action, in which case nothing is tracked.\nYou can also select the\nStart automatically\noption in the widget menu if you want tracking to start automatically whenever a new Microsoft Word doc is opened. Doing so means you will always be able to generate a report that categorizes text sources. If you only enable tracking for the current document you are working on, please keep in mind that you will have to turn it on individually from the thumbprint icon at the bottom left of each document you want to track.\nOnce you click\nTrack writing activity\n(shown as a thumbprint icon) for the first time within Microsoft Word, a clipboard permissions dialog will appear:\nIMPORTANT:\nPlease note that if you do not allow clipboard access, Authorship will only be able to track text actions within the Word doc itself and will\nnot\nbe able to attribute any text from browser-based or desktop sources.\nOnce you have activated Authorship, the following menu will appear on the screen:\nYou can keep this menu from appearing via the individual settings in Grammarly for Windows and Mac.\nHow does Grammarly know where my text came from?\nGrammarly Authorship only works if you provide access to your clipboard. Once that’s granted via the steps outlined above, Grammarly is able to see the latest text copied to the clipboard from browser-based sites or (if you’re working in Word) from desktop applications. Grammarly only has access to the most recent copied action, as the only thing Grammarly is concerned with is the text that makes its way into the body of the document. With clipboard access, Grammarly can determine whether text is copied from a gen AI source like ChatGPT or Claude, or from a more traditional online source like Wikipedia.\nWithout clipboard access, Authorship is still able to document your typing actions and actions you take using Grammarly within the document; it can also categorize any pasted text as “copied from an unknown source,” but it will not be able to attribute the text beyond that.\nHow do I know that Grammarly Authorship is recording my activity in a document?\nYou are always in control of whether Grammarly Authorship records your writing activity. By default, Grammarly Authorship does not track your writing activity. Once you’ve activated Authorship tracking, you will see the green thumbprint icon in the lower-left corner of the screen in both Google Docs and Microsoft Word. The thumbprint icon will be gray if tracking is not activated.\nHow do I view my Authorship report?\nWhen you are ready to view your report, hover over or click the thumbprint icon at the bottom left of your screen and click\nSee report\n. In both Microsoft Word and Google Docs, the report will open in a separate tab within your default browser. The report will have three sets of information available to you, and whichever audience you decide to share it with:\nAuthorship Analytics\n—Shows a breakdown of your text sources, organized by “human-typed” and “sourced” categories, along with data about the amount of time spent on the document and the number of active writing sessions. A “session” expires after 10 minutes of idle time in the document.\nAuthorship Report\n—The report includes the full body of your text, color-coded by text category, along with details about the text source.\nAuthorship Replay\n—The replay shows your full typing and editing history from start to finish. Particularly if you wrote over a long period of time, the replay is meant to help you remember the primary actions you took in your document, giving you the opportunity to delete any unnecessary text, cite sources accordingly, and make any last-minute edits.\nGrammarly Authorship is showing inconsistent attribution. Why is that?\nWhile Authorship is now generally available in Google Docs, it’s not necessarily able to capture 100% of cases accurately. There may be cases where keystrokes are typed too fast for Authorship to pick them up accurately, cases where text is pasted from a desktop source where Authorship does not run, or instances where text was pasted from a new AI tool that has yet to be categorized as generative AI. Authorship is still a beta feature within Microsoft Word, which means text attribution may be more unstable than in Google Docs.\nIf you notice a bug in either platform, please report it by contacting our Support team here:\nSubmit a request\n.\nHow do I share my report with others?\nAt the top of your report, you’ll see a green\nShare\nbutton. Upon clicking it, you’ll see a unique URL that you can copy and share with whoever you choose. Your audience will be able to see all of the same information you see in the report.\nWhat content is attributed and what is not?\nWithin Google Docs:\nAny text from a browser-based source where Grammarly is available will be attributed. That means text from a generative AI tool, academic article, periodical, and more will be attributed. Text that is copied from a desktop source or private browsing window will not be attributed, but will be categorized as “Copied from an unknown source.”\nWithin Microsoft Word:\nSimilar to Google Docs, any text from a browser-based source where Grammarly is available will be attributed. Additionally, because the Grammarly desktop application works across desktop apps, text from other desktop applications will also be attributed (examples are Notes and the ChatGPT desktop app).\nWhich Authorship features are available on the Grammarly Free plan? Which are available on Grammarly Pro, Premium, Enterprise, Grammarly for Education, and Grammarly Business plans?\nAll Grammarly users have access to Authorship’s basic tracking and reporting features.\n(However, K–12 and GB users of Grammarly for Windows and Mac are invite-only while the product remains in beta.\n) All plans, including the Free plan, can:\nGenerate an unlimited number of Authorship reports\nShare an unlimited number of Authorship reports\nSee “Typed by a Human” analytics\nSee “Typed by a Human” detailed insight cards\nSee color-coded text broken down in the report\nGrammarly Pro, Grammarly Premium, Grammarly for Education, and Grammarly Business users can also see:\n“Copied from a source” analytics (including percentage of text that was AI-generated)\n“Copied from a source” detailed insight cards, including specific text that was from an AI-generated source\nWhat data does Grammarly Authorship collect about me?\nTo provide a record of your editing history, Grammarly Authorship will collect the text you write in the context of a document, including text you write and then delete, text you paste from websites or desktop sources and their source names such as Wikipedia and ChatGPT, as well as your prompts to generative AI.\nWe encourage you to review with our\nPrivacy Policy\nand\nData Privacy Addendum\n. You can also\nsubmit a request in the account hub\nanytime to view data associated with your account.\nWhat data does Grammarly Authorship NOT collect about me?\nGrammarly does\nnot\ncollect or store any data that is not pertinent to the writing process. In other words, Grammarly does not track browsing history or web traffic that does not involve copying text into your clipboard (for instance, video views, article reading, gaming activity, etc.). Grammarly is merely collecting the text that you copy into your browser’s clipboard and then paste into the body of your Google Doc.\nWhere is Grammarly Authorship data stored?\nWhile you are writing, Grammarly Authorship stores its data on your device only.\nOn-device data is stored encrypted at rest using the AES-256 GCM encryption algorithm and a randomly generated 256-bit key. The key is stored on Grammarly servers, retrieved from your device on demand during your Grammarly session, and stored in memory for the purpose of reading and writing encrypted authorship data. When you delete your browsing data related to Google Docs, the Authorship on-device data is deleted as well.\nWhen you click the “See report” button on the thumbprint icon at the bottom left of the screen, Authorship data for the current document is sent to Grammarly servers, over an encrypted connection using TLS, for processing. The data remains on Grammarly servers for up to 24 hours.\nWhen you share your Grammarly Authorship report with others, such as an instructor or editor, the report data for the respective document is sent to Grammarly servers and stored for 12 months or until you delete your account, whichever comes first. As the originating user, you can view the report anytime during that 12-month period by going back to the original document and clicking\nView report\n. You can also delete this report data at any time by clicking on the trash bin icon for the respective document, as shown below.\nWhat Authorship data is shared when I generate and send a report link?\nWhen sharing a report, your reader has the ability to see all the same information you do when you view the Authorship report, including:\nTop-level document analytics\nThe full text of your document, color-coded by source\nText insight cards that describe the text source, word counts, words edited, and typing/editing time\nA full replay of your typing and editing process\nThe replay feature includes the ability to see text being written and deleted, the names of websites where text is copied from, and your prompts to generative AI tools such as ChatGPT. You can preview what data will be available to your instructor by choosing “See report” and replaying the writing activity before sharing it. You also have the option of excluding the replay in the report when sharing, if you do not want your audience to see your entire writing and editing process.\nWhat are some security considerations when using Grammarly Authorship?\nGrammarly Authorship data includes a history of how your document has been edited, including parts of the document you have deleted from its latest version, as well as the names of websites you may have used while editing your document. While this data is encrypted on-device at rest, it may be accessible by other users of the device while you are logged in to your Grammarly account on that device. We recommend logging out of Grammarly before letting others use your device, especially if you are using a shared device such as a school or library computer.\nFor Grammarly for Education Admins: Authorship Analytics\nAs your users activate and use Authorship, you will begin to see aggregated data in your Grammarly for Education admin panel under the\nAnalytics\ntab. The\nAuthorship Analytics\nsubtab will show the following data across your institution as Authorship is used:\nTotal amount of text that is typed\nTotal amount of text that is copied from a website\nTotal amount of text that is AI-generated\nThe top 10 sources of external text used in writing\nNote:\nIn the spring of 2025, only data from Google Docs will be populated in the dashboard. By August 2025, data from both Google Docs and Microsoft Word will be available.",
  "category": "Generative AI assistance",
  "tags": []
}