{
  "url": "https://support.grammarly.com/hc/en-us/articles/360028308911-I-can-t-access-my-email-address-to-verify-my-account",
  "scraped_at": "2025-08-11T20:39:40.333374+00:00",
  "title": "I can't access my email address to verify my account",
  "content": "For your security, we require all users to verify their accounts before making changes to their account information. We do this by sending a verification code to your email address. However, if you mistyped your email address when creating your Grammarly account, or you no longer have access to your email address, you won’t be able to receive our verification codes.\nTo help us verify your account, please\nsubmit a support request\n. You’ll be asked to provide Grammarly’s reference number on your bank statement, which should look similar to COQWE23ZA, CO*QWE23ZA, or QWE23ZA. Alternatively, you can provide the following details:\nfirst six digits of the\ncredit card you used for Grammarly\nlast four digits of the credit card you used for Grammarly\ncard network type (e.g., VISA)\ncredit card expiration date (month/year)\nthe charge date\nthe charge amount\nif you paid with PayPal, your PayPal email address and transaction ID\nIf you paid via the App Store or Google Play Store, a receipt of your payment\nNote:\nFor security reasons, please don’t provide all 16 digits of your credit card or attach photos of your credit card to support tickets. We just require the details mentioned above to verify the ownership of your account.\nGrammarly Pro users\nIf you no longer have access to the email address associated with your paid account and don't remember your password, please\nsubmit a support request\nso that we can assist you further.\nImportant!\nWe recommend setting up a recovery email for your account in case you ever lose access to your email address. To do that, follow the steps from this article:\nSetting up and using a recovery email for your Grammarly account\n.",
  "category": "Sign-in Help",
  "tags": []
}