{
  "url": "https://support.grammarly.com/hc/en-us/articles/360044592352-Grammarly-for-iPad-user-guide",
  "scraped_at": "2025-08-11T20:44:45.081608+00:00",
  "title": "Grammarly for iPad user guide",
  "content": "Grammarly for iPad\nallows you to access the Grammarly Editor and use\nthe Grammarly Keyboard\non your iPad through one app.\nBefore you\ndownload\nand install Grammarly for iPad, you’ll need to make sure that the app is compatible with your tablet. We support iPads running iOS 14 or newer.\nIf you use iOS 15 or newer, you’ll also have the option to enable the Grammarly browser extension for Safari on your iPad. For more information about this, check out\nthis article\n.\nThis article covers:\nSwitching between the keyboard and the editor\nCreating new documents\nChecking text\nDeactivating certain suggestion types\nFormatting text\nViewing synonyms\nAdjusting goals and document type\nDownloading a document\nDocument statistics\nPlagiarism checker\nAdding scanned text\nWeekly Insights\nManaging your account settings\nSwitching between the keyboard and the editor\nTo start using Grammarly on your iPad, open the Grammarly application you installed on your device.\nTo access the Grammarly Editor, tap\nMy Grammarly\n. Here you can create new documents and edit existing ones.\nIf you’d like to set up your keyboard, tap\nKeyboard\nat the bottom of the screen. Then, open any other app on your iPad and tap a text field to start typing with the Grammarly Keyboard.\nNote:\nTo learn more about managing your keyboard settings, check\nthis article\n. If you don’t see a green Grammarly logo in the top left corner of your keyboard after following the instructions, tap the globe icon.\nCreating new documents\nTo create a new document in the Grammarly iPad Editor, you have two options—\nWrite\nor\nImport\n:\nWrite\nTap the\nWrite\noption in the Grammarly iPad Editor app.\nA blank document will open, where you can begin typing your text.\nAlternatively, you can copy text from a different app and paste it into a blank document to get started.\nImport\nTap the\nImport\noption in the Grammarly iPad Editor app. This will prompt you to select a document from your files.\nNavigate through your files to locate and select the document you want to import.\nOnce you've selected the document, it will be loaded into the Grammarly Editor, allowing you to review and make any necessary changes\nCurrently, the Grammarly iPad Editor supports the following file formats: PDF, Microsoft Word (DOC, DOCX), OpenOffice (ODT), TXT, RTF, Markdown (MD), TextPack and TextBundle, OPML, and many other formats from different iOS apps.\nIf you would like to see other file formats supported, please see our\nFeature Request\nsection to record your feedback.\nTip:\nYou can use the quick actions menu to create a new document by tapping and holding the Grammarly icon on your Home Screen and selecting\nNew Document:\nChecking text\nOnce you create a document and start typing, Grammarly will automatically check your text. While your document is being checked, the\nOverall\nscore icon spins in a circle to indicate that checking is in progress. You can keep typing, and Grammarly will continue checking.\nWhen Grammarly detects a writing issue in your text, you’ll see a red, blue, green, or purple underline. Tap on any underlined word or phrase to see Grammarly’s suggestion. These suggestions will also be available in the sidebar on the right:\nTo accept a suggestion\n, tap\nAccept\n.\nIf you’d like to ignore a suggestion\n, tap\nDismiss\n.\nTo see a detailed explanation about a specific suggestion, tap\nMore\n(the three dots icon) in the upper-right corner of the suggestion card and select\nShow details\n:\nIf a suggestion is incorrect\nor you’d like to report it for any reason, tap the three dots and choose your preferred option to proceed.\nIf you’d like Grammarly to stop flagging a particular spelling as incorrect, you can add the word to your personal dictionary by clicking the\nAdd to dictionary\nbutton:\nDeactivating certain suggestion types\nNote:\nThis feature is available only to Grammarly Pro, Grammarly Premium, Grammarly for Business, and Grammarly for Education users.\nCertain types of suggestions, such as Oxford comma and passive voice alerts, can be turned off:\nFormatting text\nGrammarly for iPad offers the following formatting options:\nBold, italic, and underlined text\nNumbered lists and bullet points\nH1 and H2 headers\nHyperlinks\nClear Formatting\nTo format your text, tap and hold on a word, select the needed text, and press one or several formatting options at the bottom of the screen:\nViewing synonyms\nAt this time, you can view synonyms if the Grammarly Keyboard is enabled when you are writing in the Grammarly Editor. You can learn more about setting up the Grammarly Keyboard\nhere\n.\nOnce you have enabled the Grammarly Keyboard, simply tap on a word in the text and choose a synonym in the completions bar of the keyboard.\nNote:\nThe Grammarly Keyboard does not provide suggestions in the Grammarly iPad Editor. To view and accept suggestions, use the sidebar.\nAdjusting goals and document type\nIf you want to achieve a specific goal with your text, tap\nGoals\nand select your preferred goals in the menu indicated below:\nNote:\nThe option to select the domain is available only to users of our paid subscription plans.\nTo learn more about domains and goals, check\nthis article\n.\nDownloading a document\nOnce you’ve finished editing, you can either copy the text and paste it to another app or export the document.\nTo export your document, tap the\nExport\nicon in the upper right corner of the screen and select your preferred option of exporting it:\nNote:\nYou can export your document in the following formats: plain text (.txt), rich text (.rtf), Microsoft Word (.docx), PDF (.pdf), markdown (.md), and HTML (.html). If there are other file formats that you would like to export your document in, please see our\nFeature Request\nsection to record your feedback.\nDocument statistics\nYou can view your document statistics by tapping\nOverall score\n. This section offers a lot of useful information about your text, including word count and the number of characters it contains:\nPlagiarism checker\nIf you have a paid subscription, you can check your document for plagiarism. To do that, tap the\nPlagiarism\nbutton in the panel at the top of your screen:\nAdding scanned text\nYou can add scanned text by tapping the\nScan\nbutton in the panel at the top of your screen:\nWeekly Insights\nGrammarly’s Weekly Insights are now available directly in Grammarly for iPad. To check your statistics, open the Grammarly application, and tap\nInsights\nat the bottom of your screen.\nYou can share your weekly stats with your friends or family by tapping the\nShare Insights\nbutton at the top of the screen and then selecting one of the available options.\nThe information in the\nInsights\nsection will be automatically updated every Monday to show your writing statistics from the previous week. To learn more about Grammarly Insights, visit\nthis page\n.\nManaging your account settings\nTo access your account settings, tap\nAccount\nat the bottom of your screen:\nHere you can:\nUpdate your\nlanguage preference\nManage your\npersonal dictionary\nCheck your subscription\nContact Grammarly’s Support Team for any assistance\nIf you’d like to manage your Grammarly Keyboard settings, please check\nthis article\nfor more information.",
  "category": "Grammarly for iPad",
  "tags": []
}