{
  "url": "https://support.grammarly.com/hc/en-us/articles/360048683092-Set-up-SAML-single-sign-on",
  "scraped_at": "2025-08-11T20:48:22.943948+00:00",
  "title": "Set up SAML single sign-on",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins and members with designated custom roles\nSetting up SAML single sign-on (SSO) will enable your team members to log in to Grammarly through a third-party identity provider, eliminating the need to maintain separate passwords for Grammarly.\nTo enable SAML single sign-on, follow these steps:\nAdd Grammarly to your identity provider\n.\nSign in\nto your Grammarly account and go to the\nAuthentication\npage.\nClick\nConfigure\n.\nFill in the necessary fields with the parameters from your identity provider.\nClick\nTest SSO\n. If the test is successful, click\nActivate SSO\n.\nNote:\nWith the Grammarly Pro plan, SSO is available starting at two seats.\nIf the SSO test fails, please double-check the Grammarly settings in your identity provider and the values you entered on the\nAuthentication\npage. If you encounter any issues, please look for a troubleshooting article on this page:\nResolve Issues\nOnce SSO is activated, access to your organization’s subscription will be defined by access assignment in your identity provider.\nTeam members who are already part of your organization’s subscription won’t be able to log in to Grammarly until you assign the Grammarly app to them in your identity provider.\nTo add new team members to your organization’s subscription, you need to assign the Grammarly app to them in your identity provider. If you assign the app to someone who does not have a Grammarly account, it will be created for them when they sign in via SSO.\nNote:\nYou can also send invitations to team members from your Grammarly admin panel as described in this article:\nInvite team members\n. However, they won’t be able to join your organization’s subscription until they are granted access to Grammarly in the identity provider.",
  "category": "SAML Single Sign-On",
  "tags": []
}