{
  "url": "https://support.grammarly.com/hc/en-us/articles/4410375670541-Customize-writing-preferences",
  "scraped_at": "2025-08-11T20:29:22.825037+00:00",
  "title": "Customize writing preferences",
  "content": "Included in:\nGrammarly Pro, Business, and Enterprise plans\nManaged by:\nAdmins, account managers, group managers, and members with designated custom roles\nWriting preferences\nallow you to customize Grammarly’s suggestions to your team’s writing style. You can manage a preset selection of stylistic suggestion types, turning on the types of suggestions relevant to your team’s specific use case and turning off those that don’t fit your needs.\nTo get started, go to the\nOrg preferences\npage located under the\nWriting\ntab on your admin\nHome\npage.\nTo set a writing preference, click the dropdown menu next to it and select one of the three options:\nOn for all\n,\nOff for all\n, or\nNo preference\n.\nBy default, all settings are set to\nNo preference\n, and team members can set their personal writing preferences\n. Once you turn on or turn off a suggestion type for the team, your choice will override your team members’ personal preferences.\nNote:\nIf you’re an admin, and a writing preference you want to change is locked, please review this article:\nA writing preference I want to change is locked by the admin\nHow do I create additional writing preference sets?\nNote:\nThis option is unavailable in the Grammarly Pro plan.\nTo create additional writing preference sets, follow these steps:\nGo to the\nWriting Preferences\npage, click on the three dots in the upper-right corner of the page, and choose\nCreate preference set\n.\nIn the window that appears next, click\nCreate preference set\n.\nEnter the preference set name, select the groups you’d like it to be assigned to, and click\nSave\n.\nIf you haven’t created any member groups yet, you can refer to this article to do so:\nOrganize team members into groups\nHow do I assign a writing preference set to team members?\nNote:\nIf you’re on the Grammarly Pro plan, writing preferences apply to all members.\nGo to the\nWriting Preferences\npage, click on the three dots in the right-side corner next to the corresponding writing preference set, and select\nSettings\n:\nIn the window that appears next, select a member group and click\nSave\n.\nNote:\nA single member group can have only one writing preference set assigned to it. If you assign a different writing preference set to a group that already has one assigned to it, they will no longer see suggestions from the original writing preference set. On the other hand, a single writing preference set can be assigned to multiple member groups.\nHow do I delete a writing preference set?\nGo to the\nWriting Preferences\npage, click on the three dots in the right-side corner next to the corresponding writing preference set, and select\nDelete\n.\nIn the window that appears next, confirm the action by clicking\nDelete\nagain.\nWhat access do team members with different roles have?\nTeam members with the\nadmin\nor\naccount manager\nroles have editing permissions for all writing preference sets: they can create, edit, or delete writing preference sets assigned to any of the existing member groups.\nTeam members with\ngroup manager\npermissions can create and edit writing preference sets only for the groups they are assigned to manage.\nIf you’re a Grammarly Enterprise admin, you can also create a\ncustom role\nthat grants permissions to manage writing preferences for your organization or multiple teams, but without full admin privileges. You can learn more in this article:\nAbout custom roles\nNote:\nThe group manager permissions and custom roles are available only to Grammarly Enterprise customers. Interested in upgrading to an Enterprise account?\nContact our Sales team\n.\nRelated articles\nCreate style rules\nSet brand tones\nCreate organizational dictionary",
  "category": "Team Features",
  "tags": []
}