{
  "url": "https://support.grammarly.com/hc/en-us/articles/4407988620173-How-to-use-Grammarly-through-the-Samsung-Keyboard",
  "scraped_at": "2025-08-11T20:45:13.848613+00:00",
  "title": "How to use Grammarly through the Samsung Keyboard",
  "content": "Note:\nGrammarly for Samsung Keyboard is available only on select devices running One UI 4.0 and higher. If you’re not sure if your device is compatible, please contact Samsung Support.\nGrammarly is integrated into your Samsung Keyboard automatically. To make sure you are taking advantage of Grammarly features, check that you activated Grammarly in your device settings by following the steps from\nthis article\n.\nChecking text\nOnce you start writing, Grammarly will automatically check your text and provide writing suggestions:\nTo review and accept a suggestion, tap the three dots in the upper-right corner of the keyboard. Then, tap on the suggestion you see to accept it:\nIf you’d like to dismiss a suggestion, tap\nIgnore\nin the lower-right corner of the keyboard.\nManaging your personal dictionary\nIf you’d like Grammarly to stop flagging a particular spelling as incorrect, you can add the word to your personal dictionary. Here’s how to access your personal dictionary and add words:\nTo log into your Grammarly account, tap on the three dots in the upper-right corner of the keyboard and tap the Grammarly icon on a suggestion card:\nTap on the three lines in the upper-right corner and select\nCustomize.\nEnter the word that you'd like to add to your personal dictionary and tap\nAdd\n.\nYou can learn more about your personal dictionary by visiting\nthis page\n.\nAdjusting your language preference\nGrammarly recognizes a number of spelling, grammar, and punctuation differences in American, British, Canadian, and Australian English.\nTo change your language preference:\nOpen\nSettings\non your device\nSearch for\nSamsung Keyboard\nTap\nLanguages and types\nTap\nManage input languages\nand select your preferred dialect\nTo find out more about language preference, check out this\nblog post\n.",
  "category": "Grammarly for Samsung Keyboard",
  "tags": []
}