{
  "url": "https://support.grammarly.com/hc/en-us/articles/360032922091-How-to-set-up-two-step-verification",
  "scraped_at": "2025-08-11T20:39:16.440892+00:00",
  "title": "How to set up two-step verification",
  "content": "Two-step verification, sometimes known as two-factor authentication or 2FA, is an additional security measure to help protect your account. If you activate two-step verification, you’ll be asked to provide a six-digit code in addition to your password.\nFor two-step verification to work properly, you’ll need a mobile phone that can either receive text messages or can run a third-party authentication app.\nSign in to your\nGrammarly account\nand click on the\nYour account\ntab\nin the left-side panel.\nIn the\nSecurity\nsection, select\nTwo-step verification\n.\nClick\nTurn on\n.\nYou may be asked to verify your account again by entering your password and a 6-digit code sent to your email address.\nSelect which second factor you would like to use.\nIf you’d like to use a third-party authenticator app:\nScan the barcode using your preferred third-party authenticator app.\nClick\nNext\n.\nEnter the verification code from within your authenticator app.\nClick\nVerify\nto activate two-step verification.\nIf you’d like to use text messages:\nEnter a valid phone number that can receive text messages.\nClick\nSend code\n.\nEnter the verification code you received via text message.\nClick\nTurn on\nto activate two-step verification.\nClick\nDone\n.\nIf you registered using Google, Facebook, or Apple but would like to set up two-step verification for your Grammarly account, you’ll need to set a password first by following\nthese steps\n.\nImportant:\nPlease save the backup codes you receive in the next pop-up. If you lose access to your phone or authenticator app, a backup code is the only way you’ll be able to sign in to new devices.\nOnce you set up two-step verification, you’ll receive a confirmation email. Next time you log in to Grammarly on a new device, you will be asked to complete the additional verification.\nTip:\nYou can skip the verification step on a particular device if you designate it as a trusted device. Don’t worry—anyone attempting to sign in on a different device will still have to enter a code.\nIf you haven’t received a text message with a code, please check out\nthis article\n.",
  "category": "Account Security",
  "tags": []
}