{
  "url": "https://support.grammarly.com/hc/en-us/articles/38552360525837-AI-Grader-user-guide",
  "scraped_at": "2025-08-11T20:44:06.242578+00:00",
  "title": "AI Grader user guide",
  "content": "The AI Grader agent is a great way to evaluate the quality of your writing assignment\nbefore\nyou submit it. Instead of relying on generic AI for basic feedback, AI Grader offers detailed feedback aligned with any provided\nrubric, course details, writing topic, and any publicly available information about your instructor. This gives you a customized set of recommendations at both the document and paragraph level, as well as an estimated grade to help you improve and get the grade you really want.\nThe AI Grader agent is available in\ndocs\nfor Grammarly Pro and Grammarly Premium subscribers. Users of Grammarly Free will get one free document scan per day, with limited specific suggestions on how to improve.\nHow to use\nTo review your text and get feedback tailored to your assignment, click the AI Grader agent icon on the agents panel on the right side:\nYou can add your own rubric or assignment guidelines, together with filling out the details about your instructor’s school and class, by clicking the\nAdd rubric and instructor\nbutton. Alternatively, you can review your text using the basic guidelines provided by the AI Grader agent by clicking the\nCheck with basic guidelines\nbutton.\nThe AI Grader panel displays your predicted assignment grade along with detailed suggestions for improvement. Hover over the bars on the left side of your assignment to see actionable feedback prompts that guide you on how to enhance your text so it meets the requirements outlined in the guidelines:\nYou can also update the assignment guidelines anytime by clicking\nEdit assignment info\nin the lower-right corner of the AI Grader agent panel:\nFAQs\nIs using the AI Grader agent considered cheating?\nThe AI Grader agent is designed to help you improve your writing to meet your assignment requirements. It aims to coach you on how to make your work better. This shouldn’t be regarded as cheating, but if you’re in doubt, ask your instructor. While the grade is a prediction, it should not be considered the final grade you will receive after submitting.\nWhat kinds of assignments can the AI Grader agent evaluate?\nThe AI Grader can assess any kind of writing assignment across disciplines. The more specific the criteria you provide, the more specific and targeted its feedback will be.\nCan the AI Grader agent detect plagiarism?\nNo. To check your text for plagiarism, you need to use the Plagiarism Checker agent.\nWill my school or professor find out I used the AI Grader agent?\nThe AI Grader agent is designed to help students double-check and improve their work before submission. It does not include features for instructors. Remember that the rewrite components of the AI Grader agent are AI-based. We recommend consulting your instructor before using any generative AI features in tools like Grammarly to ensure you're following the proper policies.\nHow does the AI Grader know what my professor might think of my paper?\nAI Grader is not a “replica” of your professor. If you provide your rubric and professor information, AI Grader will cross-reference publicly available information on the web to gauge how your professor might evaluate the line of thinking in your paper. The agent will also consider any available information about their grading difficulty and sentiments on AI. However, the primary factors impacting the grade and substantive feedback suggestions come from the provided rubrics and, in the absence of a rubric, a generic evaluation of the writing argumentation, readability, and delivery. The grade should not be considered a direct prediction for what grade your professor will assign.",
  "category": "Agents",
  "tags": []
}