{
  "url": "https://support.grammarly.com/hc/en-us/articles/360059662992-Manage-team-member-roles",
  "scraped_at": "2025-08-11T20:35:59.411847+00:00",
  "title": "Manage team member roles",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins, account managers, group managers, and members with custom roles\nMembers of team plans can be assigned one of three roles: admin, account manager, or user.\nIn Grammarly Enterprise plans, members with the user role can also be granted group manager permissions or assigned a custom role.\nRoles\nUser\nThe\nuser role\ngrants access to Grammarly’s full range of writing suggestions and limited view-only access to account analytics. This role is assigned by default to new members who join a team’s plan.\nUser role with group manager permissions\nThe user role with group manager permissions is designed for team members who need to manage and maintain aspects of their specific team’s product usage. This includes viewing analytics as well as managing style rules and other writing configurations for their team. Team members with group manager permissions can manage the settings only for the teams they are specifically assigned to as group managers. User role with group manager permissions might be suitable for managers or team leaders. You can grant group manager permissions to multiple team members with the user role.\nNote:\nGroup manager permissions are available only to Grammarly Enterprise customers. To learn more, please see this article:\nGroup manager permissions for team members\nAccount manager\nThe account manager role is designed for team members who want to manage and maintain aspects of their organization’s plan related to product usage. This includes viewing analytics as well as managing style guides and other writing configurations for multiple teams or across the whole organization. Team members with the account manager role might be department heads or managers. You can assign the account manager role to multiple team members.\nAdmin\nThe\nadmin role\nis designed for team members who need full control over all aspects of the team’s plan. Admins have access to everything available under the account manager or group manager roles, plus they can manage IT configurations (including single sign-on) and subscription details for billing purposes. Team members with the admin role might be founders and executives, senior leadership, or someone from the IT department who provisions licenses or handles account administration. You can assign the admin role to multiple team members.\nCustom role\nAdditionally, Grammarly Enterprise customers can create custom roles. Unlike predefined default roles, which come with a fixed set of permissions, custom roles allow enterprise admins to mix and match permissions to create roles that suit their organization’s unique needs. You can learn more in this article:\nAbout custom roles\nPermissions\nClick on a section to see the permissions for each role.\nSubscription settings\nAdmin\nAccount manager\nGroup manager\nUser\nPlan details\n✔\nUpdate plan\n✔\nBilling history\n✔\nBilling receipts\n✔\nCancellation\n✔\nAdministration\nAdmin\nAccount manager\nGroup manager\nUser\nFeature access\n✔\nAuthentication\n✔\nProvisioning\n✔\nMembers\nAdmin\nAccount manager\nGroup manager\nUser\nInvite members\n✔\nRemove members\n✔\nChange invite settings\n✔\nRole assignment\nAdmin\nAccount manager\nGroup manager\nUser\nAssign admin role\n✔\nAssign account manager role\n✔\nAssign group manager permissions\n✔\n✔\n✔\nGroups\nAdmin\nAccount manager\nGroup manager\nUser\nCreate and delete groups\n✔\n✔\nModify groups\n✔\n✔\nAdd or remove group members\n✔\n✔\n✔\nAnalytics\nAdmin\nAccount manager\nGroup manager\nUser\nView organization-wide analytics\n✔\n✔\n✔\n✔\nView group analytics\n✔\n✔\n✔\nAdd, edit, and remove custom analytics filters\n✔\n✔\nStyle rules\nAdmin\nAccount manager\nGroup manager\nUser\nView style rule sets\n✔\n✔\n✔\n✔\nCreate, modify, and delete organization-wide rule sets\n✔\n✔\nCreate, modify, and delete group-wide style rule sets\n✔\n✔\n✔\nAdd, edit, and delete organization-wide style rules\n✔\n✔\nAdd, edit, and delete group-wide style rules\n✔\n✔\n✔\nWriting preferences\nAdmin\nAccount manager\nGroup manager\nUser\nView writing preferences\n✔\n✔\n✔\n✔\nCreate, modify, and delete writing preference sets\n✔\n✔\nTurn organization-wide writing preferences on or off\n✔\n✔\nTurn group-wide writing preferences on or off\n✔\n✔\n✔\nSnippets\nAdmin\nAccount manager\nGroup manager\nUser\nView organization-wide and group-wide snippets\n✔\n✔\nView assigned snippets\n✔\n✔\nCreate, edit, and delete organization-wide snippets\n✔\n✔\nCreate, edit, and delete group-wide snippets\n✔\n✔\n✔\nCreate, edit, and delete personal snippets\n✔\n✔\n✔\n✔\nBrand tones\nAdmin\nAccount manager\nGroup manager\nUser\nView brand tone profiles\n✔\n✔\n✔\n✔\nCreate, modify, and delete tone profiles\n✔\n✔\nAdd, edit, and delete organization-wide tones\n✔\n✔\nAdd, edit, and delete group-wide tones\n✔\n✔\n✔\nGenerative AI\nAdmin\nAccount manager\nGroup manager\nUser\nChange organization-wide preferences\n✔\nChange personal preferences (if generative AI is activated by the admin)\n✔\n✔\n✔\n✔\nHow to assign roles\nYou can assign a role to a team member by following these steps:\nGo to the\nMembers\npage.\nClick on a team member’s account.\nIn the window that appears next, select a preferred role from the dropdown menu under\nRole\nand click\nSave\n.\nTo assign a role to several team members at once, follow these steps:\nGo to the\nMembers\npage.\nSelect team members by checking the boxes next to their email addresses and click\nChange role\nat the bottom of the page.\nIn the window that appears next, select the preferred role in the dropdown menu and click\nSave\nto confirm the action.\nTeam members can also be assigned to a role as a part of\nSAML Single Sign-On\n.\nRelated articles\nInvite team members\nOrganize team members into groups\nAbout custom roles",
  "category": "Manage Members & Permissions",
  "tags": []
}