{
  "url": "https://support.grammarly.com/hc/en-us/articles/6580956538765-I-can-t-log-in-to-Grammarly-for-Windows-and-Mac-or-it-logs-me-out-all-the-time",
  "scraped_at": "2025-08-11T20:30:02.523177+00:00",
  "title": "I can’t log in to Grammarly for Windows and Mac or it logs me out all the time",
  "content": "This issue may occur when specific browser settings or extensions block Grammarly for Windows and Mac from receiving a confirmation that you have logged in successfully.\nIf you noticed that you're constantly logged out, even though you've previously logged in to your Grammarly account, or that the login attempt doesn't go through successfully, we suggest the following troubleshooting steps:\nWindows\nRight-click on the white Grammarly button in the system tray and select\nSettings\n:\nClick\nSign in\nin the same window.\nWhen the application opens your browser, please copy the URL of the sign-in page.\nOpen a different browser and paste the URL into that browser to complete the sign-in process:\nIf the issue persists, please reinstall Grammarly via a different browser by following the steps below:\nRight-click the\nStart\nbutton in the lower-left corner of the screen and select\nApps and Features\nin the menu that appears. Click on\nGrammarly Desktop for Windows\nand select\nUninstall\n.\nOpen a different browser and download the installation file by following\nthis link\n.\nOnce the file is downloaded, click\nRun\nin the pop-up menu that appears at the bottom of the screen. Alternatively, locate the file on your computer and click on it.\nWhen the installation is complete, click\nLog in to existing account\nand enter your login credentials.\nmacOS\nClick the Grammarly button in the menu bar located at the top of your screen and select\nSettings:\nClick\nSign in\nin the same window.\nWhen the application opens your browser, please copy the URL of the sign-in page.\nOpen a different browser and paste the URL into that browser to complete the sign-in process:\nIf the issue persists, please reinstall Grammarly via a different browser by following the steps below:\nClick the Grammarly icon in the menu bar and select\nQuit\n.\nGo to\nFinder\n>\nApplications\n.\nFind Grammarly Desktop on the list and move it to\nTrash\n(or\nBin\n).\nNote:\nIf you don’t have administrative privileges, open\nFinder\nand press\nCommand+Shift+G\nto locate the app.\nOpen a different browser and download the installation file by following\nthis link\n.\nOnce the file is downloaded, follow the on-screen instructions to install it.\nWhen the installation is complete, click\nLog in to existing account\nand enter your login credentials.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}