{
  "url": "https://support.grammarly.com/hc/en-us/articles/8341171286541-Configure-Managed-Mode",
  "scraped_at": "2025-08-11T20:38:05.394017+00:00",
  "title": "Configure Managed Mode",
  "content": "Managed Mode ensures that only the users who belong to your organization’s Grammarly Business subscription can sign in to Grammarly’s product offerings. When this setting is activated, company employees won’t be able to use their personal Grammarly accounts at work.\nManaged Mode will also deactivate the clients and stop sending text to our servers if:\nThe user is not logged in\nThe user is logged in but is not part of the relevant organization\nNote:\nUsers will still be able to log in with personal accounts through our sign-in page; however, they won’t be able to use the clients.\nActivating Managed Mode\nPrerequisite:\nSSO needs to be activated for your organization, and you will also need a Grammarly Enrollment Token. To obtain a Grammarly Enrollment Token, please go to the\nManaged Mode\npage in your account, or contact your Customer Success Manager. Alternatively, please contact the\nGrammarly Support team\n.\nGrammarly for Windows\nThe following key and string value need to be configured in the registry:\n[HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Grammarly\\DesktopIntegrations]\n\"GrammarlyEnrollmentToken\"=\"UUID\"\nwhere UUID is your Grammarly Enrollment Token with value type “REG_SZ”.\nThis change will switch Grammarly for Windows to Managed Mode; the Grammarly for Windows floating button will become gray, and the mode will prevent Grammarly for Windows from checking text until users sign in with the accounts provided by the organization.\nGrammarly for Mac\nIf using JAMF or a similar tool, you can deploy a custom configuration profile (\nsee instructions\n) with the following Preference domain: com.grammarly.ProjectLlama\nThe configuration profile template:\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\">\n<plist version=\"1.0\">\n<dict>\n<key>GrammarlyEnrollmentToken</key>\n<string>UUID</string>\n</dict>\n</plist>\nwhere UUID is your Grammarly Enrollment Token.\nThis change will switch Grammarly for Mac to Managed Mode; the Grammarly for Mac floating button will become gray, and the mode will prevent Grammarly for Mac from checking text until users sign in with the accounts provided by the organization.\nGrammarly for Chrome (Windows)\nThe following key needs to be configured in the Windows Registry:\n[HKEY_LOCAL_MACHINE\\Software\\Policies\\Google\\Chrome\\3rdparty\\extensions\\kbfnbcaeplbcioakkpcpgfkobkghlhen\\policy]\nThe string value should include the following value:\n\"GrammarlyEnrollmentToken\"=\"UUID\"\nNote:\nkbfnbcaeplbcioakkpcpgfkobkghlhen\nis the ID of the official Grammarly for Chrome extension, and UUID should be replaced with your Grammarly Enrollment Token with value type “REG_SZ”.\nGrammarly for Chrome will switch to Managed Mode when it discovers a valid enrollment token and obtains the settings for your organization from our servers.\nOnce this is configured, here is what will change:\nInstead of a regular “Sign in” button, it will show a “Sign in with SSO” button that leads directly to the IdP URL.\nAfter login, it will display the “Managed by ...” label at the bottom of the extension’s pop-up dialog (the one that you see when clicking the G icon in Chrome’s extensions bar). Hovering over the company name would also display the enrollment token that it read from the settings.\nNote:\nMake sure to restart the Chrome browser after modifying the registry for this change to take effect. For Windows 11, you will need to reboot or reload policies by accessing chrome://policy/ in Chrome.\nGrammarly for Chrome (Mac)\nThis can be done by creating a .plist file in the /Library/Managed Preferences/{username} folder.\nFile name:\ncom.google.Chrome.extensions.kbfnbcaeplbcioakkpcpgfkobkghlhen.plist\nFile contents:\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\">\n<plist version=\"1.0\">\n<dict>\n<key>GrammarlyEnrollmentToken</key>\n<string>UUID</string>\n</dict>\n</plist>\nNote:\nMake sure to replace UUID with your Grammarly Enrollment Token.\nFinally, convert the XML file to binary using the following terminal command:\nplutil -convert binary1 {filename} com.google.Chrome.extensions.kbfnbcaeplbcioakkpcpgfkobkghlhen\nIf using JAMF or a similar tool, you can deploy a custom configuration profile (\nsee instructions\n) with the following Preference domain:\ncom.google.Chrome.extensions.kbfnbcaeplbcioakkpcpgfkobkghlhen\nYou can then upload a .plist file with the file contents shown above. The file should be in XML format.\nGrammarly for Chrome (Chromebooks)\nIn the Google Admin panel, go to\nApps & Extensions\n.\nNavigate to the\nUsers & browsers\ntab and click on\nGrammarly\nto open additional settings.\nFind\nPolicy for extensions\nand paste the following text, where UUID is your Grammarly Enrollment Token:\n{\"GrammarlyEnrollmentToken\":{\"Value\":\"UUID\"}}\nThen, save the changes.\nNote:\nYour UUID can be found on your\nManaged Mode\npage when you unfold the\nShow configuration details\nsection\n.\nGrammarly for Edge (Windows)\nThe following key needs to be configured in the Windows Registry:\n[HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Edge\\3rdparty\\extensions\\cnlefmmeadmemmdciolhbnfeacpdfbkd\\policy]\nThe string value should include the following value:\n\"GrammarlyEnrollmentToken\"=\"UUID\"\nNote:\ncnlefmmeadmemmdciolhbnfeacpdfbkd is the ID of the official Grammarly for Edge extension, and UUID should be replaced with your Grammarly Enrollment Token with value type “REG_SZ”.\nGrammarly for Edge will switch to Managed Mode when it discovers a valid enrollment token and obtains the settings for your organization from our servers.\nNote:\nMake sure to restart the Edge browser after modifying the registry for this change to take effect.\nGrammarly for Edge (Mac)\nThis can be done by creating a .plist file in the /Library/Managed Preferences/username folder.\nFile name:\ncom.microsoft.Edge.extensions.cnlefmmeadmemmdciolhbnfeacpdfbkd.plist\nFile contents:\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\">\n<plist version=\"1.0\">\n<dict>\n<key>GrammarlyEnrollmentToken</key>\n<string>UUID</string>\n</dict>\n</plist>\nNote:\nMake sure to replace the UUID with your Grammarly Enrollment Token.\nThe last step is to deploy your .plist file to your users’ Mac devices using your preferred MDM provider, such as Microsoft Intune. For instructions, see\nDeploy your plist\n.\nFor Jamf, upload the .plist file as a Custom Settings payload.\nGrammarly for Firefox (Windows)\nThis can be done by creating a JSON file following the Firefox\nManaged storage manifests instructions\n.\nUnder the data section, add “GrammarlyEnrollmentToken”=“UUID”, where UUID is your Grammarly Enrollment Token.\nUnder the name section, add the Firefox extension ID: 87677a2c52b84ad3a151a4a72f5bd3c4@jetpack\nFile content example:\n{\n\"name\": \"87677a2c52b84ad3a151a4a72f5bd3c4@jetpack\",\n\"description\": \"ignored\",\n\"type\": \"storage\",\n\"data\":\n{\n\"GrammarlyEnrollmentToken\": \"UUID\"\n}\n}\nSave and put this file in any location on the computer.\nCreate a registry key with the following name:\n[HKEY_CURRENT_USER\\SOFTWARE\\Mozilla\\ManagedStorage\\name]\nwhere\nname\nequals the\nname\nvalue from the file. The key should have a single default value, which is the path to the file.\nNote:\nMake sure to restart the Firefox browser after modifying the registry for this change to take effect.\nGrammarly for Firefox (Mac)\nThis can be done by creating a JSON file following the Firefox\nManaged storage manifests instructions\n.\nUnder the data section, add the “GrammarlyEnrollmentToken”=“UUID”, where UUID is your Grammarly Enrollment Token\nUnder the name section, add the Firefox extension ID: 87677a2c52b84ad3a151a4a72f5bd3c4@jetpack\nFile content example:\n{\n\"name\": \"87677a2c52b84ad3a151a4a72f5bd3c4@jetpack\",\n\"description\": \"ignored\",\n\"type\": \"storage\",\n\"data\":\n{\n\"GrammarlyEnrollmentToken\":\"UUID\"\n}\n}\nFor global visibility, save and put this file in:\n/Library/Application Support/Mozilla/ManagedStorage/<name>.json\nFor per-user visibility, save and put this file in:\n~/Library/Application Support/Mozilla/ManagedStorage/<name>.json\nNote:\nMake sure to restart the Firefox browser after modifying the registry for this change to take effect.\nGrammarly for iPhone and iPad\nManaged mode on iOS is configured similarly to Grammarly for Mac, where\nApple Configuration Profiles\nare used to manage iOS devices. Typically, IT team deploys configuration profiles to organization’s devices using centralized endpoint management software, such as Jamf.\nProperty List:\n<dict>\n<key>GrammarlyEnrollmentToken</key>\n<string>UUID</string>\n</dict>\nJamf configuration:\nAdd the\nGrammarly — Keyboard & Editor\napp to the\nMobile Device Apps\nlist.\nConfigure\nDistribution Method\n,\nScope\n, and other settings according to your organization’s preferences.\nUnder the\nApp Configuration\ntab, add PLIST and replace {UUID} with the UUID defined when enabling SSO for your organization.\nPush the\nApp Configuration\nto your organization’s devices, which will switch the Grammarly Keyboard & Editor app to Managed Mode.\nOnce Manage Mode is activated, users will be shown a screen prompting them to re-login with their organizational accounts. The Grammarly Keyboard & Editor app will allow sign-ins only using SSO.\nGrammarly for Microsoft Office (Windows)\nThe following key and string value need to be configured in the registry:\n[HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Grammarly\\OfficeAddin]\n“GrammarlyEnrollmentToken”=“UUID”\nwhere UUID is your Grammarly Enrollment Token with value type “REG_SZ”.\nGrammarly for Microsoft Office will switch to Managed Mode when it discovers a valid enrollment token and obtains the settings for your organization from our servers. You can confirm this by clicking on the “About” option as seen below for Outlook.\nNote:\nUsers will need to restart Microsoft Outlook and Word after modifying the registry for this change to take effect.",
  "category": "Configure Access & Security",
  "tags": []
}