{
  "url": "https://support.grammarly.com/hc/en-us/articles/4412825587085-Grammarly-for-Windows-or-Grammarly-for-Mac-disappeared",
  "scraped_at": "2025-08-11T20:44:26.401047+00:00",
  "title": "Grammarly for Windows or Grammarly for Mac disappeared",
  "content": "Important:\nSometimes, this issue can be solved by simply restarting your computer. Make sure that you do so before proceeding to the steps below.\nIf Grammarly for Windows or Grammarly for Mac disappears intermittently or crashes, check out this article instead:\nGrammarly for Windows or Grammarly for Mac crashes\n.\nIf Grammarly doesn’t appear as you type, follow these steps:\nWindows\nCheck if Grammarly was turned off for any websites or apps:\nFind the Grammarly icon in the system tray (located in the lower-right corner of your screen near the system tray clock). Click it and choose\nSettings:\nIf the Grammarly icon is not in your system tray, click\nType\nhere\nto search\nnext to the\nStart\nmenu, type in \"Grammarly\", and launch the Grammarly app. Alternatively, double-click the Grammarly thumbnail on your desktop. Then, click\nSettings\nin the window that appears on your screen:\nSelect the\nBlock List\ntab. If Grammarly is deactivated for certain websites or apps, the list of such websites and apps will appear in this tab.\nRestart Grammarly:\nFind and click the Grammarly icon in the system tray (located in the lower-right corner of your screen), and choose\nQuit Grammarly:\nClick\nType here to search\nnext to the\nStart\nmenu, type in \"Grammarly\", and launch the Grammarly app. Alternatively, double-click the Grammarly thumbnail on your desktop.\nRestart the app or refresh the website where you are currently editing your text.\nReinstall Grammarly as described in this article:\nHow do I reinstall Grammarly for Mac or Grammarly for Windows?\nIf none of the above helps, please submit a support request at\nContact Support\n. To expedite the resolution of the issue, we recommend that you retrieve and attach the\nGrammarly for Windows logs\nand a video recorded while retrieving them.\nMac\nNote:\nThe floating Grammarly icon was replaced by the Grammarly tab on the right edge of your screen.\nIf you can’t find the Grammarly tab when hovering over the right edge of your screen, please click the Grammarly icon in the menu bar and check whether you have the option to\nTurn on Grammarly tab\n:\nAdditionally, the Grammarly tab is only available when Grammarly's generative AI assistance is turned on for your account. You can turn on generative AI features in the\nFeature customization\npanel of your account settings.\nIf you don’t see underlines or can’t use Grammarly in a particular application or website, we recommend that you follow the instructions below:\nCheck if Grammarly is turned off for any websites or apps:\nFind the Grammarly icon in the menu bar at the top of your screen, and click\nSettings:\nIf there’s no Grammarly icon in your system menu bar, open\nLaunchpad\nand select\nGrammarly Desktop\n. Alternatively, open\nFinder\n, select\nApplications\nin the\nFinder\nsidebar, and double-click\nGrammarly Desktop\n. Then, click\nSettings\nin the window that appears on your screen:\nSelect the\nBlock List\ntab. If Grammarly is deactivated for certain websites or apps, the list of those websites and apps will appear under\nBlocked by you\nor\nBlocked by admin\n.\nRestart Grammarly:\nFind and click the Grammarly button in the menu bar located at the top of your screen, and choose\nQuit:\nOpen\nLaunchpad\nand select\nGrammarly Desktop\n. Alternatively, open\nFinder\n, select\nApplications\nin the Finder sidebar, and double-click\nGrammarly Desktop\n.\nRestart the app or refresh the website where you are currently editing your text.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}