{
  "url": "https://support.grammarly.com/hc/en-us/articles/23896396976781-Ask-your-admin-to-enable-app-actions",
  "scraped_at": "2025-08-11T20:31:32.108537+00:00",
  "title": "Ask your admin to enable app actions",
  "content": "App actions is a new Grammarly feature. With app actions, you can take the next step in your workflow from wherever you’re writing, whether you need to:\nDrive projects forward with Asana, Jira, monday.com, or Smartsheet\nQuickly access and share files from Microsoft OneDrive and Sharepoint\nSchedule meetings or share your availability with Calendly\nBring your writing to life by inserting images with Giphy or Unsplash\nQuickly create or reference HubSpot CRM contacts\nIf you see the app action you wish to use, but you’re unable to connect or are seeing error messages, it’s most likely due to your organization’s settings for that app. You will need to contact someone who administers third-party applications for your team.\nHere’s a message you can send your site administrator or IT team:\nPlease set up Grammarly's new feature, app actions, for our team by allowing Grammarly to connect with our workplace tools.\nThis support article\noutlines how this feature can save our team time and improve our focus. It also gives simple instructions for quickly enabling these integrations. In some cases, that means going into the admin settings for an app and making a change to approve connections from Grammarly. Thank you!\nSpecific instructions for app actions that may require help from your admin that may require authorization are below:\nAsana\nYou may encounter an error if your Asana administrator has turned on the\nRequire app approval\nsetting. The Asana admin will need to follow these instructions to approve Grammarly:\nApp management and integrations\nJira\nYou may encounter an error if your Atlassian administrator has turned on the\nRequest feature\nsetting. The site administrator will need to approve user requests to use Grammarly. More information can be found at\nManaging user requests for Marketplace apps\n.\nConfluence\nYou may encounter an error if your Atlassian administrator has turned on the\nRequest feature\nsetting. The site administrator will need to approve user requests to use Grammarly. More information can be found at\nManaging user requests for Marketplace apps\n.\nHubSpot\nAsk your HubSpot administrator to authorize Grammarly. To request to authorize Grammarly, your admin will need to follow these steps:\nInstall an app\n. If you or your admin have additional questions about connecting third-party apps to HubSpot, please reach out to\nHubSpot Support\n.\nMicrosoft 365\nAsk your Microsoft administrator to authorize Grammarly. To authorize Grammarly, your Microsoft administrator will need to follow these steps:\nReview admin consent requests\n.\nIf you have additional questions about connecting third-party apps to Microsoft, please reach out to\nMicrosoft Support\n.\nSmartsheet\nIf you’re unable to connect Smartsheet, please reach out to\nSmartsheet Support\nfor assistance.\nmonday.com\nIf you encounter the {\"\"error\":\"invalid_scope\",\"error_description\":\"Invalid scope param\"} error, please ensure that you have authorized Grammarly to connect with your monday.com account by following\nthis link\n. If your monday.com account is managed by your organization, ask your administrator to authorize Grammarly via the same link.\nIf you have additional questions about connecting third-party apps to monday.com, please reach out to\nmonday.com Support\n.",
  "category": "Generative AI assistance",
  "tags": []
}