{
  "url": "https://support.grammarly.com/hc/en-us/articles/360038523451-Does-Grammarly-offer-discounts",
  "scraped_at": "2025-08-11T20:40:09.338065+00:00",
  "title": "Does Grammarly offer discounts?",
  "content": "We offer discounts to some of our email subscribers through occasional promotional offers. To stay up to date on our promotions, we encourage you to subscribe to our special offer emails.\nNote:\nYou can manage your subscription to our mailing list on your\nProfile\npage.\nWe also offer a 40% discount through\nSheerID\nfor the following groups:\nGrammarly for Students\nGrammarly for Educators (K–12 faculty)\nGrammarly for Educators (University/Post-secondary faculty)\nGrammarly for Young Adults\nGrammarly for Military\nGrammarly for First Responders\nGrammarly for Healthcare Workers\nGrammarly for Seniors\nSheerID may ask you to provide an official document issued by your organization or institution to verify that your credentials are valid. This process can take up to seven business days.\nOnce your status is verified, you will receive an email from SheerID (verify@sheerid.com) with your Grammarly discount in the form of a promo link. You can use the promo link to upgrade with your preferred email address, regardless of the email address you used to apply for this promotional offer.\nIf your application was not approved, you can contact\nSheerID Support\nfor more information. Grammarly does not have any control over the verification process.\nIf your organization or institution is not listed in the application form, please review this article:\nI can’t request a discount on SheerID because my organization or school is not on the list\nNote:\n- Grammarly promo offers are valid for one subscription period only. If you upgrade at a promotional rate, your subscription will be set to renew at a standard rate.\n- Promo offers apply to the first seat only. Additional seats are charged at a standard rate.\n- Promo offers cannot be combined with other offers, and cannot be applied to previous purchases or purchases made via the App Store or Google Play Store.\nIf you’re having trouble using a promo link, try opening an incognito window in your browser and clicking the link again. Check out this article for detailed instructions:\nHow do I open my browser in incognito mode?\nIf you encounter any payment issues, please review this article:\nWhy am I seeing a message that there is a problem with my payment?\nNote:\nGrammarly does not provide discounts in the form of coupons or other codes. If you found a promo code online, it is not a promotional offer from Grammarly.",
  "category": "How to Upgrade",
  "tags": []
}