{
  "url": "https://support.grammarly.com/hc/en-us/articles/38552519578893-Reader-Reactions-user-guide",
  "scraped_at": "2025-08-11T20:43:12.578028+00:00",
  "title": "Reader Reactions user guide",
  "content": "The Reader Reactions agent is like a trusted teammate you bounce ideas off of before hitting send. Once you identify your target reader—such as your manager or client—this agent simulates how they might interpret your message. It predicts key takeaways, open questions, and potential confusion based on their predefined role and the substance of your writing, then offers revisions so you can refine your work with accuracy and confidence before sharing.\nThe Reader Reactions agent is available for Grammarly Pro and Grammarly Premium subscribers in\ndocs\n. Users of Grammarly Free have access to a limited number of suggestions each day.\nHow to use\nTo have the Reader Reactions agent check your text, click the Reader Reactions icon on the right-hand agents tab:\nThe agent will scan your text and automatically infer the target audience based on the content and style of the writing. However, you can always click the “audience” button on the top-right of the screen to choose a different audience that better fits the writing task:\nOnce you’ve selected an audience, the Reader Reactions agent will scan the full document and provide a brief summary of the writing quality and what is likely to resonate with the reader. Review the feedback on what this audience type will remember from your text and consider the potential questions the selected group might ask based on the details presented in your text.\nHover over the bars on the left side of your text to see suggested actions for customizing your message for the target audience. Clicking the\nShow example\nbutton will provide a suggestion on how to improve your text. You can either insert the suggested example or dismiss it and create your own version, adjusting it based on the Reader Reactions agent's suggestions:",
  "category": "Agents",
  "tags": []
}