{
  "url": "https://support.grammarly.com/hc/en-us/articles/36973362047501-I-need-to-change-my-team-members-email-addresses",
  "scraped_at": "2025-08-11T20:40:50.355845+00:00",
  "title": "I need to change my team members’ email addresses",
  "content": "Admins of team subscriptions cannot change their team members’ Grammarly account email addresses. In addition, individuals who are part of a team subscription are not allowed to change the email address associated with their Grammarly account.\nHowever, you can enable your team members to update their Grammarly account email addresses by temporarily removing them from your organization’s subscription.\nClick here for instructions on removing members\nGo to the\nMembers\npage.\nCheck the boxes next to the members you’d like to remove and click\nRemove\nin the lower-left corner of the page.\nIn the window that appears, click\nRemove members\nto confirm the action.\nThen, your team members can change their email addresses by following the steps from this article:\nI need to change my email address\nAfterward, you can invite them back to your organization’s subscription using their updated email addresses.\nIf SAML single sign-on is enabled\nIf your organization uses SAML single sign-on for its Grammarly subscription, you’ll need to grant your team members access to Grammarly under their new email addresses in your identity provider. New Grammarly accounts will be automatically created for your team members once they sign in through your identity provider next time.\nTeam members who want to keep their existing Grammarly accounts can update their email addresses once their accounts are removed from the organization’s subscription and then sign in through the identity provider.\nIf SCIM provisioning is enabled\nIf you have enabled SCIM provisioning or this feature is included in your plan, you can update your team members’ Grammarly account email addresses through your identity provider. To activate email change via SCIM, please reach out to your Customer Success Manager or\ncontact Support\n.\nNote:\nSCIM provisioning is available in the Grammarly Enterprise plan. Interested in upgrading to an Enterprise account?\nContact our Sales team\n.",
  "category": "Resolve Issues",
  "tags": []
}