{
  "url": "https://support.grammarly.com/hc/en-us/articles/8327686426637-How-to-deploy-Grammarly-for-Microsoft-Office",
  "scraped_at": "2025-08-11T20:48:10.749346+00:00",
  "title": "How to deploy Grammarly for Microsoft Office",
  "content": "You can silently install Grammarly for Microsoft Office on multiple computers at once using a managed software solution or deployment mechanism.\nWhat to consider:\nThe addin will be installed to %LOCALAPPDATA%/Grammarly for user-level installs and  %ProgramFiles%/Grammarly or %ProgramFiles(x86)%/Grammarly for machine-level installations.\nEvery member maintains their own version.\nAutomatic updates are downloaded and installed for each member.\nFor machine-level installations, end users need administrative privileges to install an update.\nThe add-in will be available after restarting Microsoft Word or Outlook.\nDeploying Grammarly for Microsoft Office Using SCCM (Windows)\nBefore you begin, if you have activated SSO, make sure Managed Mode is configured. For detailed instructions, see\nthis article\n.\nFirst, download Grammarly for Microsoft Office\ninstaller\n. The installer file should be named “GrammarlyAddInSetup.exe”.\nCreate the installation package:\nOn the\nProduct Type\ntab, choose\nStandard program\n, and click\nNext\n.\nSpecify the information about installation. In the\nCommand line\nfield, use the following options for each installation type:\nUser-level install (preferred):\nGrammarlyAddinSetup.exe /silent\nMachine-level install: GrammarlyAddinSetup.exe /fastforallmode /silent\nWe also recommend adding the /autostart parameter so that the add-in opens automatically when a user opens a document in Word or a new email in Outlook.\nSet run options:\nFinish the package installation:\nDeploy the newly created package on the client machines:\nNote:\nIf you would like to deploy the add-in for just Word or Outlook, you can add the /word or /outlook parameters to the installation command. For example: GrammarlyAddinSetup.exe /silent /word\nDeploying Grammarly for Microsoft Word on Mac Using Office 365 Admin Center (Mac)\nBefore you begin, confirm that your organization meets all requirements for using centralized deployment, as described in this article:\nDetermine if Centralized Deployment of add-ins works for your Office 365 organization\nIf your organization meets all requirements, complete the following steps to publish an Office Add-in via Centralized Deployment:\nIn the admin center, go to the\nSettings\n>\nAdd-ins\npage.\nSelect\nDeploy Add-in\nat the top of the page.\nOn the overview page, select\nNext\n.\nSelect\nI want to add an Add-In from the Office Store\n.\nSearch for the “Grammarly” add-in and select it.\nOn the next page, select\nEveryone, Specific users/groups\n, or\nJust me\nto specify who the add-in is deployed to. Use the Search box to find the users or groups that you want to deploy the add-in to.\nSelect\nDeploy\n. This process may take up to three minutes. Then, finish the walkthrough by pressing\nNext\n. You now see your add-in along with other apps in Office 365.\nFor more information, see the\nofficial guide\n.\nUpdate behavior\nDepending on the installation type, users should expect the following behavior:\nUser-level: Users won’t see any notifications, the update will install silently, and the new version becomes available after relaunching Word or Outlook.\nMachine-level: A notification (with an  “install” button) is displayed, and users will need administrative privileges to install the update.",
  "category": "Deployment Guide for IT Teams",
  "tags": []
}