{
  "url": "https://support.grammarly.com/hc/en-us/articles/28936304999949-AI-Detector-user-guide",
  "scraped_at": "2025-08-11T20:46:16.067130+00:00",
  "title": "AI Detector user guide",
  "content": "The AI detection feature is created to empower our users with tools for responsible AI usage. It is your authenticity safeguard—it identifies text written and/or modified by major AI models, like ChatGPT, Claude, and Gemini, helping you ensure originality and meet academic, editorial, or institutional standards. Whether you're verifying your own work or reviewing others’, this feature adds clarity and confidence to the presubmission and review process.\nAI detection is a paid feature that is available in several parts of the Grammarly experience, depending on your plan:\nVia an agent in docs, Grammarly’s AI writing surface (Premium/Pro users; learn more below)\nVia the Grammarly browser extension within Google Docs (Premium, Pro, Grammarly Business, and Grammarly for Education plans)—Once you install the Grammarly browser extension on your preferred web browser, you’ll be able to access AI Detection from the “Check for plagiarism and AI text” entry point within the Grammarly suggestion panel in Google Docs:\nVia the Grammarly for Mac and Grammarly for Windows desktop clients (Premium, Pro, Grammarly Business, and Grammarly for Education plans)—Once you install Grammarly on your preferred desktop, you’ll be able to access AI Detection from the plagiarism checker feature within Microsoft Word. To check your document for plagiarism and to see if some of the content may be flagged as AI-generated, open the Grammarly widget and click the quotation marks icon:\nGrammarly will then show the probability of your text being flagged as AI-generated and underline the questionable text:\nEach entry point offers the same value: Grammarly’s AI detection shows the percentage of text that appears AI-generated and offers guidance on interpreting the results responsibly. Although it doesn't explain why the text may be flagged, it helps users gauge, before submission, the likelihood of their text being flagged. The percentage result should not be used as an objective source of truth, as AI detection of any kind can be prone to errors.\nUsing the AI Detection agent within docs, Grammarly’s AI writing surface\nIf you’re a Grammarly Pro or Grammarly Premium user, the AI detection feature is available to you as the AI Detector agent in docs, Grammarly’s AI writing surface.\nTo initiate the agent, click the AI Detector icon in the side panel on the right:\nGrammarly will then display the likelihood of parts of your text being flagged as AI-generated, with separate sections marked using the bars on the left side panel:\nIf you use generative AI when working on your text, AI Detector offers you an option to generate a citation. Simply click on the Generate citation button, which will take you to\nthe citation generator\n, which will help you get well-formatted APA, MLA, and Chicago-style citations.\nAs you move through the specific passages that were flagged by the AI Detector agent as possibly AI, you can click the Mark as added button if you choose to add citations. The count on the right-hand side of the screen in docs will update in real time, helping you track where you’ve made modifications to your text and/or added a citation.\nNote:\nIf you are working with other Grammarly agents in docs to rewrite your text, it is likely that the AI Detection agent will flag your content as AI-generated. That is because rewrites from the Proofreader, Expert Review, Paraphraser, and Humanizer agents come from our LLM. If you are concerned about being flagged for inappropriate AI use, we suggest that you refrain from using our agents to rewrite your content; instead, focus on using agents to guide feedback that you manually incorporate.\nDetailed FAQs\nWhat does the % score mean?\nThe score represents the percentage of scanned text that is likely AI-generated, based on our extensive machine learning training model. Our model is trained on hundreds of thousands of human and AI-generated texts. Grammarly breaks your text into smaller sections, checking each section against the model for patterns that are typically present in AI text (language patterns, syntax, and complexity). Grammarly then returns a percentage score, indicating how much of the provided text appears AI-generated. It assesses whether text resembles AI-generated writing; like other AI text checkers, it cannot provide a definitive conclusion.\nHow accurate is the score?\nThe AI detection score is an averaged estimate of the amount of AI-generated text that is likely contained in a given document or piece of writing. Rigorous testing was done to ensure that the model is directionally accurate at identifying AI-generated text. Shorter passages are slightly harder to measure for an accurate score than longer passages.\nLike all AI detectors, the AI detection feature is not 100% accurate and should not be used as a definitive assessment of whether AI-generated text is present. The score itself should be viewed as an average estimate rather than a definitive percentage assessment.\nI have not used AI-generated text in my document, but Grammarly is still saying that I have AI text in my writing. Why?\nThe AI detection model is optimized to minimize false positives, as we believe that incorrectly identifying human-generated text as AI-generated is more detrimental than failing to accurately catch AI-generated text. That said, there may be instances in which the human-generated language patterns, syntax, and complexity mirror those of AI-generated text more closely. We expect these instances to be very rare, but as with any AI detector, the results should always be viewed within a broader context and not taken as an objective source of truth.\nIf my professor uses a different AI detector to scan student writing, will the percentage score be the same?\nThe AI detection feature uses a proprietary in-house model, so the scores may differ from those of other solutions like Turnitin, GPTZero, Copyleaks, and others. You should not view any scores from Grammarly’s AI detection as a clear indication that your professor will see the same score when they run it through their preferred AI detector. However, our model is trained similarly to some of the other most accurate and used detectors, so we believe the scores should be directionally aligned.\nHow does AI detection distinguish between AI-generated content, content that is modified by generative AI, and human-written text that is edited with other agents?\nBecause our AI detection model has been trained solely on human-generated and AI-generated text from LLM providers, traditional, nongenerative corrections in the form of Grammarly red and blue underlines should typically not impact the percentage score. However, using more sophisticated Grammarly writing agents in docs, including the Grammarly proofreader, or using the Grammarly generative AI assistant in Google Docs and Word to meaningfully rewrite sentences and full paragraphs will raise the percentage score. The model is also more likely to assign a higher percentage of AI-generated text in a given passage if it’s been generated by an outside LLM provider (such as ChatGPT or Gemini). That said, paraphrasing edits with Grammarly and other providers are performed by LLMs, so those actions should still lead to some percentage of AI-generated text being triggered in the AI detection.\nHow can I reduce my document's AI score?\nCurrently, we do not offer a dedicated feature to reduce the AI score in user content. Grammarly users who use the AI detection feature should view the results as a data point in deciding how they may want to edit, rephrase, and attribute sources properly to reduce the risk of inappropriate AI use.",
  "category": "Agents",
  "tags": []
}