{
  "url": "https://support.grammarly.com/hc/en-us/articles/27195639866509-Introducing-extended-style-rules-functionality",
  "scraped_at": "2025-08-11T20:39:21.106342+00:00",
  "title": "Introducing extended style rules functionality",
  "content": "Included in:\nGrammarly Pro, Business, and Enterprise plans\nManaged by:\nAdmins, account managers, group managers, and members with designated custom roles\nWe introduced new style rules features to help you create the most precise and relevant style guide suggestions for your team:\nUse the asterisk symbol (*) as a placeholder in the tex\nt\nCase-sensitive original text\nLowercase replacement text at the start of a sentence\nContext awareness\nRelated materials\nUse the asterisk symbol (*) as a placeholder in the text\nWith this feature, you can use the asterisk symbol (*) as a placeholder for a word in a style rule.\nFor example, instead of specifying “give me the green light” in the\nOriginal text\nfield, you can use text with a placeholder: “give * the green light.” The asterisk symbol will replace any word in the original text so that this style rule will cover “give me the green light,” “give us the green light,” “give her the green light,” etc.\nTo add a placeholder, enter “\n*\n” in the\nOriginal text\nfield and click\nUse “\n*\n” as a placeholder in the text\nin the dropdown menu that appears or press Enter:\nCase-sensitive original text\nWhen creating a style rule, you can mark the text in the\nOriginal text\nfield as case-sensitive. This way, the rule will only apply to text that matches the capitalization of the original text you specified.\nFor example, you can create a rule that suggests replacing the acronym “SOAP” with the full definition—“Simple Object Access Protocol.” If you make the original text case-sensitive, the rule will only be applied when the all-caps “SOAP” acronym is typed; it won’t be activated if your team members write the word “soap.”\nTo create a case-sensitive rule, check the box next to\nOriginal text is case-sensitive\nunder\nFormatting options:\nLowercase replacement text at the start of a sentence\nThis feature lets you specify that the word or phrase you’d like your team to use should not be capitalized at the beginning of a sentence. This is particularly important for brand names or other proper nouns that require specific capitalization.\nFor example, you can create a style rule for your team members to always use the spelling “iPhone,” and mark “iPhone” as lowercase at the beginning of a sentence. This way, Grammarly won’t suggest capitalizing “iPhone” when it’s the first word in a sentence.\nTo use this feature, check the box next to\nReplacement text in lowercase at the start of a sentence\nunder\nFormatting options\n:\nContext awareness\nThis feature allows you to add context keywords to your style rule. In this case, the rule will only be activated if the sentence contains the keywords you added. This can help you ensure your style guide suggestions are provided to your team members in the most appropriate context.\nFor example, if you don’t want your team members to use the word “dictionary” when they’re referring to your company style guide, you can add your company name or other relevant words as context keywords for the corresponding style rule. In this case, your team members will see suggestions not to write “I found it in the company dictionary” or “It’s in the AcmeCo dictionary,” but the rule won’t apply if they write “It’s in the dictionary.”\nTo add context keywords to your style rule, click on\nFormatting options\nand type the words in the field under\nContext awareness\n:\nRelated materials\nYou can link relevant materials to your style rules as a way of providing your team members with additional context or explanations.\nTo add a link to your style rule, click on\nRelated Materials\n, insert the link in the\nLink\nfield, and optionally add the\nDisplay name\n:\nOnce you do so, your team members will see a writing suggestion with a clickable hyperlink:\nTo learn more about the style rules feature, check out this article:\nCreate style rules",
  "category": "Team Features",
  "tags": []
}