{
  "url": "https://support.grammarly.com/hc/en-us/articles/38552281546765-Docs-Grammarly-s-new-AI-writing-surface-user-guide",
  "scraped_at": "2025-08-11T20:32:48.092235+00:00",
  "title": "Docs: Grammarly’s new AI writing surface—user guide",
  "content": "Docs is a new AI-powered writing surface designed to help you brainstorm, compose, edit, and refine documents with ease. Whether you're writing a blog post, crafting a research essay, or preparing a professional report, docs provides a flexible space enriched with Grammarly AI writing agents to support your writing and revision needs.\nWhat you can do in docs\nDocs combines Grammarly’s writing support with a modern, intuitive, and agent-enabled editor. Within a document, you can access a variety of AI-powered agents to help you write clearly, confidently, and efficiently:\nAI Chat\n:\nLets you ask questions, conduct research, rewrite content, generate ideas, or refine messaging instantly using conversational AI embedded into the document surface.\nGrammarly Proofreader\n:\nDelivers real-time suggestions to improve grammar, clarity, tone, word choice, and overall correctness as you write.\nParaphraser\n:\nRewrites your content in a variety of relevant and engaging tones while preserving original meaning.\nExpert Review\n:\nProvides personalized, in-depth feedback from relevant subject matter experts to enhance argumentation strength, structure, and credibility.\nReader Reactions\n:\nPredicts how your selected audience is likely to interpret your content, surfacing potential key takeaways and remaining questions they may ask.\nHumanizer\n:\nTransforms your AI writing to sound natural, genuine, and human. It removes robotic phrasing and keeps your voice authentic for emails, proposals, or blog posts.\nCitation Finder\n:\nExamines the quality and substance of arguments in a piece of writing and identifies publicly available sources that support, conflict with, or contradict the points being made in the writing, with easy-to-find links and pre-formatted citations in APA, MLA, and other common styles.\nAI Detector\n:\nIdentifies sections of text that may have been generated by AI, helping maintain transparency and integrity in your writing.\nPlagiarism Checker\n:\nChecks your content against academic, web, and professional sources to ensure originality and proper attribution.\nAI Grader\n:\nEvaluates writing quality based on predefined inputs based on an instructor and/or rubric—offering a sample “pregrade” and actionable tips for improvement.\nThese tools are built into the docs experience and work seamlessly while you write. You can access them by clicking the side panel with agent icons:\nHow to create a document\nTo create a new document:\nVisit\nhttps://app.grammarly.com\nClick\nNew Doc\nat the top of the page.\nIf you don’t see the option to create a new document, it may be because\ngenerative AI\nis not enabled in your account. To enable it, go to the\naccount hub\n:\nhttps://account.grammarly.com/admin/feature_access\nDocument labels\nDocuments created using the older Grammarly Editor will be marked with a\nClassic\nlabel. New documents created in the current editor will not have this label.\nImportant:\nTitles are not added automatically. Be sure to enter a title when you create a document. This helps improve searchability, especially when working with multiple documents.\nHow to format your text\nThe new writing surface gives you several options to structure and style your content:\nCore capabilities\nWrite in plain or styled formats\nAdd and customize tables\nInsert elements using slash commands (e.g.,\n/table\n,\n/heading\n)\nCreate and nest sections to organize content hierarchically\nKeyboard shortcuts\nSpeed up your workflow with essential shortcuts:\nAction\nmacOS\nWindows\nBold\n⌘+B\nCtrl+B\nItalic\n⌘+I\nCtrl+I\nUnderline\n⌘+U\nCtrl+U\nUndo\n⌘+Z\nCtrl+Z\nRedo\n⇧+⌘+Z\nCtrl+Y\nThese shortcuts work across most document elements and are especially useful when editing text quickly.\nParagraph styles\nYou can style your content using predefined formats:\nUse the\nstyle dropdown\nin the toolbar or type a\nslash command\nto apply:\nHeading 1 (\n/h1\n)\nHeading 2 (\n/h2\n)\nHeading 3 (\n/h3\n)\nQuote (\n/quote\n)\nCode (\n/code\n)\nParagraph (\n/paragraph\n)\nThese styles help structure your document, especially when creating outlines, long-form writing, or instructional content.\nManual text formatting\nYou can also format your text manually using the toolbar or keyboard shortcuts. Available options include:\nBold, italic, underline\nBulleted and numbered lists\nCheckboxes\nInline code and code blocks\nTip:\nYou can select multiple text blocks and apply the same formatting in bulk. This is useful for applying consistent styling across sections of your document.\nUsing the slash ( / ) command\nThe slash command is a versatile tool that lets you insert and format elements without leaving your keyboard. Just type\n/\nand a list of available options will appear.\nYou can use slash commands to:\nApply formatting, such as\n/heading\n,\n/bullet\n, or\n/quote\nInsert content, such as\n/table\nor\n/image\nQuickly search for commands by continuing to type after the slash\nThis feature is especially helpful for users who prefer a keyboard-first experience and want to avoid switching between mouse and keyboard.\nHow to proofread your text\nWhile writing, you’ll notice red underlines appear in your text. These indicate critical suggestions, such as grammar, spelling, or word choice issues. If you’re on a paid plan, you will also likely see blue underlines for more complex clarity and tone suggestions.\nTo review a suggestion:\nClick the underline to open the suggestion card.\nClick the suggestion card to accept or dismiss the suggestion.\nFor a more comprehensive review, open the\nGrammarly Proofreader\nagent. It will analyze your entire document and present recommendations in dynamic categories that are tailored to your writing context.\nTo use the proofreader agent:\nClick the\nbars on the left-hand panel\nof the document.\nReview the suggestions by category.\nHover over suggested changes to preview them in context. You can undo individual edits as needed.\nThis tool is especially useful for in-depth editing, polishing, or preparing your document for publication or sharing.\nTo continue polishing your text, you can also use the other agents: Expert Review, AI Grader, and Paraphraser.\nHow to export your document\nTo export your document:\nClick the\nmenu icon\n(three dots) in the upper-right corner of the docs interface.\nSelect\nPrint & Export\n.\nChoose\nExport to PDF\n.\nIf you prefer to continue editing in another platform, you can copy and paste the content into Google Docs or Microsoft Word.\nNote:\nExport options may expand in the future.\nAdditional features available in docs\nFrom the menu in the upper-right corner, you can also access:\nOutline\n—View the structure of your document based on headings and sections.\nWord count\n—Monitor your document’s length in real time.\nFont size\n—Adjust the text size for improved readability.\nWidth\n—Choose between narrow and wide views, depending on your preference.\nThese features allow for a more personalized and productive writing environment.",
  "category": "Docs",
  "tags": []
}