{
  "url": "https://support.grammarly.com/hc/en-us/articles/360041391992-Managing-your-keyboard-settings-in-Grammarly-for-iPhone",
  "scraped_at": "2025-08-11T20:34:58.708843+00:00",
  "title": "Managing your keyboard settings in Grammarly for iPhone",
  "content": "Grammarly for iPhone offers several ways to customize your writing experience. If you use Grammarly as a keyboard, you can see the list of changes you can apply by opening the Grammarly companion app and tapping\nKeyboard\n:\nNote:\nIf you use the Grammarly Editor on your iPad, please review\nthis article\n.\nCustomization options\nGrammarly for iPhone offers the following customization options:\nKeyboard Layout\nGrammarly for iPhone's \"Keyboard Layout\" feature allows you to customize your keyboard layout according to your preference. It offers a variety of layout options, including QWERTY, QWERTZ, AZERTY, Dvorak, Colemak, and Workman. You can also easily switch between these layouts. This feature is especially useful for those who are familiar with different keyboard layouts or who want to try out new layouts to improve their typing speed and accuracy.\nEmoji Suggestions\nWith this feature, you can easily find and use the perfect emoji to enhance your written communication. As you type, Grammarly suggests relevant emoji based on the words you are using, making it easy to add a bit of fun and personality to any message. Whether you're chatting with friends or sending a professional email, emoji suggestions can help you express yourself in a more engaging and effective way.\nEmoji Key\nThe Emoji Key provides quick and convenient access to a wide range of expressive emoji. When this feature is activated, the Emoji Key appears next to the 123 key on your iPhone keyboard. With a simple tap, you can access a diverse collection of emoji to add personality, emotion, and visual flair to your messages.\nPeriod Key\nWhen this option is turned on, the Period Key appears conveniently between the spacebar and the Return key. With this placement, you can quickly and effortlessly insert periods at the end of sentences without the need for additional taps or switching to a different keyboard layout.\nSynonyms\nThe Synonyms feature in Grammarly for iPhone enriches your writing by providing a quick and convenient way to explore alternative word choices. When this feature is turned on, you can easily access synonyms by placing the cursor next to a word. The synonyms will appear on the top bar of the Grammarly Keyboard.\nSwipe Typing\nThe Swipe Typing feature in Grammarly for iPhone revolutionizes your typing experience by enabling faster and more intuitive text input. With this feature, you can effortlessly compose messages, emails, and documents by gliding your finger across the keyboard instead of tapping individual keys.\nDelete Swipe by Word\nThe Delete Swipe by Word feature in Grammarly for iPhone simplifies the process of deleting text by allowing you to delete entire words with a single swipe. With this feature activated, you can effortlessly remove words or phrases by touching your finger to the Backspace key (the key to the right of \"m\") and immediately sliding it to the left. The farther you slide it, the more words will be selected and deleted. Instead of tediously deleting one character at a time, Grammarly intelligently recognizes your swipe gesture and instantly erases entire words, saving you time and effort.\nCompletions Bar\nThe Completions Bar feature in Grammarly for iPhone enhances your writing efficiency by providing intelligent word suggestions as you type. Located above the keyboard, the Completions Bar dynamically displays relevant word options based on the context of your text. As you type, Grammarly analyzes your input and offers predictive suggestions to help you complete your sentences with accuracy and speed. Simply select a suggested word from the Completions Bar to insert it into your text.\nAuto-Capitaliztion\nGrammarly intuitively recognizes the beginning of sentences, proper nouns, and other instances where capitalization is required. As you type, Grammarly takes care of capitalizing the first letter of each sentence and appropriate names, saving you the effort of manually correcting capitalization errors.\nEnable Caps Lock\nBy enabling this feature, you can turn on the Caps Lock mode within your keyboard, allowing you to type in uppercase without having to hold the shift key continuously. This is especially useful when you need to emphasize a word, write acronyms, or enter text in all caps.\nNote:\nTo activate Caps Lock, double-tap the shift/up arrow key.\nAuto-Correction\nThe Auto-Correction feature in Grammarly for iPhone ensures that your writing is free from spelling mistakes and typos by automatically applying common corrections as you type.\nUndo Auto-Correction\nThis feature provides you with the flexibility to undo the automatically applied corrections and restore your original word or phrase. If you feel that the correction doesn't align with your intended meaning or if you prefer your original text, simply tap the Backspace key to revert the change.\nCharacter Preview\nIf you tap and hold a particular key, Grammarly will display options for that character, such as an \"e\" with different accent marks above it. You can then slide over to the one you need. Whether it's an accented letter, punctuation mark, or other special characters, the Character Preview feature ensures that you choose the right character for your writing needs. This feature helps you avoid mistakes and enhances the accuracy of your text, particularly when working with foreign languages or specific formatting requirements.\nSound Feedback on Keypress\nWith this feature enabled, Grammarly generates a subtle sound effect when you press each key on the keyboard.\nHaptic Feedback on Keypress\nGrammarly utilizes the haptic technology in your iPhone to generate subtle vibrations when you press the keys on the keyboard. The haptic feedback adds a sense of physicality to your typing, creating a satisfying and responsive touch sensation.\nShow Lowercase Keys\nWhen enabled, this option ensures that the keyboard always shows the lowercase letters, regardless of the capitalization state. This helps you maintain a consistent visual reference of the lowercase alphabet, making it easier to recognize and select the appropriate keys while typing.\n“.” Shortcut\nDouble-tapping the spacebar will insert a period followed by a space.\nTo turn any of these options on or off, switch the toggle next to them.\nNote:\nGrammarly for iPhone now supports the native text replacement feature on iOS, allowing you to easily expand abbreviations or shortcuts into full phrases or words as you type. To manage text replacement on your iPhone, tap\nSettings\n>\nGeneral\n>\nKeyboard\n>\nText\nReplacement.\nLanguage Preference and Personal Dictionary\nTo manage your language preference in Grammarly for iPhone, please open the Grammarly companion app and tap\nAccount\n.\nTo learn more about the language preference feature, check\nthis article\n.\nTo access your personal dictionary, go to\nAccount\nand tap\nManage Personal Dictionary\n.\nTo add new words, press the\nPlus\nicon (+) in the upper-right corner of your screen. In the pop-up window, type in the word and select\nAdd\n:\nTo remove a word from your personal dictionary, locate the word you’d like to delete and swipe to the left until the red\nDelete\nbutton appears. Then, tap the\nDelete\nbutton to remove the word.",
  "category": "Grammarly for iPhone",
  "tags": []
}