{
  "url": "https://support.grammarly.com/hc/en-us/articles/11967492973325-Grammarly-s-browser-extension-stopped-working-on-a-specific-website",
  "scraped_at": "2025-08-11T20:45:52.284414+00:00",
  "title": "Grammarly’s browser extension stopped working on a specific website",
  "content": "First, please make sure that the Grammarly browser extension is active. If you see a gray Grammarly icon in your browser's toolbar, click it and switch on\nCheck text with browser extension.\nOther browser extensions can interfere with Grammarly. Try deactivating other extensions that you are using in your browser, restart the browser, and see if the issue persists:\nChrome\nPaste\nchrome:extensions\ninto the address line and press\nReturn\n, then switch off all other extensions except Grammarly.\nSafari\nGo to\nSafari\n>\nPreferences\n(or use\nCommand ⌘\n+\nComma\n), then select the\nExtensions\ntab and untick the boxes next to each extension.\nFirefox\nClick the menu button (the three horizontal lines in the upper-right corner).\nGo to\nAdd-ons\n>\nExtensions.\nTurn off all extensions except Grammarly.\nMicrosoft Edge\nPaste\nedge://extensions\ninto the address line and press Return, then switch off all other extensions except Grammarly.\nIf you're not using any additional extensions or turning them off didn't help, we recommend clearing the browser's cache next:\nChrome\nPaste the following text into your browser's address bar:\nchrome://settings/clearBrowserData\nSet\nTime range\nto\nAll time.\nSelect\nCached images and files.\nClick\nClear Data.\nSafari\nChoose\nSafari\n>\nPreferences.\nClick\nPrivacy\nand\nselect\nManage Website Data...\nClick\nRemove All.\nFirefox\nPaste the following text into your browser's address bar:\nabout:preferences#privacy\nGo to the\nCookies and Site Data\nsection and click\nClear Data...\nSelect\nCached Web Content.\nClick\nClear.\nMicrosoft Edge\nPaste the following text into your browser's address bar:\nedge://settings/clearBrowserData\nSet\nTime range\nto\nAll time.\nSelect\nCached images and files\nand unselect all other options.\nClick\nClear Now.\nIf the issue is still not resolved, we encourage you to try Grammarly for Windows (if you use Windows 10 or newer) or Grammarly for Mac (if you use macOS 10.15 or newer), which integrates with a wide array of applications and websites. To install:\nFollow\nthis link\nto download the app, double-click on the downloaded file, and follow the on-screen prompts to complete the installation.\nOpen any app or website and start typing. You should see the floating Grammarly widget, and Grammarly will automatically begin checking your text.\nTo learn more about Grammarly for Windows and Mac, check out\nthis article\n.",
  "category": "Grammarly Browser Extension",
  "tags": []
}