{
  "url": "https://support.grammarly.com/hc/en-us/articles/4407988470157-Free-trial-eligibility-requirements-for-Samsung-users",
  "scraped_at": "2025-08-11T20:40:02.273799+00:00",
  "title": "Free trial eligibility requirements for Samsung users",
  "content": "Note:\nGrammarly for Samsung Keyboard is available only on select devices running One UI 4.0 and higher. If you’re not sure if your device is compatible, please contact Samsung Support.\nIf you’re the owner of one of the supported Samsung devices and updated to One UI 4.0, Grammarly suggestions are automatically integrated into your Samsung Keyboard, and you will have an opportunity to sign up for a 90-day free trial of Grammarly if you meet the requirements below.\nThis article covers:\nEligibility requirements\nFrequently asked questions\nEligibility requirements\nThis free-trial offering is available to Samsung users who meet the following criteria:\nHave never had a paid Grammarly subscription\nHave not previously signed up for this free trial\nUse the Samsung Keyboard on one of the compatible devices updated to One UI 4.0\nSign up for their free trial through the Samsung Keyboard\nTo start the free trial, ensure that\nGrammarly is activated\non your device and then tap on the three dots in the upper-right corner of the keyboard, and tap the Grammarly icon on a suggestion card.\nIf you don’t have access to or are not eligible for the free trial, you can still use the\nfree version of Grammarly\nthat includes essential Grammarly functionality or\nupgrade your account\n.\nFrequently asked questions\nAm I eligible for the trial if I use the Grammarly Keyboard for Android?\nThis free-trial offering is specifically designed for users of the Samsung Keyboard on select Samsung devices who have not previously had a Grammarly subscription. If this does not apply to you, you can still take advantage of Grammarly’s features by creating a\nfree individual account\n.\nI meet the eligibility requirements for this offering, but I have already paid for a Grammarly subscription. Can I get a refund?\nIf you previously purchased one of Grammarly's paid subscription plans, you are not eligible for this free trial offering.\nIf I have a few Samsung devices that meet the eligibility requirements, am I eligible for multiple free trials?\nNot at this time. Qualifying Samsung users are eligible for this free trial of Grammarly once, regardless of the number of devices they currently own.\nI signed up for a trial, but my credit card was charged. What do I do?\nHere are some reasons why your card may have been charged if you signed up for this free trial:\nYou might see a $1 USD charge on your statement. This is the minimum charge we can apply against a card for validation of both the card and our ability to transact against it for your subscription. It is only temporary and isn’t actually withdrawn, so it will appear as a “Pending” transaction before eventually going away.\nYou might see a renewal charge if your 90-day free trial expired before you canceled your subscription.\nYou might have signed up from a different device. Currently, the free trial is available to Samsung Keyboard users with eligible Samsung devices where Grammarly suggestions have been integrated automatically.\nIf the charge you see on your statement doesn’t correspond to any of the cases mentioned above, please reach out to our Support team by submitting a ticket\nhere\n.\nHow do I cancel the trial?\nFor instructions on how to cancel your free trial, visit\nthis page\n.",
  "category": "Grammarly for Samsung Keyboard",
  "tags": []
}