{
  "url": "https://support.grammarly.com/hc/en-us/articles/4415031489037-Organize-team-members-into-groups",
  "scraped_at": "2025-08-11T20:47:29.757823+00:00",
  "title": "Organize team members into groups",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins, account managers, and members with custom roles\nIf your Grammarly subscription spans more than one team, you might want to create member groups within your subscription. For example, you can create separate groups for your Support, Sales, and Marketing teams. This will allow you to customize features such as the\nstyle guide\nand\nsnippets\nto each team’s specific needs. In addition, you will be able to monitor each team’s writing performance on the\nanalytics dashboard\n.\nHow do I create a group?\nBy selecting individual team members\nGo to the\nGroups\npage.\nClick\nCreate group\nin the upper-right corner.\nCheck the boxes next to the team members you want to add to the group.\nEnter the name of the group and click\nCreate group\n.\nBy importing a file\nGo to the\nGroups\npage.\nClick\nCreate group\nin the upper-right corner.\nIn the window that appears next, choose the\nImport list\ntab.\nClick\nChoose file\nor select the\nDon’t have a CSV or Excel file?\noption.\nIf you selected\nDon’t have a CSV or Excel file?\n, open the downloaded file and insert your team members’ email addresses and the names of the groups they should be assigned to. You can leave the\nName\ncolumn empty.\nGo back to the\nCreate group\nwindow and upload the file.\nTeam members can’t be a part of more than one group at a time.\nBefore a team member can be added to a group, they have to be\ninvited\nfirst.\nYou can set up a separate\nstyle guide\nand\nsnippets\nfor each group. Team members with the admin and account manager roles will be able to see and manage style guides and snippets of all groups. Team members with group manager permissions will be able to see and manage style guides and snippets only for the groups they have been assigned to.\nTeam members with the admin and account manager roles can view\nanalytics data\nfor all groups. Team members with group manager permissions can view analytics data only for the groups they have been assigned to.\nIf you’re a Grammarly Enterprise admin, you can create a custom role that grants permissions to manage groups and assign the group manager permissions to other team members, but without full admin privileges. Alternatively, you can create a custom role that suits your organization’s specific needs. You can learn more in this article:\nAbout custom roles\nBy assigning groups in identity provider\nTeam members can also be assigned to groups through an identity provider as part of SAML Single Sign-On or SCIM-based group provisioning. If a SAML assertion contains the GrammarlyGroup attribute, users will be added to the corresponding group. If the group doesn\n’\nt exist, it will be created as part of just-in-time provisioning. For more information on configuring an identity provider for Grammarly, please see these articles:\nAdd Grammarly to an identity provider\nConfigure SCIM provisioning\nHow do I manage existing groups?\nYou can manage existing groups on\nthe\nGroups\npage.\nTo edit a group, c\nlick on the three dots\n⋮\nicon next to it and choose\nGroup settings\n:\nTo delete a group, click on the three dots\n⋮\nicon next to it and select\nDelete group\n.\nAdmin controlled groups\nNote\n: Available only to Grammarly Enterprise customers.\nOptionally, you can restrict the permissions for group management by marking a group as admin-controlled in the group settings. When a group is marked as admin-controlled, only members with the admin role can delete the group or remove members from it. Other members who have group management permissions (such as account managers or group managers) will not be able to perform these actions.\nTo learn more about roles and permissions, check out this article:\nManage team member roles",
  "category": "Manage Members & Permissions",
  "tags": []
}