{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000091651-Sign-up-process-for-Grammarly-for-Education-users",
  "scraped_at": "2025-08-11T20:47:47.027607+00:00",
  "title": "Sign-up process for Grammarly for Education users",
  "content": "If your school has a Grammarly for Education license, please follow the instructions below to join your school’s license and receive access to advanced features.\nSign in through an identity provider\nIf your institution uses an identity provider, such as Okta, Microsoft Entra ID, Google Workspace, or others, to manage access to third-party applications and services, please sign in to Grammarly via your identity provider.\nIf you are experiencing any issues with your identity provider, please contact your institution’s Grammarly for Education admin or IT support for further assistance.\nSign up using a school email address\nIf your institution does not use an identity provider to manage access to third-party applications and services, you can sign up for a Grammarly account using your school email address at\nwww.grammarly.com/enterprise/signup\n.\nIf your school has a Grammarly for Education license or acquires it in the future, you will be prompted to join it.\nIf you are not prompted to join your school’s license after signing up for a Grammarly account, we suggest you contact your school’s administration or IT support for further assistance.\nAccept an invitation email\nIf you have been invited to your school’s Grammarly for Education license by its admin, please check your inbox for an email titled\n“You’re invited to join [Your Organization Name] on Grammarly for Education”\nand click\nActivate My Account\n.\nIf you don’t have a Grammarly account, you’ll be prompted to enter your name and password to create one. If you already have an account, you’ll be prompted to sign in to accept the invitation.\nIf you have not received the invitation email, please follow the instructions from this article:\nI don't receive emails from Grammarly. What do I do?",
  "category": "Grammarly for Education",
  "tags": []
}