{
  "url": "https://support.grammarly.com/hc/en-us/articles/360041827671-I-can-t-log-in-to-Grammarly-for-Microsoft-Office",
  "scraped_at": "2025-08-11T20:35:35.591735+00:00",
  "title": "I can't log in to Grammarly for Microsoft Office",
  "content": "In order to log in to Grammarly for Microsoft Office, you will be redirected to your default browser. If this doesn’t happen when you are trying to log in, please reinstall Grammarly for Microsoft Office by following the steps in\nthis article\n.\nIf you still experience issues with logging in, follow these steps:\nIf you can’t log in to Grammarly for Microsoft Office using your browser, please try the following options:\nThere might be an issue with your browser cookies. Please clear your cookies in your browser using the instructions\nhere\n.\nTurn off all your browser extensions. You can use the instructions below to open the list of extensions in your browser:\nChrome: Copy\nchrome:extensions\ninto your address bar\nFirefox: Click\nTools\n>\nAdd-ons\n>\nExtensions\nSafari: Open\nSafari\n>\nPreferences\n>\nExtensions\nMicrosoft Edge based on Chromium: Copy\nedge:extensions\ninto your address bar\nMicrosoft Edge Legacy: Press\nAlt\n+\nX\nkeys and then click\nExtensions\nChange your default browser:\nWindows 10\nPress the\nStart\nbutton and type\nDefault apps\nIn the search results, select\nDefault apps\nUnder\nWeb browser\n, select the browser currently listed, and then select a different one.\nWindows 7\nClick the\nStart\nbutton and click\nControl Panel\nGo to\nPrograms\n>\nDefault Programs\n>\nSet Your Default Programs\nIf you can’t see the\nPrograms\noption, change the view style of the Control Panel. Click on\nView\noption in the upper right corner of the Control Panel and select\nCategory view\nSelect the browser you want to use as your default and click on\nSet this Program As Default\nTemporarily turn off your VPN, proxy, antivirus, and firewall software.\nNote:\nIf you can't log in to Grammarly for Microsoft Office and you see the \"Proxy authentication required\" message, please click\nProxy settings\nto specify your proxy server login details and try logging in again.\nIf Grammarly for Microsoft Office doesn’t work after trying these steps, and you’re using Windows 10 or newer, we suggest switching to\nGrammarly for Windows\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.\nAlternatively, you can give\nthe Grammarly Editor\na try. For more information about the Grammarly Editor, visit\nthis page\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}