{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090312-The-formatting-of-my-document-changes-when-I-export-it",
  "scraped_at": "2025-08-11T20:43:24.829787+00:00",
  "title": "The formatting of my document changes when I export it",
  "content": "When you paste text into the Grammarly Editor, the following types of formatting will be preserved:\nBold and italic text\nNumbered lists and bullet points\nH1 and H2 headers\nLinks\nImages and other types of formatting (like columns or tables) will be stripped from the text.\nNote:\nSupported file types are MS Word (.doc, .docx), OpenOffice (.odt), .txt and .rtf. However, the formatting options are not supported if you use the Classic version of the Grammarly Editor.\nIf you need to preserve all formatting in your document, use the\nUpload file\nand\nDownload\nbuttons to check documents that have been written in other text editors like Microsoft Word, TextEdit, or OpenOffice. Although your document will appear as plain text in the Grammarly Editor, your original formatting will be preserved in the version you download after editing.\nTo import a document, open a new document, click the\nMenu\nbutton (three horizontal lines) in the upper-left corner to unfold the sidebar, and click\nUpload file\n:\nTo export a document, open a document, click the\nMenu\nbutton (three horizontal lines) in the upper-left corner to open the sidebar, and click\nDownload\n:\nNote:\nAt this time, all .txt files that are uploaded to the Grammarly Editor can be downloaded in .docx format only. Our development team is aware of this problem, but there are some technical considerations that our engineers need time to work through.\nIf the problem persists after using the\nUpload file\nand\nDownload\noptions, please send us the original document so that we can investigate the issue more efficiently. You can attach the file to a\nsupport request\n, and we will contact you with a solution.",
  "category": "Grammarly Editor",
  "tags": []
}