{
  "url": "https://support.grammarly.com/hc/en-us/articles/360058948112-Configure-SCIM-provisioning-with-Microsoft-Entra-ID-Azure-AD",
  "scraped_at": "2025-08-11T20:33:39.474044+00:00",
  "title": "Configure SCIM provisioning with Microsoft Entra ID (Azure AD)",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nThis guide provides the steps required to configure SCIM provisioning for Grammarly in Microsoft Entra ID (Azure AD). For general information about SCIM provisioning, please refer to this article:\nConfigure SCIM provisioning\nTopics covered in this article:\nFeatures\nRequirements\nStep-by-Step Configuration Instructions\nProvisioning of already assigned users\nMonitoring Deployment\nResolve Issues\nFeatures\nThe following provisioning features are supported in Microsoft Entra ID:\nCreate users in Grammarly\nRemove users in Grammarly when they no longer require access\nKeep user attributes synchronized between Microsoft Entra ID and Grammarly\nRequirements\nA Microsoft Entra ID tenant\nA user account in Microsoft Entra ID with\npermissions\nto configure provisioning (e.g., Application Administrator, Cloud Application administrator, Application Owner, or Global Administrator)\nA\nGrammarly Enterprise\naccount with the\nadmin role\nor a designated custom role\nA Grammarly\napp configured in Microsoft Entra ID\nSAML Single Sign-On (SSO) enabled in Grammarly\nStep-by-Step Configuration Instructions\nLog in to your Grammarly account, go to the\nProvisioning\npage, and click\nConfigure\n.\nClick the\nActivate SCIM\nbutton.\nGenerate a SCIM token by clicking the\nCreate token\nlink.\nCopy the SCIM token for future use, click\nGot it\n, and close the window.\nSign in to the\nMicrosoft Azure portal\n. Select\nEnterprise applications\n, then select\nAll applications\n.\nIn the applications list, select\nGrammarly.\nSelect the\nProvisioning\ntab.\nSet the\nProvisioning Mode\nto\nAutomatic\n.\nUnder the\nAdmin Credentials\nsection, in the enter\nTenant URL\nfield enter\nhttps://sso.grammarly.com/scim/v2\n, and in the\nSecret Token\nfield enter the token provided by Grammarly (see\nStep 4\nabove). Click\nTest Connection\nto ensure Microsoft Entra ID can connect to Grammarly. If the connection fails, ensure your Grammarly account has Admin permissions and try again.\nClick\nSave\n.\nIn the\nNotification Email\nfield, enter the email address of a person or group who should receive the provisioning error notifications and select the box next to\nSend an email notification when a failure occurs check\n.\nUnder the\nMappings\nsection, select\nProvision Microsoft Entra ID Users\n. Alternatively, this option may appear as\nSynchronize Azure Active Directory Users to Grammarly\n.\nReview the user attributes that are synchronized from Microsoft Entra ID to Grammarly in the\nAttribute-Mapping\nsection. The attributes selected as\nMatching\nproperties are used to match the user accounts in Grammarly for update operations. If you choose to change the\nmatching target attribute\n, you will need to ensure that the Grammarly API supports filtering users based on that attribute. Select the\nSave\nbutton to commit any changes.\nTo configure scoping filters, refer to the following instructions provided in the\nscoping filter tutorial\n.\nTo enable the Microsoft Entra ID provisioning service for Grammarly, change the\nProvisioning Status\nto\nOn\nin the\nSettings\nsection.\nDefine the users and/or groups that you would like to provision to Grammarly by choosing the desired values in\nScope\nin the Settings section.\nWhen you are ready to provision, click\nSave\n.\nThis operation starts the initial synchronization cycle of all users and groups defined in\nScope\nin the\nSettings\nsection. The initial cycle takes longer to perform than subsequent cycles, which occur approximately every forty minutes as long as the Microsoft Entra ID provisioning service is running.\nProvisioning of already assigned users\nIf you already have team members in your Grammarly subscription and turn on provisioning, a reconciliation process needs to happen. As part of this process, Microsoft Entra ID will notify Grammarly of all assigned users. Grammarly will reconcile users already invited via a provisioning request from the identity provider and their status will be reflected on the\nMembers\npage\n. To determine users who haven’t been reconciled with Microsoft Entra ID, access the\nProvisioning\npage\n. If there are users who haven’t yet been provisioned by the identity provider, the\nProvisioning\npage will show a warning banner. Click the\nDownload report\nlink to download a CSV file containing the list of members that haven’t yet been provisioned. This report can be used to bulk delete outstanding users, if appropriate, or for manual processing.\nMonitoring Deployment\nOnce you’ve configured provisioning, use the following resources to monitor your deployment:\nUse the\nprovisioning logs\nto determine which users have been provisioned successfully or unsuccessfully.\nIf the provisioning configuration seems to be in an unhealthy state, the application will go into quarantine. You can learn more about quarantine states in this article by Microsoft:\nApplication provisioning in quarantine status\nResolve Issues\nWhen assigning users and groups to Grammarly, you must select a role other than\nDefault Access\n. Users with the Default Access role are excluded from provisioning and will be marked as not effectively entitled in the provisioning logs. If the only role available on the application is the default access role, you can\nupdate the application manifest\nto add additional roles.\nWhen users are deactivated in Microsoft Entra ID, they will be deactivated in Grammarly. Users will not be able to log in to the application, but their data will remain available as an “inactive user.” After 30 days, their accounts will be deleted completely.",
  "category": "SAML Single Sign-On",
  "tags": []
}