{
  "url": "https://support.grammarly.com/hc/en-us/articles/4412638077709-How-to-create-or-edit-documents-on-iPhones",
  "scraped_at": "2025-08-11T20:46:20.721852+00:00",
  "title": "How to create or edit documents on iPhones",
  "content": "As an iPhone user, you can access the Grammarly iPhone Editor directly from your mobile device by\ndownloading Grammarly for iPhone\n.\nNote:\nTo start using the Grammarly iPhone Editor, you will first need to install the Grammarly Keyboard for iOS. Once you have installed the Grammarly Keyboard, you can start using the Grammarly iPhone Editor. You will also have the option to easily switch between the Grammarly Keyboard and your iOS keyboard anywhere that you type.\nIf you would prefer to use the Grammarly iPhone Editor without having to install the Grammarly Keyboard, please see our\nFeature Request\nsection to record your feedback.\nThis article covers:\nCreating new documents and accessing existing documents\nDownloading and sharing documents\nChecking text\nChecking text for plagiarism\nAccessing synonyms\nFormatting text\nAdjusting goals\nPerformance report\nAdjusting your settings\nNote:\nYou can also access the Grammarly Editor from your iPad or desktop computer. For more information, see the\nGrammarly for iPad user guide\nor\nGrammarly Editor user guide\n, respectively.\nCreating new documents and accessing existing documents\nOnce installed, open the Grammarly companion app and go to\nMy Grammarly\n. On this page, you’ll be able to find the documents you’ve previously saved in your Grammarly account:\nTo create a new document in the Grammarly iPhone Editor, you have two options\n—\nWrite\nor\nImport\n:\nWrite\nTap the\nWrite\noption in the Grammarly iPhone Editor app.\nA blank document will open, where you can begin typing your text.\nAlternatively, you can copy text from a different app and paste it into the blank document to get started.\nImport\nTap the\nImport\noption in the Grammarly iPhone Editor app. This will prompt you to select a document from your files.\nNavigate through your files to locate and select the document you want to import.\nOnce you've selected the document, it will be loaded into the Grammarly Editor, allowing you to review and make any necessary changes.\nCurrently, the Grammarly iPhone Editor supports the following file formats:  PDF, Microsoft Word (.doc, .docx), OpenOffice (.odt), .txt, .rtf, Markdown (.md), TextPack and TextBundle, .opml, and many other formats from different iOS apps.\nIf you would like to see other file formats supported,\nplease see our\nFeature Request\nsection to record your feedback.\nTip:\nYou can also use the quick actions menu to create a new document by tapping and holding the Grammarly icon on your Home Screen and selecting\nNew Document.\nDocuments that you create or edit in the Grammarly iPhone Editor will be available on your desktop computer in the Grammarly Editor at\nhttps://app.grammarly.com/\n.\nDownloading and sharing documents\nAfter completing your document editing in the Grammarly iPhone Editor, you have the following options to export your text:\nCopy text\nSelect the desired text and use the copy function available in the Grammarly iPhone Editor. This will save the text to your device's clipboard, allowing you to paste it into another app or document of your choice.\nDownload the document to your iPhone\nOpen the document that you want to download and tap the\nShare\nbutton. From there, you can choose one of the supported file formats, such as PDF (.pdf), rich text (RTF), plain text (TXT), Markdown (MD), or Microsoft Word (DOCX). The document will be saved to the Files app on your iPhone.\nSend as Email\nTap the\nShare\nbutton within the document, and a menu of sharing options will appear. From the menu, select\nSend as Email.\nThis will open the default email app on your iPhone. The edited document will be inserted into the body of the email.\nAll you have to do is provide the necessary recipient details, including the email address, subject, and any additional information required before sending the email.\nDuplicating or printing\nIn addition to the various options for downloading and sharing your document, you can also duplicate your document or quickly print a physical copy directly from the Grammarly iPhone Editor. To duplicate your document, simply access the options menu and select\nDuplicate.\nTo print your document, access the options menu and select\nPrint.\nThe Grammarly iPhone Editor will then prompt you to select a printer and any desired print settings.\nTip:\nIf you need to find a particular document fast, use the Spotlight search.\nChecking text\nThe Grammarly iPhone Editor on your device provides almost the same types of writing suggestions as on the computer.\nOnce you have finished writing your document or pasted your text into the Grammarly iPhone Editor, you’ll see the first suggestion just above the keyboard:\nYou can either tap on it to apply the change or swipe to ignore it.\nIf you’d like to review the suggestions, tap the Grammarly icon that appears above the keyboard. This action will open revision mode and allow you to review and accept suggestions:\nIf you’d like to view a specific suggestion, tap on the underlined text, and Grammarly will automatically show the suggestion relevant to that part of the text.\nTo dismiss a suggestion in revision mode, tap the trash bin icon in the lower-right corner of the suggestion card.\nYou can switch back to the keyboard anytime by tapping the keyboard icon:\nNote:\nThe tone detector is not yet available in this product offering. If you would like to see this feature in the Grammarly iPhone Editor,\nplease see our\nFeature Request\nsection to record your feedback.\nChecking text for plagiarism\nIf you have a paid subscription, you can check your document for plagiarism. To do that, tap\nMore\n(\n) in the upper-right corner and select the\nPlagiarism\noption:\nAccessing synonyms\nWhen typing or editing your text, you can check words for synonyms. To do that, tap on any word in your document. The list of synonyms will appear in the upper row of the keyboard:\nIf you’d like to substitute any word for a synonym, tap on any word from the list to apply the changes.\nFor more information about the synonyms feature, check out\nthis blog post\n.\nFormatting text\nGrammarly for iPhone also supports the following rich-text formatting options:\nH1 and H2 headings\nBold, italic, and underlined text\nNumbered and bulleted lists\nHyperlinks\nParagraph indents\nClear Formatting\nTo apply any of the formatting options, double-tap any word and drag the pins to select a specific part of your text. Then, tap the\nAa\nbutton that appears in the lower-right corner of the text field:\nThen, choose any formatting option you’d like to apply.\nKeep in mind that the H1 and H2 headings, bulleted and numbered lists, and paragraph indent options will apply to the whole paragraph. The option to make the text bold, in italics, or underlined and the option to add a hyperlink will apply to the selected part of the document only.\nTo clear the formatting from the text that you have highlighted, simply tap the clear formatting icon, which is displayed as a capital “T” with a diagonal strike.\nTip:\nBy highlighting your text, you can also access a quick actions menu that will allow you to copy, cut, paste, format, define terms, and more.\nAdjusting goals\nGrammarly can also help you achieve a specific goal with your text and ensure that it’s suitable for your intended audience.\nTo adjust your goals, access the options menu, select\nGoals\n, choose your preferred settings, and tap\nDone\n:\nYou can also turn on the option\nShow Set Goals\nfor a new document. The Goals selection menu will appear anytime you start a new document:\nPerformance Report\nIf you want to view your performance report, tap on the three dots icon located in the upper-right corner of your screen and then select\nPerformance\nfrom the dropdown menu. This will allow you to see your total score for the text, as well as the word count, readability score, and vocabulary, which includes unique words and rare words used in your text. This information can be very helpful in improving the overall quality of your writing.\nAdjusting your settings\nThe option to update your Editor settings is not currently available in this product offering. However, you can still access and manage your language preference and personal dictionary. For more information about adjusting settings on iOS devices, check out\nthis guide\n.\nIf you are a Grammarly Premium, Grammarly Business, or Grammarly for Education user, you can also deactivate certain Grammarly suggestions by going to\nthe Writing Style page\non a desktop computer. For more information about this feature, visit\nthis page\n.",
  "category": "Grammarly for iPhone",
  "tags": []
}