{
  "url": "https://support.grammarly.com/hc/en-us/articles/4403077145485-Create-snippets",
  "scraped_at": "2025-08-11T20:42:31.776944+00:00",
  "title": "Create snippets",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nManaged by:\nAdmins, account managers, and users (personal snippets only)\nSnippets are phrases, sentences, or even whole paragraphs that you can quickly insert into your text to save time on writing. Snippets are available in\nGrammarly for Windows\n,\nGrammarly for Mac\n, and the\nGrammarly browser extension\n.\nTopics covered in this article\n:\nHow do I create a snippet?\nHow do I create collections of snippets for different user groups?\nHow do I use a snippet?\nHow do I edit or delete a snippet?\nHow do I customize my keyboard shortcut?\nHow do I turn off snippets?\nHow do I create a snippet?\nThere are three ways to create a snippet.\nGo to the\nSnippets\npage and click\nCreate snippet\nin the upper-right corner:\nGo to the\nSnippets\npage, click on any collection (\nOrganization\ncollection is available by default), and click\nImport list\nin the upper-right corner. You will see a prompt to download a template, which you can fill with the list of phrases commonly used for writing in your organization. Once the template is filled in, click\nNext\nin the same window and upload the file. Team members with the\nuser role\ncan add snippets only to their personal snippet collections.\nPress\n\\\nwhile typing with Grammarly for Windows or Grammarly for Mac to open the snippets menu. Click\nCreate snippet\nand fill in the name and the text of the snippet.\nNote:\nYou can create an unlimited number of snippets. When importing a list of snippets, you can create 1,000 snippets at a time.\nTeam members with the admin and account manager roles can create personal snippets and snippets for the whole organization or specific user groups. Team members with\ngroup manager permissions\ncan create personal snippets and snippets for the user groups they are assigned to manage. Team members with the user role can create snippets that are available only to them.\nYou can choose who can access specific snippets by assigning a snippet collection to a corresponding user group. You can also change this setting later when editing the snippet.\nNote:\nGrammarly Enterprise admins can create a custom role that grants permissions to manage snippets for the whole organization or specific user groups, but without full admin privileges. You can learn more in this article:\nAbout custom roles\nHow do I create collections of snippets for different user groups?\nNavigate to the\nSnippets\npage.\nClick\nCreate collection\nin the upper-right corner.\nFill in the name of the collection and choose who should have access to it:\nOnce a collection is created, you can populate it with snippets by choosing the corresponding option when creating a snippet from the\nSnippets\npage as described above.\nWhile writing, team members will have access only to personal snippets, company snippets, and snippets of the user group they belong to.\nTo assign snippets to user groups, you must create at least one user group. For more information on how to create user groups, please see this article:\nOrganize team members into groups\nHow do I use a snippet?\nTo use a snippet while typing with Grammarly for Windows or Grammarly for Mac, press\n\\\nto open your snippets library. In this library, your snippets will be sorted by frequency of usage.\nUse the up and down arrow keys to browse your snippets or continue typing to search for a snippet by name or keyword in the content. For example, if you type “\\late”, you’ll pull up the snippet “I’ll be a few minutes late. My previous meeting is running over.”\nTo insert the snippet into your text, click on the snippet or press Enter.\nHow do I edit or delete a snippet?\nYou can edit and delete snippets from the\nSnippets\npage.\nChoose a collection, find the snippet you’d like to modify, and click on the pencil icon next to it to edit it. To delete, move, or duplicate a snippet, click the three dots icon.\nTeam members with the\nadmin\nand\naccount manager\nroles can edit, delete, and move their own personal snippets, the organization’s snippets, and snippets assigned to different user groups.\nTeam members with\ngroup manager permissions\ncan edit, delete, and move their own personal snippets and the snippet collections of the groups they are assigned to manage. They cannot delete or modify the organization’s snippet collections or snippets assigned to other user groups.\nNote:\nThe group manager permissions are available only to Grammarly Enterprise customers.\nTeam members with the\nuser\nrole can edit only their personal snippets. If you are a member of a team plan and you cannot use or create personal snippets, it means this option has been turned off by an admin.\nHow do I customize my keyboard shortcut?\nTo set a different keyboard shortcut for inserting snippets, please follow these steps:\nGo to your\nHome\npage.\nClick on the\nYour account\ntab and choose\nFeature customization\n.\nIn the\nAssign shortcuts\nsection, assign a new keyboard shortcut. Choose a character that you don’t normally use when typing.\nYou can also customize your keyboard shortcut when you type. Press\n\\\nto pull up the snippets window, click on the three dots, and choose\nEdit shortcut\n.\nHow do I turn off snippets?\nTo turn off the snippets feature for your account, go to the\nFeature customization\npage and switch the toggle next to\nSnippets\nto off:\nAdditionally, team members with the admin role can turn off personal snippets for all members of their team plan on the\nFeature access\npage:\nTurning off personal snippets will not delete them, and admins can turn them on again later to allow their team members to continue using them.",
  "category": "Team Features",
  "tags": []
}