{
  "url": "https://support.grammarly.com/hc/en-us/articles/14528857014285-Introducing-generative-AI-assistance",
  "scraped_at": "2025-08-11T20:33:07.100388+00:00",
  "title": "Introducing generative AI assistance",
  "content": "At Grammarly, we constantly leverage new technologies to build products that help our customers communicate effectively.\nOur on-demand generative AI assistance provides the ability to quickly\ncompose, rewrite, ideate, and reply. It’s contextually aware and accounts for personal voice, offering relevant and personalized suggestions that respect user agency and authenticity.\nThis article covers:\nWhat can generative AI do?\nWhere to find generative AI features\nHow to use generative AI features\nManaging your account settings\nWhat can generative AI do?\nWith\nGrammarly’s generative AI features\nyou can:\nCompose\n—Write a prompt with a few words and receive a draft in seconds. Grammarly will instantly compose writing based on that prompt.\nRewrite\n—Instantly generate new versions of your writing customized for tone, clarity, or length.\nPersonalize your voice\n—Set up tailored style controls so your generated text is in your preferred voice.\nReply\n—Grammarly will use context from an email you receive to offer instant options for generating a reply, integrating additional context like the sender’s name and intent into the generated reply.\nIdeate\n—Input a prompt for Grammarly to generate an outline or draft ideas. Grammarly also suggests prompts a user can select to improve writing.\nWhere to find Grammarly’s\ngenerative AI features\nGrammarly’s generative AI assistance is integrated directly into our\nexisting product offerings and is available for use in many popular desktop applications and websites. You can use\nour generative AI features\nin the following product offerings:\nGrammarly for Windows and Mac\nGrammarly for Chrome\nGrammarly for Microsoft Edge\nThe Grammarly Editor\nGrammarly for iPhone and iPad\nGrammarly for Android\nGrammarly’s generative AI assistance\nis available right where you work. Generate text directly in apps and sites like Gmail, Google Docs, Microsoft Word, LinkedIn, Medium, and more.\nHow to use generative AI features\nTo start using Grammarly’s generative AI features, click the lightbulb icon, then type a prompt\n. You can also choose from suggested prompts Grammarly offers based on your unique context.\nIf you’re wondering what kinds of prompts you can use, try these:\nWrite a thoughtful birthday message for a colleague\nGive me ideas for decorating my taco truck\nDraft a blog post introducing my new yoga studio\nWrite a social media post announcing my new job as a food critic. Add hashtags\nWrite an email welcoming a new coworker to the team\nNote:\nEach Grammarly user has a set number of prompts they can use a month. Each time you type something\ninto the prompt field\nor select one of the suggested prompts generated by Grammarly, this counts toward your usage limit.\nYou can also rewrite text by highlighting the relevant part and\nclicking the lightbulb icon\nor a pencil icon that appears. Here are some examples of prompts you can use:\nShorten it\nImprove it\nMake it sound more professional\nMake it sound more engaging\nContinue it\nTo transfer the generated text to your text field, click\nInsert:\nYou can personalize your voice to bring more authenticity to what you generate. Select your preferences for formality, tone, and more, then click\nUse this voice\nto set your voice:\nNote:\nIf you use Grammarly Business or Grammarly for Enterprise, visit this page to learn more about My voice:\nIntroducing voice features\n.\nYou can access this voice menu at any time by clicking on the My Voice icon in the upper right corner:\nManaging your account settings\nYour Grammarly settings can be found on your\nAccount Settings\npage.\nIf you no longer wish to use\nGrammarly’s generative AI features\n, open your account settings, go to the\nFeature customization\npage, and switch off the generative AI settings.\nNote:\nIf your Grammarly account is associated with a Grammarly for Business or Grammarly for Education license, the option to enable generative AI features is controlled by the license admin.",
  "category": "Generative AI assistance",
  "tags": []
}