{
  "url": "https://support.grammarly.com/hc/en-us/articles/360039005112-Microsoft-Office-is-slow-or-crashes-when-I-m-using-Grammarly-for-Microsoft-Office",
  "scraped_at": "2025-08-11T20:32:21.229544+00:00",
  "title": "Microsoft Office is slow or crashes when I'm using Grammarly for Microsoft Office",
  "content": "This issue might occur if your antivirus, firewall software, or other Microsoft Office add-ins are interfering with Grammarly for Microsoft Office.\nTo resolve this issue, we suggest following these steps:\nStep 1\nTemporarily turn off any add-ins except for Grammarly:\nGo to\nFile\n>\nOptions\n>\nAdd-ins\nClick\nManage\n, select\nCOM Add-ins\n, and click\nGo\nIn that window, turn off all add-ins except Grammarly:\nStep 2\nTemporarily deactivate your antivirus or firewall software.\nNote:\nIf temporarily deactivating your antivirus or firewall software helps, we suggest that you add Grammarly to that software’s allowed list to resolve the issue.\nStep 3\nInstall Grammarly for all users by following these steps:\nDownload Grammarly for Microsoft Office at\nhttps://www.grammarly.com/office-addin/downloading\nDouble-click the GrammarlyAddInSetup.exe file\nWhen you see the\nWelcome to Grammarly\nwindow, click\nGet Started\nwhile pressing\nShift\nand\nCtrl\nkeys on your keyboard\nIn the window you see next, check the box next to the option\nInstall for all users\nand click\nNext\n:​\nIf you don’t see the option to install for all users, download and run this file:\nhttps://gram.ly/HSJT\nIf none of these steps help, please follow the instructions\nin this article\nand\nsubmit a support ticket\nwith the troubleshooting request ID so we can investigate this issue more thoroughly.\nNote:\nAt this time, Grammarly for Microsoft Office is not fully compatible with Microsoft Surface RT, Microsoft Surface Pro X, and other ARM-based devices. If you are using one of the above devices, we recommend switching to\nthe Grammarly Editor\nor\nthe Grammarly browser extension for your preferred browser\n.\nAlternatively, we suggest switching to\nGrammarly for Windows\n(available on\nWindows 10 or newer)\n. This product offering also supports integration with Microsoft Word and Outlook. To find out more, check out\nthis article\n.",
  "category": "Grammarly for Microsoft Office",
  "tags": []
}