{
  "url": "https://support.grammarly.com/hc/en-us/articles/19026306820109-Group-manager-permissions-for-team-members",
  "scraped_at": "2025-08-11T20:29:09.286335+00:00",
  "title": "Group manager permissions for team members",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins and account managers\nTeam members with the admin and account manager roles can grant group manager permissions to team members with the user role to enable them to manage enterprise features for selected member groups.\nTopics covered in this article:\nWhat permissions do group managers have?\nHow to assign team members as group managers?\nWhere can I see the group managers assigned to a group?\nWhat permissions do group managers have?\nMembers of Grammarly Enterprise teams can have one of the following roles: admin, account manager, user, and user with group manager permissions.\nTeam members who have group manager permissions can maintain several aspects of their group’s Grammarly Enterprise account. This includes viewing analytics and managing writing preferences for the teams they have been assigned as group managers.\nTeam members with the user role but without group manager permissions can’t change any settings of their organization’s account.\nTo learn more about roles, please review this article:\nManage team member roles\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nAdmin\nAccount Manager\nUser (Group Manager)\nUser\nSubscription and billing\n✅\nAdministration\n✅\nChange members of all groups\n✅\n✅\nChange members of assigned groups\n✅\n✅\n✅\nCustomize style guides, writing preferences, and brand tones for all groups\n✅\n✅\nCustomize style guides, writing preferences, and brand tones for assigned groups\n✅\n✅\n✅\nView team usage analytics for the whole organization\n✅\n✅\nView team usage analytics for assigned groups\n✅\n✅\n✅\nHow to assign team members as group managers?\nBy selecting individual team members\nGo to the\nMembers\npage.\nClick on the team member to whom you want to grant group manager permissions.\nSet their\nRole\nto\nUser\n, and under\nAssign group manager permissions\n, select the groups that they will manage.\nClick\nSave\n.\nBy changing group settings\nGo to the\nGroups\npage.\nClick on the three dots icon\n⋮\nnext to the group you’d like to configure and choose\nGroup settings\n:\nIn the window that appears next, check the boxes next to the team members who should have group manager permissions and click\nSave.\nNote:\nAssigning group manager permissions to a team member will not change their group membership.\nBy assigning group managers on the group details page\nGo to the\nGroups\npage.\nClick on the group you’d like to edit and click on\nAssign group manager permissions\nin the upper-right corner:\nIn the window that appears next, check the boxes next to the team members who should have group manager permissions and click\nSave\n.\nYou can also assign group manager permissions via SAML single sign-on. To learn more, please review this article:\nAdd Grammarly to an identity provider\nWhere can I see the group managers assigned to a group?\nOn the\nMembers\npage, the\nGroups managed\ncolumn shows the number of groups that a team member is assigned to manage:\nOn the\nGroups\npage, the\nGroup managers\ncolumn shows the team members who have group manager permissions for the corresponding groups:\nNote:\nYou can have multiple group managers, and each group manager can be assigned to multiple groups. Assigning group manager permissions to a team member will not change their group membership. To learn more, please review this article:\nOrganize team members into groups",
  "category": "Manage Members & Permissions",
  "tags": []
}