{
  "url": "https://support.grammarly.com/hc/en-us/articles/24089819317389-Introducing-Grammarly-s-plugin-for-Figma-and-FigJam",
  "scraped_at": "2025-08-11T20:38:00.351194+00:00",
  "title": "Introducing Grammarly's plugin for Figma and FigJam",
  "content": "We're excited to announce a new Grammarly plugin you can use directly in Figma and FigJam!\nHow do I install the plugin?\nTo add the Grammarly plugin for Figma, visit this page:\nGrammarly plugin\n.\nWhere does the plugin work?\nThe plugin works in both the desktop and web versions of Figma and FigJam on Windows and Mac.\nTo use the plugin, you need to have Grammarly for Windows or Grammarly for Mac installed and running. When you run the Grammarly Figma plugin, you will see suggestions as soon as you select a text layer.\nThe plugin supports any text layer, including stickies, shapes, and tables in FigJam.\nNote:\nThe plugin doesn't check the text in comments in Figma or FigJam.\nWhat features are available?\nAll features that are currently offered in Grammarly for Windows and Mac are available in this plugin.\nHow do I use the plugin?\nOnce you run the Grammarly plugin for Figma, you will see a window prompting you to select at least one text layer to view suggestions from Grammarly.\nWhen a text layer is selected, the Grammarly Figma plugin will show a window with the text from the text layer.\nNote:\nThe text shown in the plugin window will not display the formatting. The formatting will be applied automatically once you click\nUpdate text layer.\nIf the selected text layer has multiple styles and formatting, the Grammarly Figma plugin will insert the text according to the style or formatting of the first word of the text.\nYou can view, accept, and dismiss suggestions inline and via the assistant mode. The changes you make at this point are applied to the text in the plugin window.\nOnce you've responded to the suggestions, click\nUpdate text layer.\nThe final text will be inserted into the corresponding text layer in Figma or FigJam.",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}