{
  "url": "https://support.grammarly.com/hc/en-us/articles/19812297751053-Get-started-with-Grammarly",
  "scraped_at": "2025-08-11T20:46:25.402063+00:00",
  "title": "Get started with Grammarly",
  "content": "Welcome! Grammarly helps people communicate with confidence across devices and platforms, and we’re excited for you to embark on your writing journey with Grammarly by your side.\nHere’s a short guide on how to get started—we’ll walk you through installing and getting the most out of our product offerings, as well as managing your account.\nThis article covers:\nCreating and accessing your Grammarly account\nInstalling Grammarly\nUsing Grammarly to check your writing\nUpgrading to Grammarly Pro\nPersonalizing your Grammarly experience\nCreating and accessing your Grammarly account\nTo begin your journey with Grammarly,  we suggest that you create an account with us.\nOpen your browser and go to\nSign up — Create Free Account\n.\nEnter your email address, create a strong password for your account, and add your name. If you prefer to use one of your social accounts, you can sign up via Google, Facebook, or Apple instead.\nIf you already have an account, you can log in at\nhttps://www.grammarly.com/signin\n.\nCreating a Grammarly account gives you a smoother experience, as it helps ensure that your account settings are carried across all devices where you use Grammarly.\nNote:\nIf you need any help with signing in, review this section of our Support page:\nAccount Basics\n.\nInstalling Grammarly\nOnce you create your Grammarly account, you can access the Grammarly Editor at\nhttps://app.grammarly.com\n. You can use the Grammarly Editor to write and edit documents directly in your browser without installing any other applications.\nAside from the Grammarly Editor, we provide several other product offerings that you can use when you write on your computer or mobile device.\nTo use Grammarly where you write, we suggest installing\nGrammarly for Windows and Mac\n—this product offering integrates with a wide array of applications and websites.\nIf you’d like to explore other product offerings from Grammarly, visit this page:\nGrammarly's product offerings\n.\nNote:\nFor more information on system requirements for each product offering, visit this page:\nWhat do I need to use Grammarly?\nKeep in mind that Grammarly is cloud-based software and cannot be used offline. You’ll need an internet connection to use our product offerings.\nUsing Grammarly to check your writing\nGrammarly’s product offerings offer writing suggestions wherever you write. Our suggestions are split into four categories: correctness (indicated with a red underline), clarity (blue), engagement (purple), and delivery (green).\nNote:\nIf you use Grammarly Pro or Grammarly for Business, you might also see gray underlines that represent your company’s style guide.\nWhen Grammarly checks your text, you’ll see underlines for some critical suggestions. To access all the suggestions Grammarly has to offer, click the Grammarly icon on your screen:\nOnce you install Grammarly on your computer or mobile device, we suggest reading the relevant article from this list:\nGrammarly for Windows and Mac user guide\nGrammarly Editor user guide\nGrammarly browser extension user guide\nGrammarly for iPhone user guide\nGrammarly for iPad user guide\nGrammarly for Android user guide\nYou can also use our generative AI features to help you compose, generate ideas, rewrite, and reply in an instant. Generative AI assistance is currently available in Grammarly for Windows and Mac, the Grammarly Editor, the Grammarly browser extension for Chrome and Edge, Grammarly for Android, Grammarly for iPhone, and Grammarly for iPad.\nTo learn more, visit\nIntroducing generative AI assistance\n.\nUpgrading to Grammarly Pro\nYou can use Grammarly Free for as long as you want, and you can upgrade to Grammarly Pro at any time. Visit the\nGrammarly Prices and Plans\npage for more information on your options.\nGrammarly Pro is a subscription-based service. The type of account you currently have (Free or Pro) is indicated every time you log in.\nTo upgrade, visit\nhttps://www.grammarly.com/pro\n.\nPersonalizing your Grammarly experience\nYou can adjust your writing and account settings within your Account Hub.\nIn your Profile Settings (\nhttps://account.grammarly.com/profile\n), you can:\nChange or set your password\nChange your email address\nChange the name\non your account\nUpdate your email preferences\n(subscribe to or unsubscribe from our emails)\nIn the Writing section (\nhttps://account.grammarly.com/customize\n), you can:\nAdd to or remove words from your personal dictionary\nManage your language preference\n(select between American, British, Indian, Australian, and Canadian English)\nIf you use Grammarly Pro, Grammarly Premium, Grammarly for Business, or Grammarly for Education, you can also\ncustomize the suggestions you see\n.\nIn the Subscription section (\nhttps://account.grammarly.com/subscription\n), users of Grammarly Pro or Grammarly Premium can adjust their subscription preferences: change the plan, cancel or re-activate the subscription, update the payment method or\ndownload payment receipts\n.\nIn the Security section (\nhttps://account.grammarly.com/security\n), you can:\nCheck the devices linked to your account\nand sign out any devices you don’t recognize\nSet up or adjust two-step verification\nReview recent account activity\nRequest a personal data report\nand access\nour Trust Center",
  "category": "Questions about Grammarly features",
  "tags": []
}