{
  "url": "https://support.grammarly.com/hc/en-us/articles/15606282682637-Grammarly-for-Android-user-guide",
  "scraped_at": "2025-08-11T20:36:15.865424+00:00",
  "title": "Grammarly for Android user guide",
  "content": "Whether you prefer to use your system keyboard or a third-party keyboard of your choice, Grammarly for Android ensures that you can benefit from Grammarly's insightful feedback and guidance while typing in a wide range of apps on your Android device.\nImportant:\nBefore you\ndownload and install\nGrammarly for Android, make sure Grammarly supports your device. Grammarly is compatible with mobile phones and tablets running Android 9.0 or newer.\nThis article covers the following topics:\nGrammarly’s companion app\nChecking text\nGrammarly’s companion app\nThe Grammarly companion app is where you can:\nAdjust your settings—switch Grammarly for Android on or off, or change your language preferences.\nManage Appearance—if the Grammarly for Android widget seems distracting or gets in the way as you type, you can customize it: change the widget size or transparency.\nManage your Blocked Apps—choose where you want Grammarly for Android to appear.\nCreate and manage drafts.\nLog in or out of your Grammarly account.\nShare feedback, thoughts, and suggestions with the Grammarly team.\nTry the demo tutorial—explore the tutorial to familiarize yourself with the features and functionality of Grammarly for Android.\nReview our Privacy Policy.\nContact Support.\nSelect an option below to explore the features within the Grammarly companion app:\nManage settings\nFrom the settings, you can make the following adjustments:\nSwitch Grammarly on or off according to your needs.\nTurn on the quick toggle feature. This option allows you to easily switch Grammarly on or off from the notification shade without opening the companion app.\nChange your language preferences. Customize Grammarly to suit your regional English dialect, choosing from American (US), Australian (AU), British (UK), Canadian (CA), or Indian (IN) English.\nManage Appearance\nYou can customize how the Grammarly widget displays suggestions and alerts.\nIn the\nActive\ntab, you can change the appearance of the Grammarly widget. You have the following options:\nCustomize the widget size.\nSwitch the Compact display option on or off. When this option is on, the widget will only show the number of suggestions.\nIn the\nIdle\ntab, you can change the size and transparency of the Grammarly widget:\nManage Blocked Apps\nYou can choose where Grammarly is active and where it’s not, granting you control over its presence in specific apps.\nTo deactivate Grammarly in a specific app:\nHold and drag the Grammarly widget downward until a circle with an\nX\nappears.\nAlign the Grammarly widget with the\nX\nsymbol. A prompt will appear, offering the option to block Grammarly permanently.\nIn case you want to reactivate Grammarly into an app where it was previously blocked:\nOpen the Grammarly companion app.\nTap\nBlocked apps\nto view all apps where Grammarly is currently deactivated.\nLocate the specific app and tap the switch next to it to unblock Grammarly, restoring its functionality within that app.\nCreate and manage drafts\nThis is a dedicated space for drafting quick notes and messages or preparing content. This feature allows meticulous editing before you transfer your polished text to other applications.\nNote:\nAll drafts are saved directly to your current device and won’t synchronize across multiple devices. These drafts will automatically be cleared (that is, deleted) if you log out of Grammarly and log back in or if you reinstall the app.\nStarting a new draft is intuitive. Simply tap\nAdd New,\nand you’re set to begin typing or pasting text from your clipboard for editing.\nWhen you’re finished editing, tap the copy icon to effortlessly copy your refined text to the clipboard, ready to be pasted into any desired location or application.\nIf you wish to declutter by removing any specific draft, tapping the bin icon will instantly delete the selected draft.\nManage login\nYou can log in to your Grammarly account by tapping\nLog in\nin the upper-left corner of the screen:\nNote:\nThe companion app should appear in your device’s menu as Grammarly.\nChecking text\nOnce Grammarly for Android is installed and set up on your device, open any app and tap on any text field—the floating Grammarly widget will appear on the screen. You can start typing, and Grammarly for Android will start providing suggestions.\nIf there is a common mistake or a typo, Grammarly for Android will automatically correct it and inform you of the change.\nIn other cases, Grammarly will provide a suggestion you can accept or dismiss—you’ll see the number of suggestions next to the Grammarly widget. To accept a suggestion, tap on it:\nYou can also dismiss a suggestion within the same menu. If Grammarly offers a suggestion you don’t want, tap on the bin icon to ignore it.",
  "category": "Grammarly for Android",
  "tags": []
}