{
  "url": "https://support.grammarly.com/hc/en-us/articles/27455112673165-Manage-client-apps-controls",
  "scraped_at": "2025-08-11T20:41:55.396144+00:00",
  "title": "Manage client apps controls",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nGrammarly is committed to\nstrong data privacy principles\nfor all users. Enterprise customers can set additional restrictions on what content or data Grammarly can access.\nThe client apps controls feature allows Enterprise admins to manage the availability of different Grammarly product offerings for members of their organization’s subscription.\nIf the availability setting is set to “Managed,” members of the organization’s subscription will not be able to download and install the corresponding Grammarly application independently. In this case, that application can only be installed in a centralized way using a managed software solution or deployment mechanism.\nIf the availability setting is changed to “Blocked,” the corresponding Grammarly application will not work for the affected members.\nThe availability settings can be set for the following Grammarly products:\nGrammarly Editor\nGrammarly for Windows\nGrammarly for Mac\nGrammarly browser extensions\nGrammarly for Mobile\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nTo configure client apps controls, follow these steps:\nGo to your admin\nHome\npage and open the\nOrganization\ntab.\nIn the\nEnterprise security\nsection, select\nClient apps\n.\nTo change the availability of a specific Grammarly application, click on the\nAvailable\nsetting next to it and select\nManaged\nor\nBlocked\nfrom the dropdown menu:\nIn the window that opens next, select who the access setting should be set for:\nIf you want to restrict the installation or block a Grammarly application for all members of your organization’s subscription, select\nEntire organization\n.\nTo restrict the installation or block a Grammarly application for specific member groups, select\nSpecific groups\n, and choose the groups this should apply to. Optionally, you can select\nRequire admin permissions to edit groups\nif you want to limit the ability to delete the specified group or remove members from that group only to admins. You can learn more in this article:\nHow to organize members into groups\nClick\nSave\n.\nYou can always change the availability settings on the\nClient apps\npage.\nRelated articles\nManage domain controls\nManage application controls\nConfigure Managed Mode",
  "category": "Configure Access & Security",
  "tags": []
}