{
  "url": "https://support.grammarly.com/hc/en-us/articles/360045901052-Grammarly-tab-doesn-t-appear-in-Microsoft-Word-on-Mac-after-installation",
  "scraped_at": "2025-08-11T20:45:28.115365+00:00",
  "title": "Grammarly tab doesn't appear in Microsoft Word on Mac after installation",
  "content": "Important:\nGrammarly for Microsoft Word on Mac will no longer be updated. We suggest switching to\nGrammarly for Mac\n, which supports integration with multiple applications and websites, including Microsoft Office apps. Alternatively, if you work on longer documents, we encourage you to give the\nGrammarly Editor\na try.\nIf you completed the installation of Grammarly for Microsoft Word on Mac, but it didn’t appear in your Word document, please follow these instructions:\nStep 1\nClick\nthis link\nto open Microsoft AppSource\nClick\nGet it now\nto install Grammarly for Microsoft Word\nThen, go to Microsoft Word and open any document\nChoose\nInsert\n>\nAdd-ins\n>\nMy Add-ins\nPress the\nRefresh\nbutton in the upper right corner of the window and check if the\nGrammarly\ntab appears in Microsoft Word:\nIf you still don’t see Grammarly in Microsoft Word, please make sure that you are logged in to the same Microsoft account in your browser and in the Microsoft Word application.\nStep 2\nIf the previous steps didn’t help, please\nreinstall Microsoft Word by following the steps below:\nUninstall your current version of Microsoft Word by opening Finder and selecting\nApplications\n. Then, press and hold the Microsoft Word icon and move it to the\nTrash\n(or\nBin\n).\nDownload and install Microsoft Word from the Microsoft Store by following the instructions in\nthis article\n.\nOnce Microsoft Word is installed, add Grammarly for Microsoft Word for Mac as follows:\nOpen a blank Microsoft Word document on your Mac.\nOpen the\nInsert\nmenu and click\nGet Add-ins\nor\nStore\n.\nEnter\nGrammarly\nin the search field and press\nEnter\n.\nClick\nAdd\nnext to the listing for Grammarly for Microsoft Word.\nThen, look for the\nGrammarly\ntab on the MS Word toolbar and press\nOpen Grammarly\n.\nIf Grammarly for Microsoft Word on Mac doesn’t work after trying these steps, we suggest switching to\nGrammarly for Mac\n. To find out more, check out\nthis article\n.",
  "category": "Grammarly for Microsoft Word on Mac",
  "tags": []
}