{
  "url": "https://support.grammarly.com/hc/en-us/articles/27518589299725-Introducing-Grammarly-s-translation-feature",
  "scraped_at": "2025-08-11T20:39:18.787011+00:00",
  "title": "Introducing Grammarly’s translation feature",
  "content": "Included in:\nGrammarly Pro, Business, Enterprise, and Grammarly for Education plans\nAvailable to:\nAll member roles (if enabled by admin)\nThe translation feature allows you to translate text directly within Grammarly. This way, you can stay focused on your current work and minimize the need to switch to external translation tools.\nRequirements\nTo use the translation feature,\ngenerative AI must be turned on\nfor your account.\nIf you are a member of a Grammarly Business, Enterprise, or Grammarly for Education license, the license admin must first enable generative AI to access the translation feature. You can ask your admin to turn on generative AI by following the steps from this article:\nEnable generative AI for your team\nIf you are the admin of a Grammarly license, once generative AI is turned on, you can turn on the translation feature for your team on the\nFeature access\npage by clicking on\nAdditional app actions settings\nunder\nApp actions\nand switching the toggle next to\nTranslate with Grammarly\n:\nThe translation feature is currently supported in Grammarly for Windows and Mac, in Grammarly for Chrome, and in the\nGrammarly Figma plugin\n.\nHow to use the translation feature\nTo translate text as you write with Grammarly, follow these steps:\nClick the lightbulb icon next to the Grammarly button:\nIn the assistant that opens, start typing “translate,” and click\nTranslate with Grammarly\nonce this option appears.\nType in the text you’d like to translate. You can also highlight the text, and it will be automatically inserted into the translation field.\nSelect the language you’d like to translate your text into. The language of your original text will be detected automatically.\nThe text you’ve entered will be instantly translated into the language that you selected.\nClick\nInsert\nto paste the translated text directly where you are writing, or select\nCopy\nto copy the text to the clipboard.\nWhat languages can I translate from and into?\nYou can translate your text from and to these languages: Chinese (Simplified), Dutch, English (British), English (American), French, German, Indonesian, Italian, Japanese, Korean, Spanish, Spanish (Argentina), Spanish (Mexico), Polish, Portuguese, Portuguese (Brazil), Swedish, Turkish, and Ukrainian.\nIs there a limit on the number of characters that can be translated at once?\nCurrently, it is possible to translate a maximum of 4,000 characters at once.\nIs it possible to receive several translation options?\nAt this time, alternative translation options can be available for text under 10 words.\nIs it possible to translate static text?\nTranslate with Grammarly is designed to work with text that you’ve written or are writing. It doesn’t currently work with static text, such as text on a web page or the text from an email you received, but it can translate text that you write as a reply.\nHow to submit feedback or a feature request?\nPlease use the\nGive feedback\nform directly within the app, message your Customer Success Manager, or\ncontact Support\n.",
  "category": "Team Features",
  "tags": []
}