{
  "url": "https://support.grammarly.com/hc/en-us/articles/10139846131213-How-do-I-integrate-Grammarly-with-my-website-or-application",
  "scraped_at": "2025-08-11T20:43:10.169937+00:00",
  "title": "How do I integrate Grammarly with my website or application?",
  "content": "This article is for product managers and developers who are looking to make their website or application compatible with Grammarly’s product offerings.\nGrammarly for Windows\nFor Grammarly for Windows to work on your website or application, the textual content must be made visible to accessibility. Please make sure that there's no parent control in the accessibility tree that has zero height or width.\nNative applications:\nUse\nAccessibility Insights for Windows\nto check that the text field properly supports\nUI Automation Text Pattern\n.\nIf there's a scroll in the text field, check the\nUI Automation Scroll Control Pattern\nas well.\nWebsites or Electron-based applications:\nAny HTML-based UI has accessibility support by default. Please make sure that the text field is visible to accessibility and that there are no parent elements in the accessibility tree with zero height or width.\nGrammarly doesn't initialize in\ninput\nfields. Please use\ncontenteditable\nor\ntextarea\ntags and make sure the width is more than 150px.\nGrammarly for Mac\nFor Grammarly for Mac to work on your website, the textual content must be made visible to accessibility by calling\nsetAccessibilityElement\non the corresponding NSView.\nWe also recommend using NSTextView for implementing text editing, as it should provide the required accessibility functionality out of the box. Otherwise, the custom view must adopt\nNSAccessibilityNavigableStaticText\nprotocol,\npost\nnotifications about its value and layout changes, and additionally implement a few more accessibility methods:\naccessibilitySelectedTextRange()\nsetAccessibilitySelectedTextRange()\nFor multipage interfaces each page needs to satisfy the requirements above and additionally implement:\naccessibilitySharedCharactersRange()\naccessibilitySharedTextUIElements()\nYou can use the Accessibility Inspector tool (\nMain menu\n>\nXcode\n>\nOpen Developer Tool\n>\nAccessibility Inspector\n) to see how your application is represented in the accessibility system.\nNote:\nIf your app is Electron-based, we mainly support Electron 12+ for applications available in the App Store and Electron 16+ for other applications.\nGrammarly’s browser extension\nGrammarly’s browser plugin mainly supports\ntextarea\nand\ndiv\nelements with contenteditable=”true.” Grammarly doesn't work in\ninput\nfields.\nNote:\nOur product also requires custom integration for cases of iFrame usage. If your text fields are using iFrame, please contact us by submitting a request here, and we will help you with the issue.",
  "category": "Questions about Grammarly features",
  "tags": []
}