{
  "url": "https://support.grammarly.com/hc/en-us/articles/36062098867981-How-do-I-switch-from-a-team-plan-to-an-individual-plan",
  "scraped_at": "2025-08-11T20:32:16.039149+00:00",
  "title": "How do I switch from a team plan to an individual plan?",
  "content": "Switching to a different plan is only possible once your current subscription period ends. Please follow the steps below according to your current plan.\nNote:\nIf you’re unsure which plan you’re currently on, go to\napp.grammarly.com\nand check the label in the upper-left corner.\nGrammarly Business\nYou can switch to an individual plan after your current paid subscription period ends. To prevent your subscription from renewing automatically, please ensure you cancel it by following these steps:\nGo to the\nSubscription\npage.\nScroll down to the bottom of the page and click\nCancel Subscription\n.\nClick\nYes, continue\n.\nChoose a reason for cancellation and click\nCancel Subscription\n.\nThis will cancel all future payments and dissolve your Grammarly team at the end of the period you have already paid for. Once your subscription expires, you can convert to an individual Grammarly Pro plan at\nwww.grammarly.com/pro\n.\nGrammarly Pro\nTo switch to an individual plan, remove any other members first, and then update your plan. To remove other members, follow these steps:\nGo to the\nMembers\npage.\nCheck the boxes next to the other members and click\nRemove\nin the lower-left corner of the page.\nIn the window that appears, click\nRemove members\nto confirm the action.\nMembers who have been removed can continue to use their existing Grammarly accounts, and any documents stored in their accounts will not be affected.\nNext, update your plan by following these steps:\nGo to the\nSubscription\npage.\nIn the\nPlan\nsection, click\nUpdate plan\n.\nIn the window that opens next, set your team size to one member and click\nContinue\n.\nNext, click\nUpdate plan\nto save the changes.\nThe change will take effect starting from your next billing cycle.\nNote:\nIf you purchased your Grammarly subscription through our Sales team, please reach out to your Customer Success Manager instead, or\ncontact Support\n.",
  "category": "Manage Payments",
  "tags": []
}