{
  "url": "https://support.grammarly.com/hc/en-us/articles/27540336731149-About-custom-roles",
  "scraped_at": "2025-08-11T20:45:35.909984+00:00",
  "title": "About custom roles",
  "content": "Included in:\nGrammarly Enterprise plans\nManaged by:\nAdmins\nCustom roles is an enterprise feature that allows organizations to tailor account management permissions and access controls to fit their specific organizational requirements. This feature is particularly beneficial for companies that require granular control over what different team members can see and do within their Grammarly Enterprise account.\nThis article provides an overview of the custom roles feature, including how to create, manage, and utilize custom roles effectively.\nTable of contents\nWhat are custom roles?\nTypes of available admin permissions\nHow do I create a custom role?\nHow do I assign members to a custom role?\nHow do I manage custom roles?\nCommon use cases\nFrequently asked questions\nWhat are custom roles?\nCustom roles are admin-defined roles that can be configured to have specific permissions within your Grammarly Enterprise account. Unlike predefined default roles (admin, account manager, user role with group manager permissions, user), which come with a fixed set of permissions, custom roles allow enterprise admins to mix and match permissions to create roles that suit their organization’s unique needs.\nInterested in upgrading to an Enterprise account?\nContact our Sales team\n.\nTypes of available admin permissions\nTeam members with a custom role will be granted specific admin permissions on top of what is available to them through default user permissions. You can define new custom roles that have any—or all—of the below admin permissions:\nCategory\nAvailable permissions\nDescription\nSubscription\nManage subscription details\nFull access to your organization's subscription details and permissions to view the member list.\nMembers\nInvite members\nRemove members\nPermissions to invite new or remove existing members of your organization.\nRoles\nAssign/unassign account manager and user roles\nAssign/unassign admin role\nAssign/unassign custom roles\nCreate, edit, and delete custom roles\nPermissions to manage role assignments and custom roles\nGroups\nAdd/remove group members\nAssign/unassign group manager permissions\nCreate and edit group details\nDelete groups\nPermissions for group management and assigning group manager permissions\nAnalytics\nFilter and export organizational analytics\nView, filter, and export individual member analytics\nPermissions to view, filter, and export team or individual usage data\nSnippets\nCreate and edit snippet collections\nDelete snippet collections\nPermissions to manage snippets for your organization or multiple teams\nBrand Tones\nCreate brand tone profiles\nDelete brand tone profiles\nPermissions to manage brand tones for your organization or multiple teams\nStyle Rules\nCreate style rule sets\nDelete style rule sets\nPermissions to manage style rules for your organization or multiple teams\nWriting Preferences\nCreate writing preference sets\nDelete writing preference sets\nPermissions to manage writing preferences for your organization or multiple teams\nDialect Settings\nSet dialect\nPermission to manage the English dialect in which your team receives Grammarly suggestions\nOrganizational Dictionary\nManage org dictionary\nPermission to manage dictionary entries that keep Grammarly from flagging certain words as misspellings\nIT Configuration\nManage SSO authentication\nManage SCIM provisioning\nConfigure Managed Mode\nPermissions to manage authentication, enrollment, and provisioning for your Grammarly account\nEnterprise Security\nManage enterprise security controls\nPermissions to manage your organization’s access to Grammarly and Grammarly’s access to data, domains, and applications\nThese permissions will define the admin access level that the team member with the custom role will have for Grammarly account management.\nNote:\nThe option to manage Knowledge Share terms is currently unavailable to members with custom roles.\nHow do I create a custom role?\nTo create a custom role, follow these steps:\nGo to the\nRoles\npage.\nClick on\nCreate custom\nrole\nin the upper-right corner:\nFill in the role\nName\nand\nDescription\nfields.\nSelect the access permissions for the custom role by checking the boxes next to the corresponding permissions.\nClick\nNext\n, review the selected permissions, and click\nSave.\nAlternatively, you can create a custom role by duplicating an existing role:\nGo to the\nRoles\npage.\nClick on the three dots icon\n⋮\nnext to the existing role and click\nDuplicate\nrole\n.\nFill in the role\nName\nand\nDescription\nfields.\nModify the permissions and click\nCreate\n.\nReview your selected permissions and click\nSave\n:\nHow do I assign members to a custom role?\nTo assign existing team members to a custom role one by one, follow these steps:\nGo to the\nMembers\npage and click on a team member.\nIn the window that appears next, select the role from the\nRole\ndropdown menu. You can click\nLearn more about roles and permissions\nto review the information about the available options.\nConfirm by clicking\nSave\n.\nTo assign multiple team members to a custom role, do the following:\nGo to the\nMembers\npage and check the boxes next to the team members.\nAt the bottom of the page, click\nChange role\n.\nIn the window that appears next, select the members’ new role from the dropdown menu, and confirm by clicking\nSave\n.\nHow do I manage custom roles?\nOn the\nRoles\npage, you can:\nModify the role description, name, and permissions by clicking on the corresponding role.\nView members assigned to a custom role by clicking on the members count next to it.\nCompare roles by checking the boxes next to them and clicking on\nCompare roles\nat the bottom of the page:\nNote:\nYou can compare up to three roles.\nDelete roles by either checking the box next to a custom role and clicking\nDelete\nat the bottom of the page, or by clicking on the three dots icon ⋮ next to a custom role and clicking\nDelete\n.\nCommon use cases\nThe custom roles feature has numerous applications. Here are a few common use cases that are particularly beneficial to explore:\nCreate an IT admin role\nIf you need to establish an account role capable of performing specific admin tasks—like configuring IT settings, including SSO and SCIM, and managing members—without granting full admin privileges, consider creating an IT admin role.\nEnable only specific members to manage your license\nAllow certain members to manage your subscription, invite and remove members, and get insights into how others are using Grammarly without them necessarily having full admin permissions to alter security controls, SSO configuration, or communication preferences such as brand tones.\nCreate a brand contributor role\nYou can create a brand contributor role for individuals who need to manage company-wide style rules or define organizational brand tones without unnecessary admin permissions to manage groups or see the team’s analytics. You can make the custom role for account management purposes as granular as it needs to be.\nFrequently asked questions\nCan a team member have more than one role?\nNo, each team member can have only one role.\nCan a team member with a custom role also be assigned the group manager permissions for a certain group?\nYes, you can assign group manager permissions to members with custom roles.\nIs there a limit to how many custom roles an admin can create?\nNo, admins can create as many custom roles as needed.\nCan I modify the default roles?\nNo, the default roles cannot be modified.\nCan I assign custom roles through SAML single sign-on?\nYes! Please refer to this article to learn more:\nAdd Grammarly to an identity provider",
  "category": "Manage Members & Permissions",
  "tags": []
}