{
  "url": "https://support.grammarly.com/hc/en-us/articles/4403544890253-Set-brand-tones",
  "scraped_at": "2025-08-11T20:38:07.899820+00:00",
  "title": "Set brand tones",
  "content": "Included in:\nGrammarly Pro, Business, and Enterprise plans\nManaged by:\nAdmins, account managers, group managers, and members with designated custom roles\nThe brand tones feature allows you to set a tone profile that customizes Grammarly’s feedback to your organization’s unique brand voice.\nTopics covered in this article:\nWhat is a tone?\nHow can Grammarly help my team with brand tones?\nGetting started\nHow do I add a tone to my tone profile?\nCan I change the explanation for a tone in my tone profile?\nCan I limit brand tone feedback to certain websites?\nHow do I create additional tone profiles?\nWhat access do team members with different roles have?\nWhat is a tone?\nWhile the grammar, spelling, clarity, and conciseness of your writing are important factors to ensure better writing, the tone of your writing can also change how people understand it. For example, if someone wanted to apologize, they could say “I’m terribly sorry about that.” Or they could say “Oops. I’m sorry!” Both sentences convey the same message but with different tones.\nSaid differently, you can think of a tone as the mood or emotion a piece of writing conveys. To learn more, check out this blog post:\nWhat Is Tone in Writing?\nHow can Grammarly help my team with brand tones?\nGrammarly analyzes the tone of your writing using state-of-the-art artificial intelligence (AI). You can set up a brand tone profile for your teams or organization. You can assign different tones as on-brand or off-brand. Your team will then see real-time feedback about their tone as they write to help them stay on-brand.\nGetting started\nGo to your\nHome\npage.\nClick on the\nWriting\ntab and choose\nBrand tones\n.\nOn the next page, c\nlick\nSet up tone profile\n.\nIn the window that appears next, select the sentences that best reflect how you would want your team to sound in each scenario:\nAfter responding to several prompts, you’ll be able to review your answers. If you’re satisfied, proceed to the next step by clicking\nAnalyze Answers\n.\nWe’ll generate a recommended tone profile for you.\nClick\nView tone profile\nto finish the process.\nYou’ll then see the recommended tones added to your tone profile. From here, you can edit the descriptions for tones, delete them entirely, or add more tones to your tone profile by clicking\nAdd Tones\nin the upper-right corner.\nThat’s it! Your team members will now see tone recommendations as they write.\nHow do I add a tone to my tone profile?\nTo add tones to your tone profile, follow these steps:\nClick\nAdd tones\nin the upper-right corner.\nIn the window that appears next, choose whether the tones you’d like to add should be\non-brand or off-brand. Tones labeled as on-brand will be encouraged for your team, while tones labeled off-brand will be discouraged.\nSelect a tone group from the dropdown list.\nIf you’d like to exclude a specific tone from the tone group, you can uncheck the box next to it.\nAdd an explanation or use the description generated by Grammarly and click\nSave.\nCan I change the explanation for a tone in my tone profile?\nTo change an explanation, click the\npencil icon\nunder a group of tones:\nIn the window that appears next, you can edit the text under\nExplanation for tones\n. Sometimes, Grammarly may be able to autogenerate a description that you can then modify. If an autogenerated description is available, you can click on\nCustom description generated by Grammarly\nat the bottom of the window to insert it.\nCan I limit the brand tones feedback to certain websites?\nYes, you can specify a list of URLs where you’d like the tone profile feedback to appear. You may find this useful if your tone profile is geared toward external communication (for example, writing publicly on Twitter) but less important for internal communication (for example, Slack messages).\nTo create an allowed list of websites, go to the\nBrand Tones\npage, click on the three dots in the upper-right corner, and choose\nSettings\n:\nIn the window that appears next, choose\nSpecific websites\n, add the URLs of the websites where you would like your tone profile feedback to appear, and confirm the changes by clicking\nSave URL settings\n.\nOn all other websites, your team members will see detected tones without on-brand or off-brand labels.\nFormatting tips:\ngoogle.com (without “www”):\nUse this format to include all associated URLs, including www.google.com, mail.google.com, docs.google.com, etc.\ndocs.google.com:\nUse this format to include only the page found at a specific URL.\nHow do I create additional tone profiles?\nNote:\nThis option is not included in Grammarly Pro plans. Members of Grammarly Pro plans can create one brand tone profile.\nTo create an additional tone profile, follow these steps:\nGo to your\nHome\npage.\nClick on the\nWriting\ntab and choose\nBrand tones\n.\nOn the next page, click on the three dots in the upper-right corner and choose\nCreate tone profile\n:\nIn the new window that appears, click\nCreate tone profile\n.\nEnter the tone profile name and select the member groups it should be assigned to.\nIf you want the tone profile to work on certain websites, choose\nSpecific websites\n, add the website URLs, and click\nSave\n.\nNote:\nA single member group can have only one brand tone profile assigned. If you assign a different brand tone profile to a group that already has one assigned, it will override the previous one. On the other hand, a single brand tone profile can be assigned to multiple member groups. If you haven’t created any groups yet, you can refer to this article to do so:\nOrganize team members into groups\nTo create more tone profiles, go to the\nBrand Tones\npage and click\nCreate tone profile\nin the upper-right corner.\nWhat access do team members with different roles have?\nTeam members with the\nadmin\nand\naccount manager\nroles have editing permissions for all brand tones functionality: they can create, edit, or delete brand tone profiles assigned to all user groups.\nTeam members with\ngroup manager permissions\ncan create and edit brand tone profiles only for the member groups they are assigned to manage. Group managers can view the brand tone profiles assigned to other groups, but can’t make any changes to them.\nIf you’re a Grammarly Enterprise admin, you can also create a\ncustom role\nthat grants permissions to manage brand tones for your organization, but without full admin privileges. You can learn more in this article:\nAbout custom roles\nNote:\nThe group manager permissions and custom roles are available only to Grammarly Enterprise customers. Interested in upgrading to an Enterprise account?\nContact our Sales team\n.\nTeam members with the\nuser\nrole can view the brand tone profile assigned to them, but can’t make any changes.\nRelated articles\nCreate style rules\nCustomize writing preferences\nCreate organizational dictionary",
  "category": "Team Features",
  "tags": []
}