{
  "url": "https://support.grammarly.com/hc/en-us/articles/38717781371405-Setting-up-and-using-a-recovery-email-for-your-Grammarly-account",
  "scraped_at": "2025-08-11T20:42:41.345519+00:00",
  "title": "Setting up and using a recovery email for your Grammarly account",
  "content": "If you lose access to the primary email address associated with your Grammarly account, you can use a recovery email to regain access.\nA recovery email is an additional email address you can add to your Grammarly account to help restore access if you can no longer use your primary email.\nThe recovery email feature is available for Grammarly Free, Grammarly Premium, Grammarly Pro, Grammarly Business, and Grammarly for Education users, except for\nK–12\n. It is not currently available for Grammarly Enterprise and any SSO-enabled organizational accounts.\nSetting up a recovery email\nTo add a recovery email to your Grammarly account:\nGo to your\nAccount\nprofile settings at\nhttps://account.grammarly.com/profile\nClick\nAdd recovery email\n.\nEnter the email address you’d like to use and click\nContinue\n.\nOpen the email inbox for the address you entered and find the confirmation code. Email verification codes expire after about 15 minutes.\nEnter the code in Grammarly to verify the recovery email.\nYou’ll receive a confirmation email once verified:\nYou can update or remove your recovery email from your account settings anytime.\nUsing your recovery email to regain access\nIf you lose access to your primary email address, follow these steps to regain access to your account:\nGo to the Grammarly sign-in page and select\nCan’t sign in?\nClick\nRecover my account\n.\nEnter the primary email address associated with your Grammarly account and select\nContinue\n.\nIf your account has a verified recovery email set up, we'll send a link to that recovery email.\nOpen the email sent to your recovery address and click the link to continue.\nFollow the prompts to set a new primary email address for your Grammarly account.\nNote:\nIf a Grammarly account associated with your preferred email address already exists, you will need to\ndelete that account\nfirst.\nIf you didn’t have a password on your account or forgot your password, go to\nhttps://www.grammarly.com/resetpassword\nand request a password reset email using your new primary email.\nOnce you've completed the process, you’ll be able to sign in to Grammarly with your new primary email address.",
  "category": "Account Security",
  "tags": []
}