{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000090212-How-can-I-keep-my-Grammarly-account-secure",
  "scraped_at": "2025-08-11T20:31:08.487756+00:00",
  "title": "How can I keep my Grammarly account secure?",
  "content": "We know you care about the security of your Grammarly account. So do we. To that end, here are our recommendations for keeping your account and personal information safe.\nUse a strong password and ensure it is unique to Grammarly\nYour password is a key piece of information that keeps your account safe. To help ensure your account stays safe and secure, we recommend using a password that:\nIs unique to your Grammarly account and hasn’t been used on other services.\nHas at least 8 characters in it, the longer the better! A phrase made up of multiple words can be a secure choice.\nIs not a word in the dictionary, a name, or other personal information like a birthday, address, or anniversary.\nDoesn’t contain memorable keyboard paths like “1234abcd” or “qwerty123” and doesn’t use repetitive characters such as “aaa” or “zzz.”\nIsn’t known to be commonly used on other websites or been previously\nexposed in a data breach\n.\nDoes not contain common substitutions such as “$” for “s” and “8” for “B.”\nWe recommend you keep your password in a safe place. Password management software, also known as a password manager, can help you generate and manage strong passwords across multiple sites to make your accounts safer. We recommend the use of a password manager to help keep your online accounts safe.\nMonitor the devices that have access to your account\nWith a Grammarly account, you can receive writing suggestions across different browsers, phones, and computers.\nOn\nYour devices\npage, you can check which devices currently have access to your account to make sure no one else is using it. We suggest you periodically check that only devices you are continuing to use have access to your Grammarly account.\nIf you see any devices that you don’t recognize, please refer to this article:\nWhat should I do if I suspect that my account was hacked?\nSet up two-step verification\nTwo-step verification, sometimes known as two-factor authentication or 2FA, is an additional security measure to help protect your account. If you activate two-step verification, you’ll be asked to provide a six-digit code in addition to your password.\nNavigate to the\nTwo-step verification\npage.\nClick\nTurn On\n. You may be asked to verify your account again by entering your password and a 6-digit code sent to your email address.\nSelect which second factor you would like to use.\nIf you’d like to use a third-party authenticator app:\nScan the barcode using your preferred third-party authenticator app.\nClick\nNext\n.\nEnter the verification code from within your authenticator app.\nClick\nVerify\nto activate two-step verification.\nIf you’d like to use text messages:\nEnter a valid phone number that can receive text messages.\nClick\nSend Code\n.\nEnter the verification code you received via text message.\nClick\nTurn On\nto activate two-step verification.\nClick\nDone\n.\nImportant:\nSave the backup codes you’ll receive in the next pop-up in a safe place. If you lose access to your phone or authenticator app, a backup code is the only way you’ll be able to sign in to Grammarly on new devices. You can print them and put them in a safe or store them in a secure file vault.\nBe aware of possible phishing attempts\nPhishing is an attempt to acquire your personal information by pretending to represent a website or company you trust online.\nPhishers will go to great lengths to try to hijack your account or steal your personal information. They may create fake websites that look like Grammarly or send official-looking (but fake) emails asking you for personal information.\nGrammarly will never ask for any personal information in an email. This includes:\nPayment information (full credit card number, direct debit account, PIN, etc.).\nSocial security number or tax identification number.\nYour account password.\nBe careful if you receive an email message asking you for this or any other personal information. If you’re unsure about a link in an email,\nyou can always hover over the link to see where it goes (you’ll see the real, linked web address at the bottom of most browsers).\nAdditionally, you should pay close attention to where the email came from. Here’s the full list of domains Grammarly can use to contact you:\n@grammarly.com\n@bounce.send.grammarly.com\n@send.grammarly.com\n@security.grammarly.com\n@em.grammarly.com\n@info.grammarly.com\n@mail.grammarly.com\n@grammarly.zendesk.com\n@notifications.grammarly.com\n@notification.grammarly.com\nIf you’re still not 100% sure that the website you’re on is the real Grammarly site, you can always type\nwww.grammarly.com\ndirectly into your web browser.\nFinally, if you get an email that looks like a phishing attempt, please let us know by forwarding it to support@grammarly.com. Be sure to include the full header of the email. To learn how you can check the full header of an email you received, see this article by Google:\nTrace an email with its full header\nKeep your devices safe\nIn order to receive the best possible Grammarly experience, it’s important to keep your devices free of malware and viruses. Signs that your device may be infected include:\nUnusually slow or sluggish computer performance.\nPop-up windows or advertisements.\nUnexpected reboots, crashes, or freezes.\nIf you think your device might be infected, you can use the anti-malware, anti-adware, or anti-virus software recommended by your computer manufacturer or a trusted IT professional.\nKeep in mind that malware can evolve, and other malicious programs can cause similar problems. Whichever program you choose to use, be sure to keep it updated with the latest software release.\nRespond to security-related alerts\nIf we detect activity on your account, such as a sign-in from a new device, we may notify you of the event via email. If you did not perform the activity, we advise you to immediately follow the instructions in the notification to secure your account, starting with resetting your password. Please note that the location listed in the notification is an approximate location based on the IP address used to access Grammarly, and it may be different from your physical location.\nIf we detect suspicious activity on your account, we may lock your account and require you to reset your password. This will ensure your account remains secure and only the rightful owner, with access to the registered email address associated with the account, will be able to securely recover it.\nReport security flaws to us\nIf you believe you’ve found a security vulnerability on the Grammarly website or app, we strongly encourage you to inform us as quickly as possible by submitting a report to Grammarly on\nHackerOne\nor by sending an email to security@grammarly.com. We ask that you please contact us prior to disclosing the vulnerability publicly to ensure our users are kept safe. We appreciate your assistance, and we will review all reports and do our best to address the issue promptly.",
  "category": "Fraud FAQ",
  "tags": []
}