{
  "url": "https://support.grammarly.com/hc/en-us/articles/33753422373389-How-can-I-improve-my-organization-s-Effective-Communication-Score",
  "scraped_at": "2025-08-11T20:32:23.529759+00:00",
  "title": "How can I improve my organization’s Effective Communication Score?",
  "content": "The Effective Communication Score reflects the overall quality of your organization’s communication, showcasing both the strengths and the opportunities for improvement. It is calculated for all members of Enterprise subscriptions but is accessible only to admins and account managers on the\nTeam overview\npage.\nTo learn more, check out this article:\nIntroducing the Effective Communication Score\nThis article provides guidelines for how you can increase your team’s Effective Communication Score and maximize your team’s engagement with Grammarly, ensuring that you and your team members fully leverage the available features.\nWays to optimize your team’s use of Grammarly’s writing features:\nReview and update your organization’s\nstyle rules\n, and ensure team members are assigned to the relevant style rule sets. When creating or editing style rules, you can leverage the\nextended functionality\nthat allows you to create more precise and contextually aware rules.\nRevise and update your organization’s\nbrand tone profile\n, or create separate tone profiles for different user groups.\nSet organizational\nwriting preferences\nto customize Grammarly’s suggestions for your team’s writing style. You can specify writing preferences in several categories, such as:\ninclusive language\npunctuation\nsentence clarity\nAdd terms to your\norganizational dictionary\nto stop Grammarly from flagging specific spellings as incorrect. This helps ensure that Grammarly offers only relevant suggestions for your team. Additionally, you can encourage your team members to use the\npersonal dictionary\nfeature to add their own unique terms to their accounts.\nSet a\npreferred dialect\nfor your team to ensure consistency across the organization.\nCreate\nsnippets\nto save time and ensure accuracy for bits of text that your organization uses often.\nEncourage your team members to review and accept writing suggestions. Grammarly’s core writing suggestions are organized into four categories to help you understand the reasoning behind each suggestion: correctness, clarity, delivery, and engagement. For more information about the writing feedback you and your team members can receive, check out this article:\nHow do I check text?\nWays to maximize the use of Grammarly’s subscription management capabilities and product offerings:\nInvite more team members to join your Grammarly subscription and leverage your organization-specific writing settings and advanced Grammarly features. Here’s how you can invite members:\nSend\nemail invitations\n.\nSet up SSO\nfor your subscription and ensure all members have\naccess to the Grammarly app\nin your identity provider.\nResend pending email invitations by going to the\nMembers\npage in your admin account.\nIf you’d like to add more seats to your subscription, please reach out to your Customer Success Manager or\ncontact Support\n.\nCreate user groups for your subscription to allow filtering of the analytics data and assigning content tailored to each group (such as snippets or style rules).\nInform your team members about all the available\nGrammarly product offerings\nthey can use. To receive writing suggestions directly in various desktop applications and on websites, suggest that your team members install\nGrammarly for Windows or Mac\n. If you’d like to install Grammarly on multiple computers at once, check out the\nDeployment Guide for IT Teams\n.\nReview the Monthly Engagement Reports sent to the email address on your admin account to gain insights into your team’s engagement with Grammarly’s suggestions. You can also contact your Customer Success Manager to receive additional personalized reports.\nThe actions described in this article may not directly increase the numeric value of your Effective Communication Score, but they can help your team reduce mistakes across several writing dimensions, compared to writing without Grammarly:\nRelated articles\nAnalyze my team’s writing performance\nReview member usage analytics\nIntroducing your writing progress dashboard",
  "category": "Team Features",
  "tags": []
}