{
  "url": "https://support.grammarly.com/hc/en-us/articles/20916119474829-Privacy-and-security-FAQ",
  "scraped_at": "2025-08-11T20:46:06.560147+00:00",
  "title": "Privacy and security FAQ",
  "content": "Is Grammarly secure?\nEnsuring the safety and security of our users' information is important to us at Grammarly. We\nmaintain protections\nand practice\nprivacy by design\n.\nWhat data does Grammarly collect?\nTo serve our users, Grammarly collects necessary information, such as username, email address, and contact and language preferences. Read more in our\nPrivacy Policy\n. Any user can\nsubmit a request in the account hub\nto view data associated with their account. You can also find information about the trusted\nprocessors\nand service providers that help us provide our services.\nDoes Grammarly train its models with my data?\nAll users have access to our\nProduct Improvement and Training control\n, which gives them the ability to opt out of allowing Grammarly to use their content to improve its products or train its models. We do not train on any content from certain business users or users whose accounts originate in the EU or UK, automatically. Further, individual users can\ncontrol where Grammarly operates\n—for instance, in a browser, and on the desktop—which affects how much of your data it processes.\nHow is this data sent, processed, and stored?\nAll data is transferred to the United States for processing and storage using Amazon Web Services, one of the world’s leading data center providers.\nData in transit is encrypted using TLS 1.2.\nData at rest is encrypted using AES256.\nPasswords are hashed using bcrypt.\nGrammarly implements technical controls to isolate each customer’s data. Customer data is stored in a multi-tenant environment but is segregated logically via tenant IDs. Any writing that an individual or organization reviews with Grammarly will never appear in another customer’s writing suggestions.\nWhat data does Grammarly store?\nWe will store documents created in the Grammarly Editor until they are deleted by the user or upon request after contract termination or expiration.\nFor all other user text processed by Grammarly (i.e., anything not saved in the Grammarly Editor), a customer’s personal data is used only as necessary to deliver and administer services to that same customer and is always used in a fair, transparent manner in accordance with the customer’s privacy expectations.\nTo provide a seamless and highly functional experience, we may leverage random samples of aggregated and de-identified user content to refine and enhance our service for all customers unless the user has opted out of having their content used for\nproduct improvement and training\n.\nHow can I delete the personal data Grammarly stores about me?\nIn accordance with our Privacy Policy, you can delete your personal data from Grammarly by deleting your account. This will include any user documents that you stored in the Grammarly Editor. The instructions on how to do that are available on the\nDelete your Grammarly account\npage.\nAdditionally, you are able to see data that Grammarly associates with your account by requesting a personal data report. Request a personal data report by navigating to your\nprivacy settings\nand clicking “Submit Request” under Personal Data Report.\nDo you share my content with anyone?\nWe take your privacy very seriously. We do not share your content with any third parties except for the generative AI partners described below, and only then with security and sanitization measures in place. We have security measures in place to ensure that your content stays private so you can trust that it is safe with us.\nAny information used to power Grammarly’s generative AI features, such as prompt type, prompt text, and the context in which it’s used, will be shared with our small number of thoroughly vetted partners for the sole purpose of providing you with the Grammarly experience. We do not allow these partners or any third parties to use your content for training their models or improving their products. You can\nfind information here\nabout the trusted processors and service providers that help us provide our services. See our\nPrivacy Policy\nto learn more.\nGrammarly maintains a thorough vendor-review process to conduct due diligence before engaging with any processors.\nCan someone at Grammarly access my data?\nNo one individual at Grammarly can read your text at will. We tightly control access to user data within the company. Only those with an approved need to access certain data are granted access via specific, audited permissions. Access to data requires review and approval by responsible managers and a member of the security team.\nDo you sell my content?\nNo, we do not and will not sell the content you upload to our products, and we do not make money by selling your user content. We offer a free product and hope you’ll purchase our paid product. We make money when users purchase our paid products.\nIs Grammarly a keylogger?\nNo. A keylogger is a type of malicious software or surveillance tool that records every keystroke typed on a keyboard without the user’s knowledge. The captured data—such as passwords or personal information—is often sent to a third party for purposes like identity theft, financial fraud, or unauthorized access. Grammarly’s product doesn’t fit any of these descriptions. At Grammarly, we value user trust and operate with high standards for privacy and transparency. You can feel confident using Grammarly’s product offerings knowing that: Grammarly is blocked from running in read-only and sensitive fields, such as payment forms, passwords, addresses, and URLs. We make it clear when Grammarly is active by turning the G button green. You can easily turn it off any time, then turn it back on within a document or site using the easy-to-find floating G icon when you use Grammarly for Windows or Mac; or an on/off toggle when you use Grammarly Extension, which you can find by pressing on the Grammarly icon located on the top bar of your web browser. (To learn more about how to turn Grammarly off or on, visit the\nTips & Tutorials\nsection of our Support portal.) Some Grammarly features may record your typed or copied input if you provide explicit permission. You will see an in-app notification about this before activating the feature in question.",
  "category": "Privacy and Security",
  "tags": []
}