{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000091371-Delete-and-recover-documents-in-the-Grammarly-Editor",
  "scraped_at": "2025-08-11T20:38:51.132322+00:00",
  "title": "Delete and recover documents in the Grammarly Editor",
  "content": "This article covers:\nDeleting documents in the Grammarly Editor\nRecovering documents\nRecovering document versions\nDeleting documents\nYou can see all of your saved documents at\nhttps://app.grammarly.com/\n. If you’d like to delete a document, hover over the document you want to delete and click the trash bin icon:\nDocuments in your trash bin will be permanently deleted after 30 days. If you need to permanently delete a document before that timeframe is over, go to Trash and click the trash bin icon next to the corresponding document:\nYou might need to confirm the action on the pop-up message in the lower-right corner of the page.\nIf you’d like to delete all documents from your Trash, click\nEmpty Trash\nas shown below:\nImportant!\nThis action will delete your documents permanently, and you won’t be able to restore them in the future.\nRecovering documents\nIf you delete your document by accident, you’ll have a couple of seconds to undo your action. To undo, click the\nUndo\nbutton on the pop-up message that appears right after deletion:\nIf you deleted your document within the last 30 days, you can also restore it by going to Trash and clicking\nRestore\n:\nIf you deleted a document more than 30 days ago, it has been permanently deleted, and we won’t be able to recover it.\nRecovering document versions\nIf you need to recover a part of your text, press Command + Z on macOS or Ctrl + Z on Windows.\nAdditionally, if you accidentally deleted a chunk of text, you can click the\nUndo\nbutton on the pop-up in the Grammarly Editor:\nIf you were unable to undo your action or need to review previous versions of the document, click the\nMenu\nbutton in the upper-left corner of the screen (\n) and then click\nVersion History\n:\nYou can also access Version History from your dashboard at\nhttps://app.grammarly.com\n:\nYou will be able to download all available versions of your document. If you don't see the version you are looking for, it means that it's no longer available on our servers.",
  "category": "Grammarly Editor (classic)",
  "tags": []
}