{
  "url": "https://support.grammarly.com/hc/en-us/articles/4412816078349-Grammarly-for-Windows-and-Grammarly-for-Mac-user-guide",
  "scraped_at": "2025-08-11T20:36:11.368133+00:00",
  "title": "Grammarly for Windows and Grammarly for Mac user guide",
  "content": "With the help of Grammarly for Windows or Grammarly for Mac, you can access our writing suggestions directly in a wide array of applications and websites.\nBefore you install\nGrammarly for Windows\nor\nGrammarly for Mac\n, please make sure that your computer meets the\nsystem requirements\nfor this app.\nGrammarly for Mac\nIndividual users\nChecking text\nAfter installing Grammarly for Mac, open any application or website and begin typing. Grammarly will highlight areas with suggested improvements using underlines and will display a\nGrammarly tab\non the right edge of your screen.\nTo review suggestions, click the\nGrammarly tab\nor select the\nReview all\nbutton on any suggestion card.\nIf your text includes more than four suggestions, a small Grammarly icon may also appear to indicate additional feedback is available.\nMoving or hiding the Grammarly tab\nThe Grammarly tab can be repositioned vertically along the edge of your screen to suit your preferences.\nTo hide the Grammarly tab while continuing to see suggestion underlines:\nClick the\nGrammarly icon\nin the menu bar.\nSelect\nTurn off Grammarly tab\n.\nNote:\nWhen the Grammarly tab is hidden, you will still see in-line underlines and can access the revision assistant by clicking\nReview all\non a suggestion card.\nTo deactivate Grammarly for Mac temporarily on a specific website or application:\nClick the\nGrammarly icon\nin the menu bar.\nChoose either\nTurn off Grammarly for 1 hour\nor\nTurn off Grammarly\nTo manage blocked applications or sites, navigate to\nSettings → Block list\n, where you can remove items previously added.\nUsing Grammarly’s tone detector\nTo check the tone of your message, make sure your writing contains at least 150 characters, but not more than 2,000 characters. When reviewing the available suggestions, you will then see an emoji directly in the revision assistant. Click the button to find out more about the tone of your message.\nIf you’d like Grammarly to stop checking the tone of your writing, click the Grammarly icon in the menu bar at the top of the screen and then click the gear icon. In the\nCustomization\nmenu, switch off the\nDetect tone in my writing\nsetting.\nTo find out more about the tone detector feature, visit\nMeet Grammarly’s Tone Detector\n.\nUsing the plagiarism checker\nCurrently, the plagiarism checker and AI detector features are available in Grammarly for Mac only in Apple Pages and Microsoft Word.\nTo open the plagiarism checker, click on the Grammarly tab on the right side of the screen and click\nReview all suggestions\n:\nIn the window that appears next, click on the quotation marks icon at the top:\nDeactivating certain suggestions\nIf you are a Grammarly Premium or Grammarly Pro user, you can deactivate specific suggestions.\nTo do this, open your browser, go to\nYour preferences\npage, and switch off a specific group of suggestions. This action will deactivate this group of suggestions in all of the Grammarly product offerings that you use.\nChanging your language preference\nGrammarly offers five dialect options: British English, American English, Canadian English, Australian English, and Indian English. Your language preference is set to American English by default.\nHere’s how to change your language preference in Grammarly for Mac:\nClick the Grammarly icon in the menu bar and go to\nSettings\n.\nGo to\nCustomization\nand select your preferred option next to\nI write in\n.\nAlternatively, you can go to your\nLanguage settings\npage to update your language preference. Keep in mind that updating your language preference will apply this setting to all Grammarly product offerings you use.\nTo learn more about language preference and differences between dialects, visit\nHow to Select Your English Dialect\n.\nManaging your account settings\nSome of your settings are available directly within Grammarly for Mac. To access them, click the Grammarly icon in the menu bar and open the Settings menu. In this menu, you can:\nAccess your account settings\nManage your language preference\nView applications where Grammarly was turned off\nUpdate your writing style and activate Grammarly’s tone detector\nGrammarly Enterprise, Grammarly Business, Grammarly for Education, and Grammarly Pro Teams\nChecking text\nAfter installing the application, open any app or website on your computer and start typing—a floating Grammarly widget should appear on your screen. When Grammarly detects a writing issue, it will underline the problematic word or phrase automatically. You’ll also see the number of identified issues on the widget:\nWhen you’re ready to check your writing, click on the underlined word or the floating Grammarly widget to see the suggestion.\nNote:\nIn Microsoft Word, Grammarly may show a different interface with a list of suggestions. This interface allows you to review suggestions for the next 10 pages based on your cursor’s position. To view suggestions for other pages, move the cursor elsewhere in the text.\nClick on a suggestion to\naccept\nit. You can\nlearn more\nby clicking the three dots on the card. To\ndismiss\nan unhelpful suggestion, click the trash bin icon.\nMoving the Grammarly widget\nGrammarly now features anchor points around text boxes and window corners, allowing the widget to stay fixed when minimized. This way, you’ll always know where to find Grammarly.\nIf the initial location overlaps an important function, you can drag the widget to another anchor point, identified by small blue icons. As you approach a new anchor, the dot will expand, pinning Grammarly to that location.\nGrammarly for Mac remembers your selected window location per app or website.\nWhen you open Grammarly to check available suggestions, you can move the window to any location on your screen. If you click the\nX\nin the upper-right corner or navigate to another window, Grammarly will return to its anchored position.\nUsing Grammarly’s tone detector\nTo check the tone of your message, make sure it contains between 150 and 2000 characters. Once you’ve done that, you will see an emoji on the floating Grammarly widget that indicates the tone of your writing. Click the emoji to find out more about the tone of your message.\nIf you’d like Grammarly to stop checking the tone of your writing, click the floating Grammarly widget and then click the gear icon. In the\nCustomization\nmenu, switch off the\nDetect tone in my writing\nsetting.\nTo find out more about the tone detector feature, visit\nMeet Grammarly’s Tone Detector\n.\nDeactivating certain suggestions\nIf you are a Grammarly Pro, Grammarly for Business, or Grammarly for Education user, you can deactivate specific suggestions:\nOpen your browser, go to\nYour preferences\npage, and switch off a specific group of suggestions. Doing so will deactivate this group of suggestions in all of the Grammarly product offerings that you use.\nChanging your language preference\nGrammarly offers five dialect options: British English, American English, Canadian English, Australian English, and Indian English. Your language preference is set to American English by default. To change it:\nClick the floating Grammarly widget and then click the gear icon in the upper-right corner.\nGo to\nWriting Style\nand select your preferred option next to\nI write in\n.\nAlternatively, you can go to your\nLanguage settings\npage to update your language preference. Keep in mind that updating your language preference will apply this setting to all Grammarly product offerings you use.\nTo learn more about language preference and differences between dialects, visit\nHow to Select Your English Dialect\n.\nManaging your account settings\nAccess your settings in Grammarly for Mac by clicking the Grammarly widget and selecting the gear icon in the upper-right corner.\nIn this menu, you can:\nAccess your account settings\nManage your language preference\nView applications where Grammarly was turned off\nUpdate your writing style and activate Grammarly’s tone detector\nGrammarly for Windows\nChecking text\nAfter installing the application, open any app or website on your computer and start typing—a floating Grammarly widget should appear on your screen.\nWhen Grammarly detects a writing issue, it will underline the problematic word or phrase automatically. You’ll also see the number of identified issues on the widget:\nWhen you’re ready to check your writing, click on the underlined word or the floating Grammarly widget to see the suggestion.\nNote:\nIn Microsoft Word, Grammarly may show a different interface with a list of suggestions. This interface allows you to review suggestions for the next 10 pages based on your cursor’s position. To view suggestions for other pages, move the cursor elsewhere in the text.\nClick on a suggestion to\naccept\nit. You can\nlearn more\nby clicking the three dots on the card. To\ndismiss\nan unhelpful suggestion, click the trash bin icon.\nMoving the Grammarly widget\nGrammarly now features anchor points around text boxes and window corners, allowing the widget to stay fixed when minimized. This way, you’ll always know where to find Grammarly.\nIf the initial location overlaps an important function, you can drag the widget to another anchor point, identified by small blue icons. As you approach a new anchor, the dot will expand, pinning Grammarly to that location.\nGrammarly for Windows remembers your selected window location per app or website.\nWhen you open Grammarly to check available suggestions, you can move the window to any location on your screen. If you click the\nX\nin the upper-right corner or navigate to another window, Grammarly will return to its anchored position.\nUsing Grammarly’s tone detector\nTo check the tone of your message, make sure it contains between 150 and 2000 characters. Once you’ve done that, you will see an emoji on the floating Grammarly widget that indicates the tone of your writing. Click the emoji to find out more about the tone of your message.\nIf you’d like Grammarly to stop checking the tone of your writing, click the floating Grammarly widget and then click the gear icon. In the\nCustomization\nmenu, switch off the\nDetect tone in my writing\nsetting.\nTo find out more about the tone detector feature, visit\nMeet Grammarly’s Tone Detector\n.\nDeactivating certain suggestions\nIf you are a Grammarly Pro, Grammarly for Business, or Grammarly for Education user, you can deactivate specific suggestions:\nOpen your browser, go to\nYour preferences\npage, and switch off a specific group of suggestions. Doing so will deactivate this group of suggestions in all of the Grammarly product offerings that you use.\nChanging your language preference\nGrammarly offers five dialect options: British English, American English, Canadian English, Australian English, and Indian English. Your language preference is set to American English by default. To change it:\nClick the floating Grammarly widget and then click the gear icon in the upper-right corner.\nGo to\nWriting Style\nand select your preferred option next to\nI write in\n.\nAlternatively, you can go to your\nLanguage settings\npage to update your language preference. Keep in mind that updating your language preference will apply this setting to all Grammarly product offerings you use.\nTo learn more about language preference and differences between dialects, visit\nHow to Select Your English Dialect\n.\nManaging your account settings\nAccess your settings in Grammarly for Windows by clicking the Grammarly widget and selecting the gear icon in the upper-right corner.\nIn this menu, you can:\nAccess your account settings\nManage your language preference\nView applications where Grammarly was turned off\nUpdate your writing style and activate Grammarly’s tone detector",
  "category": "Grammarly for Windows and Mac",
  "tags": []
}