{
  "url": "https://support.grammarly.com/hc/en-us/articles/19489029001869-How-to-automatically-join-or-send-a-request-to-join-a-team-plan",
  "scraped_at": "2025-08-11T20:34:25.952587+00:00",
  "title": "How to automatically join or send a request to join a team plan",
  "content": "Included in:\nGrammarly Pro and Business plans with an organizational domain and not using SSO\nManaged by:\nAdmins\nTo enable your team members to seamlessly join your team plan, you can allow them to discover your plan and instantly join it when they sign up for a Grammarly account using your organization’s email domain. This means your colleagues will spend less time waiting for access, and it allows you to expand access to Grammarly to your whole team efficiently.\nAlternatively, your team members can request to join your team plan directly from their accounts, and you can accept or decline their requests.\nFor admins:\nYou can set your preferred way for new members to join your plan on the\nInvite Settings\npage:\nIf you'd like to allow anyone with your organizational domain to discover and join your team plan, choose the\nAnyone with the domain … can discover and join your account\noption\n.\nNote:\nFor Grammarly Pro plans with one or two members, choosing this option will still require new members to request to join the team’s plan.\nTo have the option to approve or reject your team members’ requests to join your plan, check the box next to\nRequire admin approval\n.\nIf you’d like further control over who can join your plan, select\nOnly invited colleagues can join your account\n.\nIf the\nRequire admin approval\nbox is checked, team members cannot instantly join your team plan. Instead, they can submit requests to join, and you can then accept or decline their requests.\nAdmins can either accept requests directly from the email notifications they receive or review all pending requests on the corresponding page.\nTo access the membership requests page, navigate to the\nMembers\npage and select the\nMembership requests\ntab at the top. From there, you can review the pending membership requests and accept or decline them. When a membership request is accepted, the person who submitted it will be notified.\nNote:\nMembership requests are automatically canceled if no action is taken within 30 days.\nBilling process\nIf all seats in your team plan have been allotted, additional seats will be automatically added when more team members join by either discovering your plan at the sign-up or after you’ve accepted their requests to join. You will be charged for the additional seats within a 60-day period.\nThe charge date for the additional seats will be shown on the\nSubscription\npage under the number of additional seats in use.\nYou can update or reallocate seats anytime before that date. To learn more, check out this article:\nAbout true-up billing\nFor team members:\nTeam members can instantly join their team’s plan when creating their Grammarly accounts if the following conditions are met:\nTheir email domain matches an active team plan that does not use SAML single sign-on (SSO) for authentication.\nThe admin has enabled the option for team members with matching domains to discover and join the plan.\nTo join your team’s plan, please follow the steps below:\nGo to\nwww.grammarly.com/signup\nEnter your name, your corporate email address, and a password. You may be prompted to verify your account by entering a six-digit verification code sent to your email address.\nIf your organization has a team plan, you’ll be redirected to a page where you can select your specific team (you’ll see the team name and its admin). Select the team you’d like to join from the list and click\nJoin team\n:\nYou will be instantly added to your team’s plan and receive access to all advanced features, as well as team features set up by your organization. Next, click\nContinue\nto finalize your onboarding process.\nIf you do not see the section titled\nJoin your team to benefit from exclusive features\n, it means there are no active team plans that you can join at this time.\nAlternatively, if the admin of a team plan has allowed new members to request to join their plan, you can send a membership request after signing up for a Grammarly account or from your existing account.\nIf you already have a Grammarly Free account, you can send a request to join your team’s plan on your\nProfile\npage or at\ngrammarly.com/request-to-join\n. If you do not see the option to send a request to join your team, it means there are no active team plans that you can request to join at this time.\nNote:\nIf you haven’t created a Grammarly account yet, you can do so and request to join your team’s plan directly from this page:\ngrammarly.com/request-to-join",
  "category": "Manage Members & Permissions",
  "tags": []
}