{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000091571-Access-Grammarly-on-a-new-device",
  "scraped_at": "2025-08-11T20:31:10.726652+00:00",
  "title": "Access Grammarly on a new device",
  "content": "You can access and use your Grammarly account on up to five different devices.\nIf you have a new device, you don’t need to purchase a new subscription or create a new account if you’d like to use Grammarly on it.\nImportant:\nPlease be sure to use the email address associated with your Grammarly account to log in — this will help you avoid creating several accounts. If you forgot your password, use this link to reset it:\nReset your password\n.\nTo use the Grammarly Editor on a new device, you just need to log in to your Grammarly account at\nhttps://app.grammarly.com/\n. To learn more about the Grammarly Editor, go to the\nGrammarly Editor user guide\n.\nIf you need to install Grammarly on your new device, please check the instructions below:\nGrammarly for Windows\nFollow this link to download the app:\nhttps://www.grammarly.com/desktop/windows\nDouble-click on the downloaded file and follow the prompts on the screen to complete the installation. Grammarly should then appear in your system tray, located in the lower-right corner of the screen.\nOpen any app or website and start typing. You should see the floating Grammarly widget, and Grammarly will automatically start checking your text.\nTo learn more about this product offering, check out this article:\nGrammarly for Windows and Mac user guide\nGrammarly for Mac\nFollow this link to download the app:\nhttps://www.grammarly.com/desktop/mac\nDouble-click on the downloaded file and follow the prompts on the screen to complete the installation. Grammarly should then appear in the menu located at the top of your screen.\nTo learn more about this product offering, check out this article:\nGrammarly for Windows and Mac user guide\nGrammarly for iPhone\nGo to\nGrammarly: AI Writing Keyboard\nor open the App Store on your iPhone and search for “Grammarly.” Then tap\nGet\nto install the application.\nFor\ninstructions on how to configure Grammarly, please follow the steps in this article:\nHow to install Grammarly for iPhone\n.\nTo learn more about the application and how to use it, check this guide:\nGrammarly for iPhone user guide\n.\nGrammarly for Android\nGo to\nGrammarly-AI Writing Assistant\nor open the Google Play Store on your Android device and search for \"Grammarly.\" Then tap\nInstall\nto begin the installation.\nTo learn more about Grammarly for Android and how to use it, check this guide:\nGrammarly for Android user guide\n.\nGrammarly for iPad\nTo begin the installation, go to\nGrammarly: AI Writing Keyboard\nor open the App Store on your iOS device and search for \"Grammarly.\" Then tap\nGet\nto install the application.\nTo learn more about how to use Grammarly for iPad, visit this page:\nGrammarly for iPad user guide\n.",
  "category": "Common Questions",
  "tags": []
}