{
  "url": "https://support.grammarly.com/hc/en-us/articles/32955241736973-AI-Chat-user-guide",
  "scraped_at": "2025-08-11T20:38:22.116900+00:00",
  "title": "AI Chat user guide",
  "content": "Important:\nAI Chat is currently available to individual users on Grammarly for Mac, to a limited group of users on Grammarly for Chrome, and to Free, Pro, and Premium users within docs.\nGrammarly’s AI Chat integrates generative AI directly into your workflow, enabling you to get help wherever you're writing. Whether you need to ask a question, brainstorm ideas, receive recommendations, draft content, or polish existing text, AI Chat is designed to support you in real time.\nYou can view suggestions, launch the revision assistant, and interact with AI—all from the same interface.\nGetting Started with AI Chat\nGrammarly for Mac\nTo use AI Chat:\nInstall\nGrammarly for Mac\n.\nHover over the right edge of your screen to reveal the\nGrammarly tab\n.\nClick the\nGrammarly tab\nto start the chat with AI or review the available suggestions:\nIf Grammarly has more than four suggestions, a small Grammarly icon will also appear as a visual cue.\nUsing AI Chat\nTo interact with the AI, type your prompt directly into the text area that appears after clicking the Grammarly tab. Grammarly’s AI will use the context from your active window to tailor its response.\nYou can ask for:\nContent generation (emails, summaries, blog drafts, etc.)\nFeedback or suggestions\nHelp with rewriting, tone adjustments, and clarity\nNote:\nYou can use\nup to 1,000 prompts per day\n. If you reach your limit, AI Chat will reset the next day.\nControlling Context with Window Awareness\nAI Chat uses context from the currently active window to provide more personalized and relevant assistance.\nTo change the context:\nClick\nAttach\nin the AI Chat interface.\nChoose a different open window to guide the AI’s response.\nLimitations:\nWindow awareness does\nnot\ncurrently support\nGoogle Docs\nor\nGoogle Slides\n. However, if you highlight text in a Google Doc while the assistant is open, the AI can still use that selected text for ideation and suggestions.\nExploring Multiple Output Options with Ideation Tabs\nWhen Grammarly generates or enhances content based on your prompt, you’ll receive\nup to three alternative versions\nof the output. This feature—called\nIdeation Tabs\n—lets you:\nCompare responses\nChoose the most relevant version\nAsk for refinements or additional options\nUsing quick prompts\nTo use preset quick prompts, select the text you’d like to improve, and click the blue sidebar that appears on the left:\nGrammarly for Mac overlaps my text\nIf Grammarly’s tab overlaps text or an important interface element, you can move the Grammarly tab up and down along the scrollbar.\nIf this doesn’t resolve the issue, please provide the following information:\nThe name of the application where this issue occurs or the URL (web address)\nA\nvideo\nof the issue you’re experiencing\nMoving or Hiding the Grammarly tab\nYou can reposition the Grammarly tab vertically along the edge of your screen.\nTo hide the Grammarly tab:\nClick the\nGrammarly icon\nin the menu bar.\nSelect\nTurn off Grammarly tab\n.\nNote:\nEven when the Grammarly tab is hidden, Grammarly will continue to underline suggestions. You can still access the revision assistant via the\nReview all\nbutton.\nGrammarly for Chrome\nTo use AI Chat:\nMake sure that you have Grammarly for Chrome installed. If you haven’t yet, you can download Grammarly for Chrome by following this link:\nChrome Web Store | Grammarly: Grammar Checker and Writing App\n.\nHover over the right edge of your screen to reveal the\nGrammarly tab\n.\nClick the\nGrammarly tab\nto start a chat with AI or review the available suggestions:\nUsing quick prompts\nTo use preset quick prompts, select the text you’d like to improve, and click the blue sidebar that appears on the left:\nControlling Context with Window Awareness\nAI Chat uses context from the currently active window to provide more personalized and relevant assistance.\nTo change the context:\nClick\nAttach\nin the AI Chat interface.\nChoose a different open window to guide the AI’s response.\nMoving or Hiding the Grammarly tab\nYou can reposition the Grammarly tab vertically along the edge of your screen.\nTo hide the Grammarly tab:\nClick the Grammarly browser extension icon in the browser’s menu bar.\nScroll down to the\nGenerative AI\nsection, and switch\nUse docked chat launcher\noff.\nAlternatively, hover over the Grammarly tab on the right and click the\nSettings\ngear icon, then select\nHide Everywhere:\nDocs\nUsing AI Chat\nTo interact with the AI, type your prompt directly into the text area that appears after clicking the AI Chat icon. Grammarly’s AI will use the context from docs to tailor its response:\nYou can ask AI Chat to:\nGenerate content (emails, summaries, blog drafts, etc.)\nProvide feedback or suggestions\nHelp with rewriting, tone adjustments, and clarity\nNote:\nYou can use up to 1,000 prompts per day. If you reach your limit, AI Chat will reset the next day.",
  "category": "Generative AI assistance",
  "tags": []
}