{
  "url": "https://support.grammarly.com/hc/en-us/articles/115000089992-Select-between-British-English-American-English-Canadian-English-Australian-English-and-Indian-English",
  "scraped_at": "2025-08-11T20:29:53.232718+00:00",
  "title": "Select between British English, American English, Canadian English, Australian English, and Indian English",
  "content": "You can specify whether you'd like to use an American, British, Canadian, Australian, or Indian dialect to check your writing. In addition to the spelling differences between these dialects, Grammarly recognizes a number of differences in grammar and punctuation.\nPlease follow the steps below to choose a specific dialect in your preferred Grammarly product. Keep in mind that this setting should automatically synchronize across all Grammarly products that you use.\nGrammarly for Windows and Mac\nTo change your language preference in Grammarly for Windows or Grammarly for Mac:\nClick the floating Grammarly widget.\nThen, click the gear icon in the upper-right corner of the pop-up.\nGo to\nWriting Style.\nClick\nWriting\nand select\nLanguage settings\n.\nIn the\nDialect\nsection, select your preferred one from the dropdown menu.\nAlternatively, you can also go to\nhttps://account.grammarly.com/customize/language\ndirectly and update your language preference there. Keep in mind that updating your language preference will apply the corresponding setting to all Grammarly product offerings you use.\nThe Grammarly Editor\nFirst,\nsign in\nto your Grammarly account, go to\nAccount\n>\nWriting\n, and click\nLanguage settings\n. Then, select your preferred option next to\nI write in\n:\nThe Grammarly browser extension\nTo set up your language preferences in the Grammarly browser extension, click the Grammarly icon in your browser’s toolbar and select your preferred setting in the dropdown menu next to\nI write in\n:\nGrammarly for iPhone\nOpen the Grammarly companion app and tap\nAccount\n. Then, tap\nLanguage Preference\nand choose your preferred dialect.\nGrammarly for iPad\nTo manage your\nLanguage Preference\n, open the Grammarly app, and tap\nAccount\nat the bottom of the screen. Then\n, press\nLanguage Preference\nto choose a dialect:\nGrammarly for Android\nLaunch the Grammarly app on your Android device, tap\nLanguages\n, then tap the three dots next to\nEnglish\n. From the menu that appears, tap\nDialects\nand select your preferred setting from the list of options.\nGrammarly for Microsoft Office\nIn Microsoft Word or Outlook on your Windows computer, open the Grammarly tab and click\nSettings\n. Then, click\nLanguage Preference\nto change your dialect.\nGrammarly for Microsoft Word on Mac\nTo change your language preference in Microsoft Word on your Mac, open any Word document and click\nOpen Grammarly\n. Once the Grammarly sidebar appears, click the gear icon in the lower right corner and check the box next to the preferred option:\nTo learn more about differences between dialects, please review\nthis article\n.",
  "category": "Account Settings",
  "tags": []
}